	.global start	; 定义全局标号
	.mmregs
	.text
start:
	nop
	ld		#68,dp	; 直接寻址，装载DP值，页指针指向数据区0x2200
	st		#1,1	; 绝对地址2201H开始的四个单元存1，2，3，4
	st		#2,2    ; 
	st		#3,3	; 
	st		#4,4    ; 
	
	stm		#2205h,ar1		; 间接寻址，使用辅助寄存器1
	rpt		#3				; 循环重复执行下条语句4次
	st 		#1234h,*ar1+	; 将绝对地址2205H开始的4个单元存成1234H
							
							; 下面将2201H开始的8个数读出存到2300H开始的8个单元
	stm		#7h,ar3			; 循环计数器=7（8次循环）
	stm		#2201h,ar1		; 源起始地址
	stm		#2300h,ar2		; 目的起始地址
loop:
	ld 		*ar1+,T 		; 将ar1指向单元内容读入T寄存器，ar1的值+1
	st 		T,*ar2+			; 将T寄存器的值转存到ar2指向的目的地址，ar2的值+1
	banz	loop,*ar3-		; ar3的值-1，循环计数不等于0则循环
xh:
	b 		xh				; 空循环
	.end

	
