TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE    1

    5883              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:11 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3586                      .dwattr $C$DW$261, DW_AT_TI_begin_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/
    3587                      .dwattr $C$DW$261, DW_AT_TI_begin_line(0x291)
    3588                      .dwattr $C$DW$261, DW_AT_TI_end_line(0x29e)
    3589              $C$DW$262       .dwtag  DW_TAG_TI_loop_range
    3590                      .dwattr $C$DW$262, DW_AT_low_pc($C$DW$L$_uniq$2$B)
    3591                      .dwattr $C$DW$262, DW_AT_high_pc($C$DW$L$_uniq$2$E)
    3592              $C$DW$263       .dwtag  DW_TAG_TI_loop_range
    3593                      .dwattr $C$DW$263, DW_AT_low_pc($C$DW$L$_uniq$13$B)
    3594                      .dwattr $C$DW$263, DW_AT_high_pc($C$DW$L$_uniq$13$E)
    3595              
    3596              $C$DW$264       .dwtag  DW_TAG_TI_loop
    3597                      .dwattr $C$DW$264, DW_AT_name("C:\\Users\\a0221074\\AppData\\Local\\Temp\\0730410:$C$L120:2:150533479
    3598                      .dwattr $C$DW$264, DW_AT_TI_begin_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/
    3599                      .dwattr $C$DW$264, DW_AT_TI_begin_line(0x292)
    3600                      .dwattr $C$DW$264, DW_AT_TI_end_line(0x29d)
    3601              $C$DW$265       .dwtag  DW_TAG_TI_loop_range
    3602                      .dwattr $C$DW$265, DW_AT_low_pc($C$DW$L$_uniq$3$B)
    3603                      .dwattr $C$DW$265, DW_AT_high_pc($C$DW$L$_uniq$3$E)
    3604              $C$DW$266       .dwtag  DW_TAG_TI_loop_range
    3605                      .dwattr $C$DW$266, DW_AT_low_pc($C$DW$L$_uniq$4$B)
    3606                      .dwattr $C$DW$266, DW_AT_high_pc($C$DW$L$_uniq$4$E)
    3607              $C$DW$267       .dwtag  DW_TAG_TI_loop_range
    3608                      .dwattr $C$DW$267, DW_AT_low_pc($C$DW$L$_uniq$5$B)
    3609                      .dwattr $C$DW$267, DW_AT_high_pc($C$DW$L$_uniq$5$E)
    3610              $C$DW$268       .dwtag  DW_TAG_TI_loop_range
    3611                      .dwattr $C$DW$268, DW_AT_low_pc($C$DW$L$_uniq$6$B)
    3612                      .dwattr $C$DW$268, DW_AT_high_pc($C$DW$L$_uniq$6$E)
    3613              $C$DW$269       .dwtag  DW_TAG_TI_loop_range
    3614                      .dwattr $C$DW$269, DW_AT_low_pc($C$DW$L$_uniq$10$B)
    3615                      .dwattr $C$DW$269, DW_AT_high_pc($C$DW$L$_uniq$10$E)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   79

    3616              $C$DW$270       .dwtag  DW_TAG_TI_loop_range
    3617                      .dwattr $C$DW$270, DW_AT_low_pc($C$DW$L$_uniq$11$B)
    3618                      .dwattr $C$DW$270, DW_AT_high_pc($C$DW$L$_uniq$11$E)
    3619              $C$DW$271       .dwtag  DW_TAG_TI_loop_range
    3620                      .dwattr $C$DW$271, DW_AT_low_pc($C$DW$L$_uniq$12$B)
    3621                      .dwattr $C$DW$271, DW_AT_high_pc($C$DW$L$_uniq$12$E)
    3622              
    3623              $C$DW$272       .dwtag  DW_TAG_TI_loop
    3624                      .dwattr $C$DW$272, DW_AT_name("C:\\Users\\a0221074\\AppData\\Local\\Temp\\0730410:$C$L122:3:150533479
    3625                      .dwattr $C$DW$272, DW_AT_TI_begin_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/
    3626                      .dwattr $C$DW$272, DW_AT_TI_begin_line(0x296)
    3627                      .dwattr $C$DW$272, DW_AT_TI_end_line(0x29a)
    3628              $C$DW$273       .dwtag  DW_TAG_TI_loop_range
    3629                      .dwattr $C$DW$273, DW_AT_low_pc($C$DW$L$_uniq$7$B)
    3630                      .dwattr $C$DW$273, DW_AT_high_pc($C$DW$L$_uniq$7$E)
    3631              $C$DW$274       .dwtag  DW_TAG_TI_loop_range
    3632                      .dwattr $C$DW$274, DW_AT_low_pc($C$DW$L$_uniq$8$B)
    3633                      .dwattr $C$DW$274, DW_AT_high_pc($C$DW$L$_uniq$8$E)
    3634              $C$DW$275       .dwtag  DW_TAG_TI_loop_range
    3635                      .dwattr $C$DW$275, DW_AT_low_pc($C$DW$L$_uniq$9$B)
    3636                      .dwattr $C$DW$275, DW_AT_high_pc($C$DW$L$_uniq$9$E)
    3637                      .dwendtag $C$DW$272
    3638              
    3639                      .dwendtag $C$DW$264
    3640              
    3641                      .dwendtag $C$DW$261
    3642              
    3643                      .dwattr $C$DW$250, DW_AT_TI_end_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CS
    3644                      .dwattr $C$DW$250, DW_AT_TI_end_line(0x2a1)
    3645                      .dwattr $C$DW$250, DW_AT_TI_end_column(0x01)
    3646                      .dwendentry
    3647                      .dwendtag $C$DW$250
    3648              
    3649              ;******************************************************************************
    3650              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    3651              ;******************************************************************************
    3652                      .global __divli
    3653                      .global __mpyli
    3654              
    3655              ;*******************************************************************************
    3656              ;* TYPE INFORMATION                                                            *
    3657              ;*******************************************************************************
    3658              
    3659              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3660                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
    3661              $C$DW$276       .dwtag  DW_TAG_member
    3662                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$8)
    3663                      .dwattr $C$DW$276, DW_AT_name("num")
    3664                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_num")
    3665                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3666                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3667              $C$DW$277       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$8)
    3669                      .dwattr $C$DW$277, DW_AT_name("x1")
    3670                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_x1")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   80

    3671                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3672                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3673              $C$DW$278       .dwtag  DW_TAG_member
    3674                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$8)
    3675                      .dwattr $C$DW$278, DW_AT_name("x2")
    3676                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_x2")
    3677                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3678                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3679                      .dwendtag $C$DW$T$19
    3680              
    3681              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    3682                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$19)
    3683                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3684              $C$DW$279       .dwtag  DW_TAG_TI_far_type
    3685                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$56)
    3686              $C$DW$T$57      .dwtag  DW_TAG_const_type
    3687                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$279)
    3688              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    3689                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3690                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
    3691              
    3692              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3693                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    3694              $C$DW$280       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    3696                      .dwattr $C$DW$280, DW_AT_name("max_mem_usage")
    3697                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_max_mem_usage")
    3698                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3699                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3700              $C$DW$281       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    3702                      .dwattr $C$DW$281, DW_AT_name("n_terminals")
    3703                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_n_terminals")
    3704                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3705                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3706              $C$DW$282       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    3708                      .dwattr $C$DW$282, DW_AT_name("n_monophones")
    3709                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_n_monophones")
    3710                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3711                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$283       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    3714                      .dwattr $C$DW$283, DW_AT_name("hlrTreeBase")
    3715                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_hlrTreeBase")
    3716                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3717                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3718              $C$DW$284       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$22)
    3720                      .dwattr $C$DW$284, DW_AT_name("hlrTerminal")
    3721                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_hlrTerminal")
    3722                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3723                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3724              $C$DW$285       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   81

    3726                      .dwattr $C$DW$285, DW_AT_name("pHMM2phone")
    3727                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_pHMM2phone")
    3728                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3729                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$286       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$22)
    3732                      .dwattr $C$DW$286, DW_AT_name("hlrTransformIndex")
    3733                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_hlrTransformIndex")
    3734                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3735                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3736              $C$DW$287       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    3738                      .dwattr $C$DW$287, DW_AT_name("hlr_TRANSFORM_SIZE")
    3739                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    3740                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3741                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3742              $C$DW$288       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$21)
    3744                      .dwattr $C$DW$288, DW_AT_name("hlrTransforms")
    3745                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_hlrTransforms")
    3746                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3747                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3748              $C$DW$289       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$21)
    3750                      .dwattr $C$DW$289, DW_AT_name("pSegStat_dif1")
    3751                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_pSegStat_dif1")
    3752                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3753                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3754              $C$DW$290       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    3756                      .dwattr $C$DW$290, DW_AT_name("pSegStat_dif2")
    3757                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_pSegStat_dif2")
    3758                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3759                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3760              $C$DW$291       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    3762                      .dwattr $C$DW$291, DW_AT_name("pEnhanced")
    3763                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_pEnhanced")
    3764                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3765                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3766              $C$DW$292       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$21)
    3768                      .dwattr $C$DW$292, DW_AT_name("bk_node_cnt")
    3769                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_bk_node_cnt")
    3770                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3771                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3772                      .dwendtag $C$DW$T$23
    3773              
    3774              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    3775                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$23)
    3776                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3777              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    3778                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3779                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
    3780              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   82

    3781              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3782                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    3783              $C$DW$293       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$9)
    3785                      .dwattr $C$DW$293, DW_AT_name("sym_code")
    3786                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_sym_code")
    3787                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3788                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3789              $C$DW$294       .dwtag  DW_TAG_member
    3790                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$9)
    3791                      .dwattr $C$DW$294, DW_AT_name("start_cell")
    3792                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_start_cell")
    3793                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3794                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3795              $C$DW$295       .dwtag  DW_TAG_member
    3796                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$9)
    3797                      .dwattr $C$DW$295, DW_AT_name("depth")
    3798                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_depth")
    3799                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3800                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3801                      .dwendtag $C$DW$T$24
    3802              
    3803              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    3804                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$24)
    3805                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3806              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    3807                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    3808                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    3809              
    3810              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3811                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    3812              $C$DW$296       .dwtag  DW_TAG_member
    3813                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$8)
    3814                      .dwattr $C$DW$296, DW_AT_name("scr")
    3815                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_scr")
    3816                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3817                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3818              $C$DW$297       .dwtag  DW_TAG_member
    3819                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$9)
    3820                      .dwattr $C$DW$297, DW_AT_name("sym")
    3821                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_sym")
    3822                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3823                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3824              $C$DW$298       .dwtag  DW_TAG_member
    3825                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$9)
    3826                      .dwattr $C$DW$298, DW_AT_name("frm")
    3827                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_frm")
    3828                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3829                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3830                      .dwendtag $C$DW$T$25
    3831              
    3832              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    3833                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$25)
    3834                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3835              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   83

    3836                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    3837                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    3838              
    3839              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3840                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    3841              $C$DW$299       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$9)
    3843                      .dwattr $C$DW$299, DW_AT_name("frm")
    3844                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_frm")
    3845                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3846                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3847              $C$DW$300       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$9)
    3849                      .dwattr $C$DW$300, DW_AT_name("beam_idx")
    3850                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_beam_idx")
    3851                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3852                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3853                      .dwendtag $C$DW$T$26
    3854              
    3855              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    3856                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$26)
    3857                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3858              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    3859                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3860                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    3861              
    3862              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3863                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    3864              $C$DW$301       .dwtag  DW_TAG_member
    3865                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$9)
    3866                      .dwattr $C$DW$301, DW_AT_name("n_hmm")
    3867                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_n_hmm")
    3868                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3869                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3870              $C$DW$302       .dwtag  DW_TAG_member
    3871                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$9)
    3872                      .dwattr $C$DW$302, DW_AT_name("n_sym")
    3873                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_n_sym")
    3874                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3875                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3876              $C$DW$303       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$9)
    3878                      .dwattr $C$DW$303, DW_AT_name("n_word")
    3879                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_n_word")
    3880                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3881                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3882              $C$DW$304       .dwtag  DW_TAG_member
    3883                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$9)
    3884                      .dwattr $C$DW$304, DW_AT_name("n_set")
    3885                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_n_set")
    3886                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3887                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3888              $C$DW$305       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$9)
    3890                      .dwattr $C$DW$305, DW_AT_name("n_hmm_set")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   84

    3891                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_n_hmm_set")
    3892                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3893                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3894              $C$DW$306       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$9)
    3896                      .dwattr $C$DW$306, DW_AT_name("start")
    3897                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_start")
    3898                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3899                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3900              $C$DW$307       .dwtag  DW_TAG_member
    3901                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$9)
    3902                      .dwattr $C$DW$307, DW_AT_name("stop")
    3903                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_stop")
    3904                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3905                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3906              $C$DW$308       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$27)
    3908                      .dwattr $C$DW$308, DW_AT_name("symlist")
    3909                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_symlist")
    3910                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3911                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3912                      .dwendtag $C$DW$T$28
    3913              
    3914              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    3915                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    3916                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3917              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    3918                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    3919                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    3920              
    3921              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3922                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    3923              $C$DW$309       .dwtag  DW_TAG_member
    3924                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$9)
    3925                      .dwattr $C$DW$309, DW_AT_name("high_pos")
    3926                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_high_pos")
    3927                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3928                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3929              $C$DW$310       .dwtag  DW_TAG_member
    3930                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$9)
    3931                      .dwattr $C$DW$310, DW_AT_name("cur_pos")
    3932                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_cur_pos")
    3933                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3934                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3935                      .dwendtag $C$DW$T$29
    3936              
    3937              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    3938                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3939                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3940              
    3941              $C$DW$T$31      .dwtag  DW_TAG_array_type
    3942                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3943                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3944                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    3945              $C$DW$311       .dwtag  DW_TAG_subrange_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   85

    3946                      .dwattr $C$DW$311, DW_AT_upper_bound(0x01)
    3947                      .dwendtag $C$DW$T$31
    3948              
    3949              
    3950              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3951                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    3952              $C$DW$312       .dwtag  DW_TAG_member
    3953                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$30)
    3954                      .dwattr $C$DW$312, DW_AT_name("state")
    3955                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_state")
    3956                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3957                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3958              $C$DW$313       .dwtag  DW_TAG_member
    3959                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$31)
    3960                      .dwattr $C$DW$313, DW_AT_name("sym")
    3961                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_sym")
    3962                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3963                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3964              $C$DW$314       .dwtag  DW_TAG_member
    3965                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$30)
    3966                      .dwattr $C$DW$314, DW_AT_name("beam")
    3967                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_beam")
    3968                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3969                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3970              $C$DW$315       .dwtag  DW_TAG_member
    3971                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$30)
    3972                      .dwattr $C$DW$315, DW_AT_name("time")
    3973                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_time")
    3974                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3975                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3976                      .dwendtag $C$DW$T$32
    3977              
    3978              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    3979                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$32)
    3980                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3981              
    3982              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3983                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
    3984              $C$DW$316       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$33)
    3986                      .dwattr $C$DW$316, DW_AT_name("cur_sym")
    3987                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_cur_sym")
    3988                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3989                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3990              $C$DW$317       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$9)
    3992                      .dwattr $C$DW$317, DW_AT_name("cur_state")
    3993                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_cur_state")
    3994                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3995                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3996                      .dwendtag $C$DW$T$34
    3997              
    3998              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    3999                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
    4000                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   86

    4001              
    4002              $C$DW$T$81      .dwtag  DW_TAG_array_type
    4003                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    4004                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4005                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x06)
    4006              $C$DW$318       .dwtag  DW_TAG_subrange_type
    4007                      .dwattr $C$DW$318, DW_AT_upper_bound(0x01)
    4008                      .dwendtag $C$DW$T$81
    4009              
    4010              
    4011              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4012                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    4013              $C$DW$319       .dwtag  DW_TAG_member
    4014                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$9)
    4015                      .dwattr $C$DW$319, DW_AT_name("max_nbr_syms")
    4016                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_max_nbr_syms")
    4017                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4018                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4019              $C$DW$320       .dwtag  DW_TAG_member
    4020                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$8)
    4021                      .dwattr $C$DW$320, DW_AT_name("nbr_syms")
    4022                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_nbr_syms")
    4023                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4024                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4025              $C$DW$321       .dwtag  DW_TAG_member
    4026                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    4027                      .dwattr $C$DW$321, DW_AT_name("sym2pos")
    4028                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_sym2pos")
    4029                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4030                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4031              $C$DW$322       .dwtag  DW_TAG_member
    4032                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$35)
    4033                      .dwattr $C$DW$322, DW_AT_name("syms")
    4034                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_syms")
    4035                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4036                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4037                      .dwendtag $C$DW$T$36
    4038              
    4039              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    4040                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
    4041                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    4042              
    4043              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4044                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    4045              $C$DW$323       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$8)
    4047                      .dwattr $C$DW$323, DW_AT_name("scr")
    4048                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_scr")
    4049                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4050                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4051              $C$DW$324       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$8)
    4053                      .dwattr $C$DW$324, DW_AT_name("n_ans")
    4054                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_n_ans")
    4055                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   87

    4056                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4057              $C$DW$325       .dwtag  DW_TAG_member
    4058                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$37)
    4059                      .dwattr $C$DW$325, DW_AT_name("answers")
    4060                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_answers")
    4061                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4062                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4063                      .dwendtag $C$DW$T$38
    4064              
    4065              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    4066                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
    4067                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4068              
    4069              $C$DW$T$41      .dwtag  DW_TAG_array_type
    4070                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4071                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4072                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
    4073              $C$DW$326       .dwtag  DW_TAG_subrange_type
    4074                      .dwattr $C$DW$326, DW_AT_upper_bound(0x1d)
    4075                      .dwendtag $C$DW$T$41
    4076              
    4077              
    4078              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    4079                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
    4080              $C$DW$327       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$8)
    4082                      .dwattr $C$DW$327, DW_AT_name("n_bests")
    4083                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_n_bests")
    4084                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4085                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4086              $C$DW$328       .dwtag  DW_TAG_member
    4087                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$39)
    4088                      .dwattr $C$DW$328, DW_AT_name("best_idx")
    4089                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_best_idx")
    4090                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4091                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4092              $C$DW$329       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$41)
    4094                      .dwattr $C$DW$329, DW_AT_name("elem")
    4095                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_elem")
    4096                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4097                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4098                      .dwendtag $C$DW$T$42
    4099              
    4100              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    4101                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
    4102                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4103              
    4104              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4105                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
    4106              $C$DW$330       .dwtag  DW_TAG_member
    4107                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    4108                      .dwattr $C$DW$330, DW_AT_name("alpha_p")
    4109                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_alpha_p")
    4110                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   88

    4111                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4112              $C$DW$331       .dwtag  DW_TAG_member
    4113                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
    4114                      .dwattr $C$DW$331, DW_AT_name("sAlpha")
    4115                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_sAlpha")
    4116                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4117                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4118              $C$DW$332       .dwtag  DW_TAG_member
    4119                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$8)
    4120                      .dwattr $C$DW$332, DW_AT_name("sBeta")
    4121                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_sBeta")
    4122                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4123                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4124              $C$DW$333       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$8)
    4126                      .dwattr $C$DW$333, DW_AT_name("lambdaLTEhigherE")
    4127                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    4128                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4129                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4130              $C$DW$334       .dwtag  DW_TAG_member
    4131                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$8)
    4132                      .dwattr $C$DW$334, DW_AT_name("frm_count")
    4133                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_frm_count")
    4134                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4135                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4136              $C$DW$335       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$20)
    4138                      .dwattr $C$DW$335, DW_AT_name("prob_sp")
    4139                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_prob_sp")
    4140                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4141                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4142              $C$DW$336       .dwtag  DW_TAG_member
    4143                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$21)
    4144                      .dwattr $C$DW$336, DW_AT_name("s_noise_floor")
    4145                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_s_noise_floor")
    4146                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4147                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4148              $C$DW$337       .dwtag  DW_TAG_member
    4149                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    4150                      .dwattr $C$DW$337, DW_AT_name("snr")
    4151                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_snr")
    4152                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4153                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4154              $C$DW$338       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$21)
    4156                      .dwattr $C$DW$338, DW_AT_name("ps_long_term_noise")
    4157                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_ps_long_term_noise")
    4158                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4159                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    4160              $C$DW$339       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$8)
    4162                      .dwattr $C$DW$339, DW_AT_name("frmEn")
    4163                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_frmEn")
    4164                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4165                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   89

    4166              $C$DW$340       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$8)
    4168                      .dwattr $C$DW$340, DW_AT_name("meanEn")
    4169                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_meanEn")
    4170                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4171                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4172              $C$DW$341       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$8)
    4174                      .dwattr $C$DW$341, DW_AT_name("prevMeanEn")
    4175                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_prevMeanEn")
    4176                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4177                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    4178              $C$DW$342       .dwtag  DW_TAG_member
    4179                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$8)
    4180                      .dwattr $C$DW$342, DW_AT_name("noiselvl")
    4181                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_noiselvl")
    4182                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4183                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4184              $C$DW$343       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$8)
    4186                      .dwattr $C$DW$343, DW_AT_name("lambdaLTE")
    4187                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_lambdaLTE")
    4188                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4189                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    4190              $C$DW$344       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$8)
    4192                      .dwattr $C$DW$344, DW_AT_name("nbSpeechFrame")
    4193                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_nbSpeechFrame")
    4194                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4195                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4196              $C$DW$345       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$8)
    4198                      .dwattr $C$DW$345, DW_AT_name("hangOver")
    4199                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_hangOver")
    4200                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4201                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4202                      .dwendtag $C$DW$T$43
    4203              
    4204              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    4205                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$43)
    4206                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    4207              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    4208                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4209                      .dwattr $C$DW$T$87, DW_AT_address_class(0x17)
    4210              
    4211              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4212                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
    4213              $C$DW$346       .dwtag  DW_TAG_member
    4214                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$8)
    4215                      .dwattr $C$DW$346, DW_AT_name("mean")
    4216                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_mean")
    4217                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4218                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4219              $C$DW$347       .dwtag  DW_TAG_member
    4220                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   90

    4221                      .dwattr $C$DW$347, DW_AT_name("inv")
    4222                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_inv")
    4223                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4224                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4225              $C$DW$348       .dwtag  DW_TAG_member
    4226                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$8)
    4227                      .dwattr $C$DW$348, DW_AT_name("gconst")
    4228                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_gconst")
    4229                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4230                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4231                      .dwendtag $C$DW$T$44
    4232              
    4233              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    4234                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    4235                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4236              
    4237              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4238                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
    4239              $C$DW$349       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$45)
    4241                      .dwattr $C$DW$349, DW_AT_name("base_mem")
    4242                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_base_mem")
    4243                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4244                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$350       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    4247                      .dwattr $C$DW$350, DW_AT_name("mem_count")
    4248                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_mem_count")
    4249                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    4250                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4251              $C$DW$351       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$22)
    4253                      .dwattr $C$DW$351, DW_AT_name("answers")
    4254                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_answers")
    4255                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    4256                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4257              $C$DW$352       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$22)
    4259                      .dwattr $C$DW$352, DW_AT_name("uStp")
    4260                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_uStp")
    4261                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    4262                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4263              $C$DW$353       .dwtag  DW_TAG_member
    4264                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    4265                      .dwattr $C$DW$353, DW_AT_name("nWords")
    4266                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_nWords")
    4267                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    4268                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4269              $C$DW$354       .dwtag  DW_TAG_member
    4270                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$8)
    4271                      .dwattr $C$DW$354, DW_AT_name("nS")
    4272                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_nS")
    4273                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    4274                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4275              $C$DW$355       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   91

    4276                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$21)
    4277                      .dwattr $C$DW$355, DW_AT_name("cm_scr")
    4278                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_cm_scr")
    4279                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    4280                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4281              $C$DW$356       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$8)
    4283                      .dwattr $C$DW$356, DW_AT_name("bNeedUpdate")
    4284                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_bNeedUpdate")
    4285                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    4286                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4287              $C$DW$357       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$21)
    4289                      .dwattr $C$DW$357, DW_AT_name("cm_anti_scr")
    4290                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_cm_anti_scr")
    4291                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    4292                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4293              $C$DW$358       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$12)
    4295                      .dwattr $C$DW$358, DW_AT_name("cm_fg_scr")
    4296                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_cm_fg_scr")
    4297                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    4298                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4299              $C$DW$359       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$12)
    4301                      .dwattr $C$DW$359, DW_AT_name("cm_bk_scr")
    4302                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_cm_bk_scr")
    4303                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    4304                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4305              $C$DW$360       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$8)
    4307                      .dwattr $C$DW$360, DW_AT_name("th_nbest")
    4308                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_th_nbest")
    4309                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    4310                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4311              $C$DW$361       .dwtag  DW_TAG_member
    4312                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$8)
    4313                      .dwattr $C$DW$361, DW_AT_name("nSpeech")
    4314                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_nSpeech")
    4315                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    4316                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4317              $C$DW$362       .dwtag  DW_TAG_member
    4318                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$8)
    4319                      .dwattr $C$DW$362, DW_AT_name("nNoise")
    4320                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_nNoise")
    4321                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    4322                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4323              $C$DW$363       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$12)
    4325                      .dwattr $C$DW$363, DW_AT_name("speech_power")
    4326                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_speech_power")
    4327                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    4328                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4329              $C$DW$364       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$12)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   92

    4331                      .dwattr $C$DW$364, DW_AT_name("noise_power")
    4332                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_noise_power")
    4333                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    4334                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4335              $C$DW$365       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$12)
    4337                      .dwattr $C$DW$365, DW_AT_name("noise_power_sqr")
    4338                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_noise_power_sqr")
    4339                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    4340                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4341              $C$DW$366       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$8)
    4343                      .dwattr $C$DW$366, DW_AT_name("NSNR")
    4344                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_NSNR")
    4345                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    4346                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4347              $C$DW$367       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$46)
    4349                      .dwattr $C$DW$367, DW_AT_name("H0")
    4350                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_H0")
    4351                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    4352                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4353              $C$DW$368       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$46)
    4355                      .dwattr $C$DW$368, DW_AT_name("H1")
    4356                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_H1")
    4357                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    4358                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$369       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$21)
    4361                      .dwattr $C$DW$369, DW_AT_name("lgBeta")
    4362                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_lgBeta")
    4363                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    4364                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$370       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$47)
    4367                      .dwattr $C$DW$370, DW_AT_name("acc_dif2_beta")
    4368                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_acc_dif2_beta")
    4369                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    4370                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4371              $C$DW$371       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$8)
    4373                      .dwattr $C$DW$371, DW_AT_name("bCalced")
    4374                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_bCalced")
    4375                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    4376                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4377              $C$DW$372       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$21)
    4379                      .dwattr $C$DW$372, DW_AT_name("sCH")
    4380                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_sCH")
    4381                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    4382                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4383              $C$DW$373       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$47)
    4385                      .dwattr $C$DW$373, DW_AT_name("lAccum")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   93

    4386                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_lAccum")
    4387                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    4388                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4389              $C$DW$374       .dwtag  DW_TAG_member
    4390                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$8)
    4391                      .dwattr $C$DW$374, DW_AT_name("adp_th")
    4392                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_adp_th")
    4393                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    4394                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4395                      .dwendtag $C$DW$T$48
    4396              
    4397              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    4398                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$48)
    4399                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    4400              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    4401                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    4402                      .dwattr $C$DW$T$89, DW_AT_address_class(0x17)
    4403              
    4404              $C$DW$T$91      .dwtag  DW_TAG_enumeration_type
    4405                      .dwattr $C$DW$T$91, DW_AT_name("ObsType")
    4406                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
    4407              $C$DW$375       .dwtag  DW_TAG_enumerator, DW_AT_name("VITERBI"), DW_AT_const_value(0x00)
    4408              $C$DW$376       .dwtag  DW_TAG_enumerator, DW_AT_name("FULL"), DW_AT_const_value(0x01)
    4409              $C$DW$377       .dwtag  DW_TAG_enumerator, DW_AT_name("COMPONENT"), DW_AT_const_value(0x02)
    4410                      .dwendtag $C$DW$T$91
    4411              
    4412              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("ObsType")
    4413                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    4414                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    4415              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4416                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4417                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4418                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4419              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4420                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4421                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4422                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4423              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4424                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4425                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4426                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4427              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4428                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4429                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4430                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4431              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4432                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4433                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4434                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4435              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4436                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$8)
    4437                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    4438              
    4439              $C$DW$T$39      .dwtag  DW_TAG_array_type
    4440                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   94

    4441                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4442                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    4443              $C$DW$378       .dwtag  DW_TAG_subrange_type
    4444                      .dwattr $C$DW$378, DW_AT_upper_bound(0x1d)
    4445                      .dwendtag $C$DW$T$39
    4446              
    4447              
    4448              $C$DW$T$45      .dwtag  DW_TAG_array_type
    4449                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$8)
    4450                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4451                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x514)
    4452              $C$DW$379       .dwtag  DW_TAG_subrange_type
    4453                      .dwattr $C$DW$379, DW_AT_upper_bound(0x513)
    4454                      .dwendtag $C$DW$T$45
    4455              
    4456              
    4457              $C$DW$T$50      .dwtag  DW_TAG_array_type
    4458                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$8)
    4459                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4460                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x100)
    4461              $C$DW$380       .dwtag  DW_TAG_subrange_type
    4462                      .dwattr $C$DW$380, DW_AT_upper_bound(0xff)
    4463                      .dwendtag $C$DW$T$50
    4464              
    4465              
    4466              $C$DW$T$51      .dwtag  DW_TAG_array_type
    4467                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    4468                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4469                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    4470              $C$DW$381       .dwtag  DW_TAG_subrange_type
    4471                      .dwattr $C$DW$381, DW_AT_upper_bound(0x0f)
    4472                      .dwendtag $C$DW$T$51
    4473              
    4474              
    4475              $C$DW$T$52      .dwtag  DW_TAG_array_type
    4476                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    4477                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4478                      .dwattr $C$DW$T$52, DW_AT_byte_size(0xe0)
    4479              $C$DW$382       .dwtag  DW_TAG_subrange_type
    4480                      .dwattr $C$DW$382, DW_AT_upper_bound(0x0d)
    4481              $C$DW$383       .dwtag  DW_TAG_subrange_type
    4482                      .dwattr $C$DW$383, DW_AT_upper_bound(0x0f)
    4483                      .dwendtag $C$DW$T$52
    4484              
    4485              $C$DW$384       .dwtag  DW_TAG_TI_far_type
    4486                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$8)
    4487              $C$DW$T$53      .dwtag  DW_TAG_const_type
    4488                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$384)
    4489              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    4490                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    4491                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    4492              
    4493              $C$DW$T$55      .dwtag  DW_TAG_array_type
    4494                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4495                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   95

    4496                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x20)
    4497              $C$DW$385       .dwtag  DW_TAG_subrange_type
    4498                      .dwattr $C$DW$385, DW_AT_upper_bound(0x0f)
    4499                      .dwendtag $C$DW$T$55
    4500              
    4501              
    4502              $C$DW$T$93      .dwtag  DW_TAG_array_type
    4503                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$53)
    4504                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    4505                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x07)
    4506              $C$DW$386       .dwtag  DW_TAG_subrange_type
    4507                      .dwattr $C$DW$386, DW_AT_upper_bound(0x06)
    4508                      .dwendtag $C$DW$T$93
    4509              
    4510              
    4511              $C$DW$T$94      .dwtag  DW_TAG_array_type
    4512                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$53)
    4513                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    4514                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x09)
    4515              $C$DW$387       .dwtag  DW_TAG_subrange_type
    4516                      .dwattr $C$DW$387, DW_AT_upper_bound(0x08)
    4517                      .dwendtag $C$DW$T$94
    4518              
    4519              
    4520              $C$DW$T$95      .dwtag  DW_TAG_array_type
    4521                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$53)
    4522                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    4523                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x05)
    4524              $C$DW$388       .dwtag  DW_TAG_subrange_type
    4525                      .dwattr $C$DW$388, DW_AT_upper_bound(0x04)
    4526                      .dwendtag $C$DW$T$95
    4527              
    4528              
    4529              $C$DW$T$59      .dwtag  DW_TAG_array_type
    4530                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$8)
    4531                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4532                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x80)
    4533              $C$DW$389       .dwtag  DW_TAG_subrange_type
    4534                      .dwattr $C$DW$389, DW_AT_upper_bound(0x7f)
    4535                      .dwendtag $C$DW$T$59
    4536              
    4537              
    4538              $C$DW$T$60      .dwtag  DW_TAG_array_type
    4539                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    4540                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4541                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x1a)
    4542              $C$DW$390       .dwtag  DW_TAG_subrange_type
    4543                      .dwattr $C$DW$390, DW_AT_upper_bound(0x19)
    4544                      .dwendtag $C$DW$T$60
    4545              
    4546              
    4547              $C$DW$T$78      .dwtag  DW_TAG_array_type
    4548                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$8)
    4549                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    4550                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x20)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   96

    4551              $C$DW$391       .dwtag  DW_TAG_subrange_type
    4552                      .dwattr $C$DW$391, DW_AT_upper_bound(0x1f)
    4553                      .dwendtag $C$DW$T$78
    4554              
    4555              
    4556              $C$DW$T$84      .dwtag  DW_TAG_array_type
    4557                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$8)
    4558                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4559                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x14)
    4560              $C$DW$392       .dwtag  DW_TAG_subrange_type
    4561                      .dwattr $C$DW$392, DW_AT_upper_bound(0x13)
    4562                      .dwendtag $C$DW$T$84
    4563              
    4564              
    4565              $C$DW$T$109     .dwtag  DW_TAG_array_type
    4566                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$8)
    4567                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    4568                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x05)
    4569              $C$DW$393       .dwtag  DW_TAG_subrange_type
    4570                      .dwattr $C$DW$393, DW_AT_upper_bound(0x04)
    4571                      .dwendtag $C$DW$T$109
    4572              
    4573              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4574                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4575                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4576                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4577              
    4578              $C$DW$T$27      .dwtag  DW_TAG_array_type
    4579                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    4580                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4581                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    4582              $C$DW$394       .dwtag  DW_TAG_subrange_type
    4583                      .dwattr $C$DW$394, DW_AT_upper_bound(0x00)
    4584                      .dwendtag $C$DW$T$27
    4585              
    4586              
    4587              $C$DW$T$33      .dwtag  DW_TAG_array_type
    4588                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    4589                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4590                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    4591              $C$DW$395       .dwtag  DW_TAG_subrange_type
    4592                      .dwattr $C$DW$395, DW_AT_upper_bound(0x01)
    4593                      .dwendtag $C$DW$T$33
    4594              
    4595              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    4596                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    4597                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    4598              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    4599                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    4600                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4601              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    4602                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    4603                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    4604              
    4605              $C$DW$T$37      .dwtag  DW_TAG_array_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   97

    4606                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
    4607                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4608                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    4609              $C$DW$396       .dwtag  DW_TAG_subrange_type
    4610                      .dwattr $C$DW$396, DW_AT_upper_bound(0x13)
    4611                      .dwendtag $C$DW$T$37
    4612              
    4613              
    4614              $C$DW$T$85      .dwtag  DW_TAG_array_type
    4615                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
    4616                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4617                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    4618              $C$DW$397       .dwtag  DW_TAG_subrange_type
    4619                      .dwattr $C$DW$397, DW_AT_upper_bound(0x01)
    4620                      .dwendtag $C$DW$T$85
    4621              
    4622              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4623                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4624                      .dwattr $C$DW$T$10, DW_AT_name("int")
    4625                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    4626              $C$DW$T$11      .dwtag  DW_TAG_base_type
    4627                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4628                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4629                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    4630              $C$DW$T$12      .dwtag  DW_TAG_base_type
    4631                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4632                      .dwattr $C$DW$T$12, DW_AT_name("long")
    4633                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    4634              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    4635                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
    4636                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    4637              
    4638              $C$DW$T$61      .dwtag  DW_TAG_array_type
    4639                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$12)
    4640                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4641                      .dwattr $C$DW$T$61, DW_AT_byte_size(0xd0)
    4642              $C$DW$398       .dwtag  DW_TAG_subrange_type
    4643                      .dwattr $C$DW$398, DW_AT_upper_bound(0x67)
    4644                      .dwendtag $C$DW$T$61
    4645              
    4646              
    4647              $C$DW$T$64      .dwtag  DW_TAG_array_type
    4648                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
    4649                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4650                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x20)
    4651              $C$DW$399       .dwtag  DW_TAG_subrange_type
    4652                      .dwattr $C$DW$399, DW_AT_upper_bound(0x0f)
    4653                      .dwendtag $C$DW$T$64
    4654              
    4655              $C$DW$T$13      .dwtag  DW_TAG_base_type
    4656                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4657                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4658                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    4659              $C$DW$T$14      .dwtag  DW_TAG_base_type
    4660                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   98

    4661                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    4662                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    4663                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    4664                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    4665              $C$DW$T$15      .dwtag  DW_TAG_base_type
    4666                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4667                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4668                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    4669                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    4670                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    4671              $C$DW$T$16      .dwtag  DW_TAG_base_type
    4672                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4673                      .dwattr $C$DW$T$16, DW_AT_name("float")
    4674                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    4675              $C$DW$T$17      .dwtag  DW_TAG_base_type
    4676                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4677                      .dwattr $C$DW$T$17, DW_AT_name("double")
    4678                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    4679              $C$DW$T$18      .dwtag  DW_TAG_base_type
    4680                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4681                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    4682                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    4683              $C$DW$T$73      .dwtag  DW_TAG_base_type
    4684                      .dwattr $C$DW$T$73, DW_AT_encoding(DW_ATE_signed_char)
    4685                      .dwattr $C$DW$T$73, DW_AT_name("signed char")
    4686                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    4687              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    4688                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    4689                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    4690              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    4691                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$74)
    4692                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    4693              
    4694              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4695                      .dwattr $C$DW$T$49, DW_AT_name("ele")
    4696                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x03)
    4697              $C$DW$400       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$9)
    4699                      .dwattr $C$DW$400, DW_AT_name("sym")
    4700                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_sym")
    4701                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4702                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4703              $C$DW$401       .dwtag  DW_TAG_member
    4704                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$9)
    4705                      .dwattr $C$DW$401, DW_AT_name("idx_flag")
    4706                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_idx_flag")
    4707                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4708                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4709              $C$DW$402       .dwtag  DW_TAG_member
    4710                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$9)
    4711                      .dwattr $C$DW$402, DW_AT_name("next")
    4712                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_next")
    4713                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4714                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4715                      .dwendtag $C$DW$T$49
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE   99

    4716              
    4717              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    4718                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$49)
    4719                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4720              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    4721                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    4722                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    4723              
    4724              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    4725                      .dwattr $C$DW$T$90, DW_AT_name("gmhmm_type")
    4726                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x7fe)
    4727              $C$DW$403       .dwtag  DW_TAG_member
    4728                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    4729                      .dwattr $C$DW$403, DW_AT_name("avedepth")
    4730                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_avedepth")
    4731                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4732                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4733              $C$DW$404       .dwtag  DW_TAG_member
    4734                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    4735                      .dwattr $C$DW$404, DW_AT_name("bestdepth")
    4736                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_bestdepth")
    4737                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4738                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4739              $C$DW$405       .dwtag  DW_TAG_member
    4740                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    4741                      .dwattr $C$DW$405, DW_AT_name("index_mean")
    4742                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_index_mean")
    4743                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4744                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4745              $C$DW$406       .dwtag  DW_TAG_member
    4746                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    4747                      .dwattr $C$DW$406, DW_AT_name("signal_cnt")
    4748                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_signal_cnt")
    4749                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4750                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4751              $C$DW$407       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$8)
    4753                      .dwattr $C$DW$407, DW_AT_name("buf_idx")
    4754                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_buf_idx")
    4755                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4756                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4757              $C$DW$408       .dwtag  DW_TAG_member
    4758                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    4759                      .dwattr $C$DW$408, DW_AT_name("speech_detected")
    4760                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_speech_detected")
    4761                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4762                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4763              $C$DW$409       .dwtag  DW_TAG_member
    4764                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    4765                      .dwattr $C$DW$409, DW_AT_name("mfcc_cnt")
    4766                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_mfcc_cnt")
    4767                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4768                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4769              $C$DW$410       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE  100

    4771                      .dwattr $C$DW$410, DW_AT_name("nbr_cpy")
    4772                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_nbr_cpy")
    4773                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4774                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4775              $C$DW$411       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$8)
    4777                      .dwattr $C$DW$411, DW_AT_name("last_sig")
    4778                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_last_sig")
    4779                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4780                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4781              $C$DW$412       .dwtag  DW_TAG_member
    4782                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$50)
    4783                      .dwattr $C$DW$412, DW_AT_name("sample_signal")
    4784                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_sample_signal")
    4785                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4786                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4787              $C$DW$413       .dwtag  DW_TAG_member
    4788                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$8)
    4789                      .dwattr $C$DW$413, DW_AT_name("amplitude_max")
    4790                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_amplitude_max")
    4791                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    4792                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4793              $C$DW$414       .dwtag  DW_TAG_member
    4794                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$8)
    4795                      .dwattr $C$DW$414, DW_AT_name("amplitude_min")
    4796                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_amplitude_min")
    4797                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    4798                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4799              $C$DW$415       .dwtag  DW_TAG_member
    4800                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$8)
    4801                      .dwattr $C$DW$415, DW_AT_name("pred_first_frame")
    4802                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_pred_first_frame")
    4803                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    4804                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4805              $C$DW$416       .dwtag  DW_TAG_member
    4806                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$8)
    4807                      .dwattr $C$DW$416, DW_AT_name("frm_cnt")
    4808                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_frm_cnt")
    4809                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    4810                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4811              $C$DW$417       .dwtag  DW_TAG_member
    4812                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$8)
    4813                      .dwattr $C$DW$417, DW_AT_name("beam_count")
    4814                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_beam_count")
    4815                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    4816                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4817              $C$DW$418       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$8)
    4819                      .dwattr $C$DW$418, DW_AT_name("active_beam_cells")
    4820                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_active_beam_cells")
    4821                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    4822                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4823              $C$DW$419       .dwtag  DW_TAG_member
    4824                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$8)
    4825                      .dwattr $C$DW$419, DW_AT_name("active_time_cells")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:14 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0730410                         PAGE  101

    4826                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_active_time_cells")
    4827                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    4828                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4829              $C$DW$420       .dwtag  DW_TAG_member
    4830                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$9)
    4831                      .dwattr $C$DW$420, DW_AT_name("ending_sym_count")
    4832                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_ending_sym_count")
    4833                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    4834                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4835              $C$DW$421       .dwtag  DW_TAG_member
    4836                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$8)
    4837                      .dwattr $C$DW$421, DW_AT_name("comp_type")
    4838                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_comp_type")
    4839                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    4840                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4841              $C$DW$422       .dwtag  DW_TAG_member
    4842                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$9)
    4843                      .dwattr $C$DW$422, DW_AT_name("low_vol_limit")
    4844                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_low_vol_limit")
    4845                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    4846                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4847              $C$DW$423       .dwtag  DW_TAG_member
    4848                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$9)
    4849                      .dwattr $C$DW$423, DW_AT_name("high_vol_limit")
    4850                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_high_vol_limit")
    4851                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
    4852                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4853              $C$DW$424       .dwtag  DW_TAG_member
    4854                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$8)
    4855                      .dwattr $C$DW$424, DW_AT_name("vol")
    4856                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_vol")
    4857                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    4858                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4859              $C$DW$425       .dwtag  DW_TAG_member
    4860                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    4861                      .dwattr $C$DW$425, DW_AT_name("n_mfcc")
    4862                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_n_mfcc")
    4863                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    4864                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4865              $C$DW$426       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$8)
    4867                      .dwattr $C$DW$426, DW_AT_name("nbr_dim")
    4868                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_nbr_dim")
    4869                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    4870                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4871              $C$DW$427       .dwtag  DW_TAG_member
    4872                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    4873                      .dwattr $C$DW$427, DW_AT_name("n_filter")
    4874                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_n_filter")
    4875                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    4876                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4877              $C$DW$428       .dwtag  DW_TAG_member
    4878                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$52)
