TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE    1

    4242              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:15 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1237                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    1238              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSuccess"), DW_AT_const_value(0x00)
    1239              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACMemoryFail"), DW_AT_const_value(0x01)
    1240              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACLoadFail"), DW_AT_const_value(0x02)
    1241              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACReset"), DW_AT_const_value(0x03)
    1242              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSaveFail"), DW_AT_const_value(0x04)
    1243              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSBCInitFail"), DW_AT_const_value(0x05)
    1244              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSBCLoadFail"), DW_AT_const_value(0x06)
    1245              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSVAFail"), DW_AT_const_value(0x07)
    1246              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACFail"), DW_AT_const_value(0x08)
    1247              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACNoAlignment"), DW_AT_const_value(0x09)
    1248              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACRJLoadFail"), DW_AT_const_value(0x0a)
    1249                      .dwendtag $C$DW$T$67
    1250              
    1251              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineJACStatusType")
    1252                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1253                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1254              
    1255              $C$DW$T$71      .dwtag  DW_TAG_subroutine_type
    1256                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$68)
    1257                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1258              $C$DW$280       .dwtag  DW_TAG_formal_parameter
    1259                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$70)
    1260              $C$DW$281       .dwtag  DW_TAG_formal_parameter
    1261                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$54)
    1262              $C$DW$282       .dwtag  DW_TAG_formal_parameter
    1263                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$70)
    1264              $C$DW$283       .dwtag  DW_TAG_formal_parameter
    1265                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$70)
    1266                      .dwendtag $C$DW$T$71
    1267              
    1268              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    1269                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    1270                      .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    1271              
    1272              $C$DW$T$73      .dwtag  DW_TAG_subroutine_type
    1273                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$68)
    1274                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1275              $C$DW$284       .dwtag  DW_TAG_formal_parameter
    1276                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$70)
    1277              $C$DW$285       .dwtag  DW_TAG_formal_parameter
    1278                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$54)
    1279                      .dwendtag $C$DW$T$73
    1280              
    1281              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    1282                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1283                      .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    1284              
    1285              $C$DW$T$75      .dwtag  DW_TAG_subroutine_type
    1286                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$68)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   29

    1287                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1288              $C$DW$286       .dwtag  DW_TAG_formal_parameter
    1289                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$54)
    1290              $C$DW$287       .dwtag  DW_TAG_formal_parameter
    1291                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$70)
    1292              $C$DW$288       .dwtag  DW_TAG_formal_parameter
    1293                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$70)
    1294                      .dwendtag $C$DW$T$75
    1295              
    1296              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    1297                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    1298                      .dwattr $C$DW$T$76, DW_AT_address_class(0x20)
    1299              
    1300              $C$DW$T$77      .dwtag  DW_TAG_subroutine_type
    1301                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$68)
    1302                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1303              $C$DW$289       .dwtag  DW_TAG_formal_parameter
    1304                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$54)
    1305                      .dwendtag $C$DW$T$77
    1306              
    1307              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    1308                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    1309                      .dwattr $C$DW$T$78, DW_AT_address_class(0x20)
    1310              
    1311              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1312                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
    1313              $C$DW$290       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$8)
    1315                      .dwattr $C$DW$290, DW_AT_name("num")
    1316                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_num")
    1317                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    1319              $C$DW$291       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$8)
    1321                      .dwattr $C$DW$291, DW_AT_name("x1")
    1322                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_x1")
    1323                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1324                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    1325              $C$DW$292       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$8)
    1327                      .dwattr $C$DW$292, DW_AT_name("x2")
    1328                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_x2")
    1329                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1330                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    1331                      .dwendtag $C$DW$T$19
    1332              
    1333              $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    1334                      .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    1336              $C$DW$293       .dwtag  DW_TAG_TI_far_type
    1337                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$142)
    1338              $C$DW$T$143     .dwtag  DW_TAG_const_type
    1339                      .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$293)
    1340              $C$DW$T$144     .dwtag  DW_TAG_pointer_type
    1341                      .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$143)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   30

    1342                      .dwattr $C$DW$T$144, DW_AT_address_class(0x17)
    1343              
    1344              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1345                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    1346              $C$DW$294       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    1348                      .dwattr $C$DW$294, DW_AT_name("max_mem_usage")
    1349                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_max_mem_usage")
    1350                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    1352              $C$DW$295       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    1354                      .dwattr $C$DW$295, DW_AT_name("n_terminals")
    1355                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_n_terminals")
    1356                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1357                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    1358              $C$DW$296       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    1360                      .dwattr $C$DW$296, DW_AT_name("n_monophones")
    1361                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_n_monophones")
    1362                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1363                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$297       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    1366                      .dwattr $C$DW$297, DW_AT_name("hlrTreeBase")
    1367                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_hlrTreeBase")
    1368                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1369                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$298       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$22)
    1372                      .dwattr $C$DW$298, DW_AT_name("hlrTerminal")
    1373                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_hlrTerminal")
    1374                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1375                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$299       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    1378                      .dwattr $C$DW$299, DW_AT_name("pHMM2phone")
    1379                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_pHMM2phone")
    1380                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1381                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    1382              $C$DW$300       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$22)
    1384                      .dwattr $C$DW$300, DW_AT_name("hlrTransformIndex")
    1385                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_hlrTransformIndex")
    1386                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1387                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    1388              $C$DW$301       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    1390                      .dwattr $C$DW$301, DW_AT_name("hlr_TRANSFORM_SIZE")
    1391                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    1392                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1393                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    1394              $C$DW$302       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    1396                      .dwattr $C$DW$302, DW_AT_name("hlrTransforms")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   31

    1397                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_hlrTransforms")
    1398                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1399                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    1400              $C$DW$303       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    1402                      .dwattr $C$DW$303, DW_AT_name("pSegStat_dif1")
    1403                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_pSegStat_dif1")
    1404                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1405                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$304       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$21)
    1408                      .dwattr $C$DW$304, DW_AT_name("pSegStat_dif2")
    1409                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_pSegStat_dif2")
    1410                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1411                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$305       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$21)
    1414                      .dwattr $C$DW$305, DW_AT_name("pEnhanced")
    1415                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_pEnhanced")
    1416                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1417                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$306       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
    1420                      .dwattr $C$DW$306, DW_AT_name("bk_node_cnt")
    1421                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_bk_node_cnt")
    1422                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1423                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    1424                      .dwendtag $C$DW$T$23
    1425              
    1426              $C$DW$T$148     .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    1427                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$23)
    1428                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    1429              $C$DW$T$149     .dwtag  DW_TAG_pointer_type
    1430                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
    1431                      .dwattr $C$DW$T$149, DW_AT_address_class(0x17)
    1432              
    1433              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1434                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    1435              $C$DW$307       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$9)
    1437                      .dwattr $C$DW$307, DW_AT_name("sym_code")
    1438                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_sym_code")
    1439                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    1441              $C$DW$308       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$9)
    1443                      .dwattr $C$DW$308, DW_AT_name("start_cell")
    1444                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_start_cell")
    1445                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1446                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    1447              $C$DW$309       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$9)
    1449                      .dwattr $C$DW$309, DW_AT_name("depth")
    1450                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_depth")
    1451                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   32

    1452                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    1453                      .dwendtag $C$DW$T$24
    1454              
    1455              $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    1456                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$24)
    1457                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    1458              $C$DW$T$152     .dwtag  DW_TAG_pointer_type
    1459                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$151)
    1460                      .dwattr $C$DW$T$152, DW_AT_address_class(0x17)
    1461              
    1462              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1463                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    1464              $C$DW$310       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$8)
    1466                      .dwattr $C$DW$310, DW_AT_name("scr")
    1467                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_scr")
    1468                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1469                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    1470              $C$DW$311       .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$9)
    1472                      .dwattr $C$DW$311, DW_AT_name("sym")
    1473                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_sym")
    1474                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1475                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    1476              $C$DW$312       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$9)
    1478                      .dwattr $C$DW$312, DW_AT_name("frm")
    1479                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_frm")
    1480                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1481                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    1482                      .dwendtag $C$DW$T$25
    1483              
    1484              $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    1485                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$25)
    1486                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    1487              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    1488                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)
    1489                      .dwattr $C$DW$T$154, DW_AT_address_class(0x17)
    1490              
    1491              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1492                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1493              $C$DW$313       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$9)
    1495                      .dwattr $C$DW$313, DW_AT_name("frm")
    1496                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_frm")
    1497                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    1499              $C$DW$314       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$9)
    1501                      .dwattr $C$DW$314, DW_AT_name("beam_idx")
    1502                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_beam_idx")
    1503                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1504                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    1505                      .dwendtag $C$DW$T$26
    1506              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   33

    1507              $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    1508                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$26)
    1509                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    1510              $C$DW$T$158     .dwtag  DW_TAG_pointer_type
    1511                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$157)
    1512                      .dwattr $C$DW$T$158, DW_AT_address_class(0x17)
    1513              
    1514              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1515                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    1516              $C$DW$315       .dwtag  DW_TAG_member
    1517                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$9)
    1518                      .dwattr $C$DW$315, DW_AT_name("n_hmm")
    1519                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_n_hmm")
    1520                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1521                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    1522              $C$DW$316       .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$9)
    1524                      .dwattr $C$DW$316, DW_AT_name("n_sym")
    1525                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_n_sym")
    1526                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1527                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    1528              $C$DW$317       .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$9)
    1530                      .dwattr $C$DW$317, DW_AT_name("n_word")
    1531                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_n_word")
    1532                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1533                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    1534              $C$DW$318       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$9)
    1536                      .dwattr $C$DW$318, DW_AT_name("n_set")
    1537                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_n_set")
    1538                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1539                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    1540              $C$DW$319       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$9)
    1542                      .dwattr $C$DW$319, DW_AT_name("n_hmm_set")
    1543                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_n_hmm_set")
    1544                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1545                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$320       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$9)
    1548                      .dwattr $C$DW$320, DW_AT_name("start")
    1549                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_start")
    1550                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1551                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$321       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$9)
    1554                      .dwattr $C$DW$321, DW_AT_name("stop")
    1555                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_stop")
    1556                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1557                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    1558              $C$DW$322       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$27)
    1560                      .dwattr $C$DW$322, DW_AT_name("symlist")
    1561                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_symlist")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   34

    1562                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1563                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    1564                      .dwendtag $C$DW$T$28
    1565              
    1566              $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    1567                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$28)
    1568                      .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    1569              $C$DW$T$160     .dwtag  DW_TAG_pointer_type
    1570                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$159)
    1571                      .dwattr $C$DW$T$160, DW_AT_address_class(0x17)
    1572              
    1573              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1574                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1575              $C$DW$323       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$9)
    1577                      .dwattr $C$DW$323, DW_AT_name("high_pos")
    1578                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_high_pos")
    1579                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    1581              $C$DW$324       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$9)
    1583                      .dwattr $C$DW$324, DW_AT_name("cur_pos")
    1584                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_cur_pos")
    1585                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1586                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    1587                      .dwendtag $C$DW$T$29
    1588              
    1589              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    1590                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1591                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1592              
    1593              $C$DW$T$31      .dwtag  DW_TAG_array_type
    1594                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1595                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1596                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1597              $C$DW$325       .dwtag  DW_TAG_subrange_type
    1598                      .dwattr $C$DW$325, DW_AT_upper_bound(0x01)
    1599                      .dwendtag $C$DW$T$31
    1600              
    1601              
    1602              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1603                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    1604              $C$DW$326       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$30)
    1606                      .dwattr $C$DW$326, DW_AT_name("state")
    1607                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_state")
    1608                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1609                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    1610              $C$DW$327       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$31)
    1612                      .dwattr $C$DW$327, DW_AT_name("sym")
    1613                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_sym")
    1614                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1615                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    1616              $C$DW$328       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   35

    1617                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$30)
    1618                      .dwattr $C$DW$328, DW_AT_name("beam")
    1619                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_beam")
    1620                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1621                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$329       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$30)
    1624                      .dwattr $C$DW$329, DW_AT_name("time")
    1625                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_time")
    1626                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1627                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    1628                      .dwendtag $C$DW$T$32
    1629              
    1630              $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    1631                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$32)
    1632                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    1633              
    1634              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1635                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
    1636              $C$DW$330       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$33)
    1638                      .dwattr $C$DW$330, DW_AT_name("cur_sym")
    1639                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_cur_sym")
    1640                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    1642              $C$DW$331       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$9)
    1644                      .dwattr $C$DW$331, DW_AT_name("cur_state")
    1645                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_cur_state")
    1646                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1647                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    1648                      .dwendtag $C$DW$T$34
    1649              
    1650              $C$DW$T$164     .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    1651                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$34)
    1652                      .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    1653              
    1654              $C$DW$T$165     .dwtag  DW_TAG_array_type
    1655                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    1656                      .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    1657                      .dwattr $C$DW$T$165, DW_AT_byte_size(0x06)
    1658              $C$DW$332       .dwtag  DW_TAG_subrange_type
    1659                      .dwattr $C$DW$332, DW_AT_upper_bound(0x01)
    1660                      .dwendtag $C$DW$T$165
    1661              
    1662              
    1663              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1664                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    1665              $C$DW$333       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$9)
    1667                      .dwattr $C$DW$333, DW_AT_name("max_nbr_syms")
    1668                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_max_nbr_syms")
    1669                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$334       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   36

    1672                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$8)
    1673                      .dwattr $C$DW$334, DW_AT_name("nbr_syms")
    1674                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_nbr_syms")
    1675                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1676                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    1677              $C$DW$335       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$21)
    1679                      .dwattr $C$DW$335, DW_AT_name("sym2pos")
    1680                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_sym2pos")
    1681                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1682                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$336       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$35)
    1685                      .dwattr $C$DW$336, DW_AT_name("syms")
    1686                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_syms")
    1687                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1688                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    1689                      .dwendtag $C$DW$T$36
    1690              
    1691              $C$DW$T$166     .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    1692                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$36)
    1693                      .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    1694              
    1695              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1696                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    1697              $C$DW$337       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$8)
    1699                      .dwattr $C$DW$337, DW_AT_name("scr")
    1700                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_scr")
    1701                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    1703              $C$DW$338       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$8)
    1705                      .dwattr $C$DW$338, DW_AT_name("n_ans")
    1706                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_n_ans")
    1707                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1708                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    1709              $C$DW$339       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$37)
    1711                      .dwattr $C$DW$339, DW_AT_name("answers")
    1712                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_answers")
    1713                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1714                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    1715                      .dwendtag $C$DW$T$38
    1716              
    1717              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    1718                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
    1719                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1720              
    1721              $C$DW$T$41      .dwtag  DW_TAG_array_type
    1722                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1723                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1724                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
    1725              $C$DW$340       .dwtag  DW_TAG_subrange_type
    1726                      .dwattr $C$DW$340, DW_AT_upper_bound(0x1d)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   37

    1727                      .dwendtag $C$DW$T$41
    1728              
    1729              
    1730              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1731                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
    1732              $C$DW$341       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$8)
    1734                      .dwattr $C$DW$341, DW_AT_name("n_bests")
    1735                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_n_bests")
    1736                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    1738              $C$DW$342       .dwtag  DW_TAG_member
    1739                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$39)
    1740                      .dwattr $C$DW$342, DW_AT_name("best_idx")
    1741                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_best_idx")
    1742                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1743                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    1744              $C$DW$343       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$41)
    1746                      .dwattr $C$DW$343, DW_AT_name("elem")
    1747                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_elem")
    1748                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1749                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    1750                      .dwendtag $C$DW$T$42
    1751              
    1752              $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    1753                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$42)
    1754                      .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    1755              
    1756              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1757                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
    1758              $C$DW$344       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    1760                      .dwattr $C$DW$344, DW_AT_name("alpha_p")
    1761                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_alpha_p")
    1762                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1763                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    1764              $C$DW$345       .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    1766                      .dwattr $C$DW$345, DW_AT_name("sAlpha")
    1767                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_sAlpha")
    1768                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1769                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    1770              $C$DW$346       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$8)
    1772                      .dwattr $C$DW$346, DW_AT_name("sBeta")
    1773                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_sBeta")
    1774                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1775                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    1776              $C$DW$347       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$8)
    1778                      .dwattr $C$DW$347, DW_AT_name("lambdaLTEhigherE")
    1779                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    1780                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1781                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   38

    1782              $C$DW$348       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$8)
    1784                      .dwattr $C$DW$348, DW_AT_name("frm_count")
    1785                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_frm_count")
    1786                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1787                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    1788              $C$DW$349       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    1790                      .dwattr $C$DW$349, DW_AT_name("prob_sp")
    1791                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_prob_sp")
    1792                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1793                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    1794              $C$DW$350       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$21)
    1796                      .dwattr $C$DW$350, DW_AT_name("s_noise_floor")
    1797                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_s_noise_floor")
    1798                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1799                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    1800              $C$DW$351       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$21)
    1802                      .dwattr $C$DW$351, DW_AT_name("snr")
    1803                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_snr")
    1804                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1805                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    1806              $C$DW$352       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$21)
    1808                      .dwattr $C$DW$352, DW_AT_name("ps_long_term_noise")
    1809                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_ps_long_term_noise")
    1810                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1811                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    1812              $C$DW$353       .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$8)
    1814                      .dwattr $C$DW$353, DW_AT_name("frmEn")
    1815                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_frmEn")
    1816                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1817                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    1818              $C$DW$354       .dwtag  DW_TAG_member
    1819                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$8)
    1820                      .dwattr $C$DW$354, DW_AT_name("meanEn")
    1821                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_meanEn")
    1822                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1823                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    1824              $C$DW$355       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$8)
    1826                      .dwattr $C$DW$355, DW_AT_name("prevMeanEn")
    1827                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_prevMeanEn")
    1828                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1829                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    1830              $C$DW$356       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$8)
    1832                      .dwattr $C$DW$356, DW_AT_name("noiselvl")
    1833                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_noiselvl")
    1834                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1835                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    1836              $C$DW$357       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   39

    1837                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$8)
    1838                      .dwattr $C$DW$357, DW_AT_name("lambdaLTE")
    1839                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_lambdaLTE")
    1840                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1841                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    1842              $C$DW$358       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$8)
    1844                      .dwattr $C$DW$358, DW_AT_name("nbSpeechFrame")
    1845                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_nbSpeechFrame")
    1846                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1847                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    1848              $C$DW$359       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$8)
    1850                      .dwattr $C$DW$359, DW_AT_name("hangOver")
    1851                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_hangOver")
    1852                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1853                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    1854                      .dwendtag $C$DW$T$43
    1855              
    1856              $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    1857                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$43)
    1858                      .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    1859              $C$DW$T$171     .dwtag  DW_TAG_pointer_type
    1860                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
    1861                      .dwattr $C$DW$T$171, DW_AT_address_class(0x17)
    1862              
    1863              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1864                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
    1865              $C$DW$360       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$8)
    1867                      .dwattr $C$DW$360, DW_AT_name("mean")
    1868                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_mean")
    1869                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1870                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    1871              $C$DW$361       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$8)
    1873                      .dwattr $C$DW$361, DW_AT_name("inv")
    1874                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_inv")
    1875                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1876                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    1877              $C$DW$362       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$8)
    1879                      .dwattr $C$DW$362, DW_AT_name("gconst")
    1880                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_gconst")
    1881                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1882                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    1883                      .dwendtag $C$DW$T$44
    1884              
    1885              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    1886                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    1887                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1888              
    1889              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1890                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
    1891              $C$DW$363       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   40

    1892                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$45)
    1893                      .dwattr $C$DW$363, DW_AT_name("base_mem")
    1894                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_base_mem")
    1895                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    1897              $C$DW$364       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    1899                      .dwattr $C$DW$364, DW_AT_name("mem_count")
    1900                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_mem_count")
    1901                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    1902                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$365       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$22)
    1905                      .dwattr $C$DW$365, DW_AT_name("answers")
    1906                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_answers")
    1907                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    1908                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$366       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$22)
    1911                      .dwattr $C$DW$366, DW_AT_name("uStp")
    1912                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_uStp")
    1913                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    1914                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$367       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    1917                      .dwattr $C$DW$367, DW_AT_name("nWords")
    1918                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_nWords")
    1919                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    1920                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$368       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$8)
    1923                      .dwattr $C$DW$368, DW_AT_name("nS")
    1924                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_nS")
    1925                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    1926                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$369       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$21)
    1929                      .dwattr $C$DW$369, DW_AT_name("cm_scr")
    1930                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_cm_scr")
    1931                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    1932                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$370       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$8)
    1935                      .dwattr $C$DW$370, DW_AT_name("bNeedUpdate")
    1936                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_bNeedUpdate")
    1937                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    1938                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$371       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$21)
    1941                      .dwattr $C$DW$371, DW_AT_name("cm_anti_scr")
    1942                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_cm_anti_scr")
    1943                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    1944                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$372       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$12)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   41

    1947                      .dwattr $C$DW$372, DW_AT_name("cm_fg_scr")
    1948                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_cm_fg_scr")
    1949                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    1950                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$373       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$12)
    1953                      .dwattr $C$DW$373, DW_AT_name("cm_bk_scr")
    1954                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_cm_bk_scr")
    1955                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    1956                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$374       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$8)
    1959                      .dwattr $C$DW$374, DW_AT_name("th_nbest")
    1960                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_th_nbest")
    1961                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    1962                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$375       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$8)
    1965                      .dwattr $C$DW$375, DW_AT_name("nSpeech")
    1966                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_nSpeech")
    1967                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    1968                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$376       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$8)
    1971                      .dwattr $C$DW$376, DW_AT_name("nNoise")
    1972                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_nNoise")
    1973                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    1974                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    1975              $C$DW$377       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$12)
    1977                      .dwattr $C$DW$377, DW_AT_name("speech_power")
    1978                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_speech_power")
    1979                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    1980                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$378       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$12)
    1983                      .dwattr $C$DW$378, DW_AT_name("noise_power")
    1984                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_noise_power")
    1985                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    1986                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    1987              $C$DW$379       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$12)
    1989                      .dwattr $C$DW$379, DW_AT_name("noise_power_sqr")
    1990                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_noise_power_sqr")
    1991                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    1992                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    1993              $C$DW$380       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$8)
    1995                      .dwattr $C$DW$380, DW_AT_name("NSNR")
    1996                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_NSNR")
    1997                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    1998                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$381       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$46)
    2001                      .dwattr $C$DW$381, DW_AT_name("H0")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   42

    2002                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_H0")
    2003                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    2004                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2005              $C$DW$382       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$46)
    2007                      .dwattr $C$DW$382, DW_AT_name("H1")
    2008                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_H1")
    2009                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    2010                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$383       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
    2013                      .dwattr $C$DW$383, DW_AT_name("lgBeta")
    2014                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_lgBeta")
    2015                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    2016                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$384       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$47)
    2019                      .dwattr $C$DW$384, DW_AT_name("acc_dif2_beta")
    2020                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_acc_dif2_beta")
    2021                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    2022                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$385       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$8)
    2025                      .dwattr $C$DW$385, DW_AT_name("bCalced")
    2026                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_bCalced")
    2027                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    2028                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2029              $C$DW$386       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
    2031                      .dwattr $C$DW$386, DW_AT_name("sCH")
    2032                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_sCH")
    2033                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    2034                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2035              $C$DW$387       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$47)
    2037                      .dwattr $C$DW$387, DW_AT_name("lAccum")
    2038                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_lAccum")
    2039                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    2040                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2041              $C$DW$388       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$8)
    2043                      .dwattr $C$DW$388, DW_AT_name("adp_th")
    2044                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_adp_th")
    2045                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    2046                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2047                      .dwendtag $C$DW$T$48
    2048              
    2049              $C$DW$T$172     .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    2050                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$48)
    2051                      .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    2052              $C$DW$T$173     .dwtag  DW_TAG_pointer_type
    2053                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    2054                      .dwattr $C$DW$T$173, DW_AT_address_class(0x17)
    2055              
    2056              $C$DW$T$134     .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   43

    2057                      .dwattr $C$DW$T$134, DW_AT_name("TIesrEngineSIRECO")
    2058                      .dwattr $C$DW$T$134, DW_AT_byte_size(0x66)
    2059              $C$DW$389       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$56)
    2061                      .dwattr $C$DW$389, DW_AT_name("OpenASR")
    2062                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_OpenASR")
    2063                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2064                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2065              $C$DW$390       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$58)
    2067                      .dwattr $C$DW$390, DW_AT_name("CloseASR")
    2068                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_CloseASR")
    2069                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2070                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2071              $C$DW$391       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$60)
    2073                      .dwattr $C$DW$391, DW_AT_name("OpenSearchEngine")
    2074                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_OpenSearchEngine")
    2075                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2076                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2077              $C$DW$392       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$62)
    2079                      .dwattr $C$DW$392, DW_AT_name("CallSearchEngine")
    2080                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_CallSearchEngine")
    2081                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2082                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2083              $C$DW$393       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$64)
    2085                      .dwattr $C$DW$393, DW_AT_name("CloseSearchEngine")
    2086                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_CloseSearchEngine")
    2087                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2088                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2089              $C$DW$394       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$66)
    2091                      .dwattr $C$DW$394, DW_AT_name("SpeechDetected")
    2092                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_SpeechDetected")
    2093                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2094                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2095              $C$DW$395       .dwtag  DW_TAG_member
    2096                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$66)
    2097                      .dwattr $C$DW$395, DW_AT_name("SpeechEnded")
    2098                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_SpeechEnded")
    2099                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2100                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2101              $C$DW$396       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$66)
    2103                      .dwattr $C$DW$396, DW_AT_name("SADState")
    2104                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_SADState")
    2105                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2106                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2107              $C$DW$397       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$72)
    2109                      .dwattr $C$DW$397, DW_AT_name("JAC_load")
    2110                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_JAC_load")
    2111                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   44

    2112                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2113              $C$DW$398       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$74)
    2115                      .dwattr $C$DW$398, DW_AT_name("JAC_save")
    2116                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_JAC_save")
    2117                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2118                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2119              $C$DW$399       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$76)
    2121                      .dwattr $C$DW$399, DW_AT_name("JAC_clear")
    2122                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_JAC_clear")
    2123                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2124                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2125              $C$DW$400       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$78)
    2127                      .dwattr $C$DW$400, DW_AT_name("JAC_update")
    2128                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_JAC_update")
    2129                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2130                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2131              $C$DW$401       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$83)
    2133                      .dwattr $C$DW$401, DW_AT_name("GetFrameCount")
    2134                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_GetFrameCount")
    2135                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2136                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    2137              $C$DW$402       .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$85)
    2139                      .dwattr $C$DW$402, DW_AT_name("GetTotalScore")
    2140                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_GetTotalScore")
    2141                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2142                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    2143              $C$DW$403       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$87)
    2145                      .dwattr $C$DW$403, DW_AT_name("GetCycleCount")
    2146                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_GetCycleCount")
    2147                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2148                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    2149              $C$DW$404       .dwtag  DW_TAG_member
    2150                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$91)
    2151                      .dwattr $C$DW$404, DW_AT_name("GetAnswerIndex")
    2152                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_GetAnswerIndex")
    2153                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2154                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    2155              $C$DW$405       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$93)
    2157                      .dwattr $C$DW$405, DW_AT_name("GetAnswerWord")
    2158                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_GetAnswerWord")
    2159                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2160                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    2161              $C$DW$406       .dwtag  DW_TAG_member
    2162                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$95)
    2163                      .dwattr $C$DW$406, DW_AT_name("GetAnswerCount")
    2164                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_GetAnswerCount")
    2165                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2166                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   45

    2167              $C$DW$407       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$97)
    2169                      .dwattr $C$DW$407, DW_AT_name("SetTIesrNBest")
    2170                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_SetTIesrNBest")
    2171                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2172                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    2173              $C$DW$408       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$99)
    2175                      .dwattr $C$DW$408, DW_AT_name("GetTIesrNBest")
    2176                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_GetTIesrNBest")
    2177                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2178                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    2179              $C$DW$409       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$87)
    2181                      .dwattr $C$DW$409, DW_AT_name("GetNumNbests")
    2182                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_GetNumNbests")
    2183                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2184                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    2185              $C$DW$410       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$83)
    2187                      .dwattr $C$DW$410, DW_AT_name("GetConfidenceScore")
    2188                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_GetConfidenceScore")
    2189                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2190                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    2191              $C$DW$411       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$101)
    2193                      .dwattr $C$DW$411, DW_AT_name("SetTIesrConfidenceAdaptation")
    2194                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_SetTIesrConfidenceAdaptation")
    2195                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2196                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    2197              $C$DW$412       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$103)
    2199                      .dwattr $C$DW$412, DW_AT_name("GetTIesrConfidenceAdaptation")
    2200                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_GetTIesrConfidenceAdaptation")
    2201                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2202                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    2203              $C$DW$413       .dwtag  DW_TAG_member
    2204                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$105)
    2205                      .dwattr $C$DW$413, DW_AT_name("SetTIesrGaussSelection")
    2206                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_SetTIesrGaussSelection")
    2207                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2208                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    2209              $C$DW$414       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$107)
    2211                      .dwattr $C$DW$414, DW_AT_name("GetTIesrGaussSelection")
    2212                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_GetTIesrGaussSelection")
    2213                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2214                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    2215              $C$DW$415       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$109)
    2217                      .dwattr $C$DW$415, DW_AT_name("SetTIesrOnlineReferenceModel")
    2218                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_SetTIesrOnlineReferenceModel")
    2219                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2220                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2221              $C$DW$416       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   46

    2222                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$111)
    2223                      .dwattr $C$DW$416, DW_AT_name("GetTIesrOnlineReferenceModel")
    2224                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GetTIesrOnlineReferenceModel")
    2225                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2226                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2227              $C$DW$417       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$113)
    2229                      .dwattr $C$DW$417, DW_AT_name("SetTIesrNoiseSubtraction")
    2230                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_SetTIesrNoiseSubtraction")
    2231                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2232                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2233              $C$DW$418       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$115)
    2235                      .dwattr $C$DW$418, DW_AT_name("GetTIesrNoiseSubtraction")
    2236                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GetTIesrNoiseSubtraction")
    2237                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2238                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2239              $C$DW$419       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$117)
    2241                      .dwattr $C$DW$419, DW_AT_name("getRealTimeGuardTh")
    2242                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_getRealTimeGuardTh")
    2243                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2244                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    2245              $C$DW$420       .dwtag  DW_TAG_member
    2246                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$117)
    2247                      .dwattr $C$DW$420, DW_AT_name("getGetRealTGuard")
    2248                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_getGetRealTGuard")
    2249                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2250                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    2251              $C$DW$421       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$119)
    2253                      .dwattr $C$DW$421, DW_AT_name("setRealTimeGuardTh")
    2254                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_setRealTimeGuardTh")
    2255                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2256                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    2257              $C$DW$422       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$119)
    2259                      .dwattr $C$DW$422, DW_AT_name("setGetRealTGuard")
    2260                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_setGetRealTGuard")
    2261                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2262                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    2263              $C$DW$423       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$83)
    2265                      .dwattr $C$DW$423, DW_AT_name("GetVolumeStatus")
    2266                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_GetVolumeStatus")
    2267                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2268                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    2269              $C$DW$424       .dwtag  DW_TAG_member
    2270                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$121)
    2271                      .dwattr $C$DW$424, DW_AT_name("GetSearchMemorySize")
    2272                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_GetSearchMemorySize")
    2273                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2274                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    2275              $C$DW$425       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$121)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   47

    2277                      .dwattr $C$DW$425, DW_AT_name("GetMaxFrames")
    2278                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_GetMaxFrames")
    2279                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2280                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    2281              $C$DW$426       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$97)
    2283                      .dwattr $C$DW$426, DW_AT_name("SetTIesrPrune")
    2284                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_SetTIesrPrune")
    2285                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2286                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    2287              $C$DW$427       .dwtag  DW_TAG_member
    2288                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$97)
    2289                      .dwattr $C$DW$427, DW_AT_name("SetTIesrTransiWeight")
    2290                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_SetTIesrTransiWeight")
    2291                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2292                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    2293              $C$DW$428       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$123)
    2295                      .dwattr $C$DW$428, DW_AT_name("SetTIesrSAD")
    2296                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_SetTIesrSAD")
    2297                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2298                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    2299              $C$DW$429       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$97)
    2301                      .dwattr $C$DW$429, DW_AT_name("SetTIesrJacRate")
    2302                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_SetTIesrJacRate")
    2303                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2304                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    2305              $C$DW$430       .dwtag  DW_TAG_member
    2306                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$125)
    2307                      .dwattr $C$DW$430, DW_AT_name("SetTIesrJAC")
    2308                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_SetTIesrJAC")
    2309                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2310                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    2311              $C$DW$431       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$97)
    2313                      .dwattr $C$DW$431, DW_AT_name("SetTIesrSBC")
    2314                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_SetTIesrSBC")
    2315                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2316                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    2317              $C$DW$432       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$105)
    2319                      .dwattr $C$DW$432, DW_AT_name("SetTIesrVolRange")
    2320                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_SetTIesrVolRange")
    2321                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2322                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    2323              $C$DW$433       .dwtag  DW_TAG_member
    2324                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$127)
    2325                      .dwattr $C$DW$433, DW_AT_name("GetTIesrPrune")
    2326                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_GetTIesrPrune")
    2327                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2328                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    2329              $C$DW$434       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$127)
    2331                      .dwattr $C$DW$434, DW_AT_name("GetTIesrTransiWeight")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   48

    2332                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_GetTIesrTransiWeight")
    2333                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2334                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    2335              $C$DW$435       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$129)
    2337                      .dwattr $C$DW$435, DW_AT_name("GetTIesrSAD")
    2338                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_GetTIesrSAD")
    2339                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2340                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    2341              $C$DW$436       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$99)
    2343                      .dwattr $C$DW$436, DW_AT_name("GetTIesrJacRate")
    2344                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_GetTIesrJacRate")
    2345                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2346                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    2347              $C$DW$437       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$131)
    2349                      .dwattr $C$DW$437, DW_AT_name("GetTIesrJAC")
    2350                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GetTIesrJAC")
    2351                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2352                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    2353              $C$DW$438       .dwtag  DW_TAG_member
    2354                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$127)
    2355                      .dwattr $C$DW$438, DW_AT_name("GetTIesrSBC")
    2356                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_GetTIesrSBC")
    2357                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2358                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    2359              $C$DW$439       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$133)
    2361                      .dwattr $C$DW$439, DW_AT_name("GetTIesrVolRange")
    2362                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_GetTIesrVolRange")
    2363                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2364                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    2365                      .dwendtag $C$DW$T$134
    2366              
    2367              $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineSIRECOType")
    2368                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$134)
    2369                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    2370              $C$DW$T$186     .dwtag  DW_TAG_pointer_type
    2371                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$185)
    2372                      .dwattr $C$DW$T$186, DW_AT_address_class(0x17)
    2373              
    2374              $C$DW$T$57      .dwtag  DW_TAG_subroutine_type
    2375                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2376              $C$DW$440       .dwtag  DW_TAG_formal_parameter
    2377                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$54)
    2378                      .dwendtag $C$DW$T$57
    2379              
    2380              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2381                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2382                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    2383              
    2384              $C$DW$T$96      .dwtag  DW_TAG_subroutine_type
    2385                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2386              $C$DW$441       .dwtag  DW_TAG_formal_parameter
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   49

    2387                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$54)
    2388              $C$DW$442       .dwtag  DW_TAG_formal_parameter
    2389                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$8)
    2390                      .dwendtag $C$DW$T$96
    2391              
    2392              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    2393                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    2394                      .dwattr $C$DW$T$97, DW_AT_address_class(0x20)
    2395              
    2396              $C$DW$T$98      .dwtag  DW_TAG_subroutine_type
    2397                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2398              $C$DW$443       .dwtag  DW_TAG_formal_parameter
    2399                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$54)
    2400              $C$DW$444       .dwtag  DW_TAG_formal_parameter
    2401                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$21)
    2402                      .dwendtag $C$DW$T$98
    2403              
    2404              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    2405                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    2406                      .dwattr $C$DW$T$99, DW_AT_address_class(0x20)
    2407              
    2408              $C$DW$T$100     .dwtag  DW_TAG_subroutine_type
    2409                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    2410              $C$DW$445       .dwtag  DW_TAG_formal_parameter
    2411                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$8)
    2412              $C$DW$446       .dwtag  DW_TAG_formal_parameter
    2413                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$8)
    2414              $C$DW$447       .dwtag  DW_TAG_formal_parameter
    2415                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    2416                      .dwendtag $C$DW$T$100
    2417              
    2418              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    2419                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    2420                      .dwattr $C$DW$T$101, DW_AT_address_class(0x20)
    2421              
    2422              $C$DW$T$102     .dwtag  DW_TAG_subroutine_type
    2423                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    2424              $C$DW$448       .dwtag  DW_TAG_formal_parameter
    2425                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$21)
    2426              $C$DW$449       .dwtag  DW_TAG_formal_parameter
    2427                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$21)
    2428              $C$DW$450       .dwtag  DW_TAG_formal_parameter
    2429                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$54)
    2430                      .dwendtag $C$DW$T$102
    2431              
    2432              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    2433                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    2434                      .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    2435              
    2436              $C$DW$T$104     .dwtag  DW_TAG_subroutine_type
    2437                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    2438              $C$DW$451       .dwtag  DW_TAG_formal_parameter
    2439                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$54)
    2440              $C$DW$452       .dwtag  DW_TAG_formal_parameter
    2441                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:16 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2199210                         PAGE   50

    2442              $C$DW$453       .dwtag  DW_TAG_formal_parameter
    2443                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$9)
    2444                      .dwendtag $C$DW$T$104
    2445              
    2446              $C$DW$T$105     .dwtag  DW_TAG_pointer_type
    2447                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    2448                      .dwattr $C$DW$T$105, DW_AT_address_class(0x20)
    2449              
    2450              $C$DW$T$106     .dwtag  DW_TAG_subroutine_type
    2451                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    2452              $C$DW$454       .dwtag  DW_TAG_formal_parameter
    2453                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$81)
    2454              $C$DW$455       .dwtag  DW_TAG_formal_parameter
    2455                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$35)
    2456              $C$DW$456       .dwtag  DW_TAG_formal_parameter
    2457                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$35)
    2458                      .dwendtag $C$DW$T$106
    2459              
    2460              $C$DW$T$107     .dwtag  DW_TAG_pointer_type
    2461                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    2462                      .dwattr $C$DW$T$107, DW_AT_address_class(0x20)
    2463              
    2464              $C$DW$T$108     .dwtag  DW_TAG_subroutine_type
    2465                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    2466              $C$DW$457       .dwtag  DW_TAG_formal_parameter
    2467                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$8)
    2468              $C$DW$458       .dwtag  DW_TAG_formal_parameter
    2469                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$8)
    2470              $C$DW$459       .dwtag  DW_TAG_formal_parameter
    2471                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$8)
    2472              $C$DW$460       .dwtag  DW_TAG_formal_parameter
    2473                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$8)
    2474              $C$DW$461       .dwtag  DW_TAG_formal_parameter
    2475                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$8)
    2476              $C$DW$462       .dwtag  DW_TAG_formal_parameter
    2477                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$9)
    2478              $C$DW$463       .dwtag  DW_TAG_formal_parameter
    2479                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$8)
    2480              $C$DW$464       .dwtag  DW_TAG_formal_parameter
    2481                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$8)
    2482              $C$DW$465       .dwtag  DW_TAG_formal_parameter
    2483                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    2484                      .dwendtag $C$DW$T$108
    2485              
    2486              $C$DW$T$109     .dwtag  DW_TAG_pointer_type
    2487                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
