TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE    1

    5168              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:17 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2930              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureDimensionFail"), DW_AT_const_value(
    2931              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSegmentSizeCheckFail"), DW_AT_const_value(
    2932              $C$DW$300       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelFileFail"), DW_AT_const_value(0x1c4)
    2933              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSaveFail"), DW_AT_const_value(0x1c5)
    2934              $C$DW$302       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineEnrollLoadFail"), DW_AT_const_value(0x1c6)
    2935              $C$DW$303       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackgoundCreationFail"), DW_AT_const_value
    2936              $C$DW$304       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineStateMemoryOut"), DW_AT_const_value(0x1f4)
    2937              $C$DW$305       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSearchMemoryOut"), DW_AT_const_value(0x1f5
    2938              $C$DW$306       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelMemorySize"), DW_AT_const_value(0x258
    2939              $C$DW$307       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureMemorySize"), DW_AT_const_value(0x2
    2940              $C$DW$308       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineNetworkMemorySize"), DW_AT_const_value(0x2
    2941              $C$DW$309       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelSize"), DW_AT_const_value(0x25b)
    2942              $C$DW$310       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackTrackMemorySize"), DW_AT_const_value(0
    2943              $C$DW$311       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineCMMemorySize"), DW_AT_const_value(0x25d)
    2944              $C$DW$312       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineVALTreeMemorySize"), DW_AT_const_value(0x2
    2945              $C$DW$313       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSym2PosMapSize"), DW_AT_const_value(0x25f)
    2946              $C$DW$314       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineShortUtterance"), DW_AT_const_value(0x2bc)
    2947              $C$DW$315       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadHMM2Phone"), DW_AT_const_value(0x320)
    2948              $C$DW$316       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNoSilencePhone"), DW_AT_const_value(0x321)
    2949              $C$DW$317       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhone2Voicing"), DW_AT_const_value(0x322)
    2950              $C$DW$318       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhoneDuration"), DW_AT_const_value(0x323)
    2951              $C$DW$319       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMismatch"), DW_AT_const_value(0x324)
    2952              $C$DW$320       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMissWord"), DW_AT_const_value(0x325)
    2953              $C$DW$321       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneDuration"), DW_AT_const_value(0x326)
    2954              $C$DW$322       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneWord"), DW_AT_const_value(0x327)
    2955              $C$DW$323       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveTTSMean"), DW_AT_const_value(0x328)
    2956              $C$DW$324       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveVoicing"), DW_AT_const_value(0x329)
    2957              $C$DW$325       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveDuration"), DW_AT_const_value(0x32a)
    2958              $C$DW$326       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSTTS"), DW_AT_const_value(0x32b)
    2959              $C$DW$327       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneList"), DW_AT_const_value(0x32c)
    2960              $C$DW$328       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumPhones"), DW_AT_const_value(0x32d)
    2961              $C$DW$329       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumWords"), DW_AT_const_value(0x32e)
    2962              $C$DW$330       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputFile"), DW_AT_const_value(0x32f)
    2963              $C$DW$331       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputMFCC"), DW_AT_const_value(0x330)
    2964              $C$DW$332       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputDuration"), DW_AT_const_value(0x331)
    2965              $C$DW$333       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputVoicing"), DW_AT_const_value(0x332)
    2966              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNotFound"), DW_AT_const_value(0x333)
    2967              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputMeanSize"), DW_AT_const_value(0x334)
    2968              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutput"), DW_AT_const_value(0x335)
    2969                      .dwendtag $C$DW$T$91
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   60

    2970              
    2971              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineStatusType")
    2972                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    2973                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2974              
    2975              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2976                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
    2977              $C$DW$337       .dwtag  DW_TAG_member
    2978                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$8)
    2979                      .dwattr $C$DW$337, DW_AT_name("num")
    2980                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_num")
    2981                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2982                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2983              $C$DW$338       .dwtag  DW_TAG_member
    2984                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$8)
    2985                      .dwattr $C$DW$338, DW_AT_name("x1")
    2986                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_x1")
    2987                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2988                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2989              $C$DW$339       .dwtag  DW_TAG_member
    2990                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$8)
    2991                      .dwattr $C$DW$339, DW_AT_name("x2")
    2992                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_x2")
    2993                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2994                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2995                      .dwendtag $C$DW$T$19
    2996              
    2997              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    2998                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$19)
    2999                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3000              $C$DW$340       .dwtag  DW_TAG_TI_far_type
    3001                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$56)
    3002              $C$DW$T$57      .dwtag  DW_TAG_const_type
    3003                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$340)
    3004              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    3005                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3006                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
    3007              
    3008              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3009                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    3010              $C$DW$341       .dwtag  DW_TAG_member
    3011                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$20)
    3012                      .dwattr $C$DW$341, DW_AT_name("max_mem_usage")
    3013                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_max_mem_usage")
    3014                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3015                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3016              $C$DW$342       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    3018                      .dwattr $C$DW$342, DW_AT_name("n_terminals")
    3019                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_n_terminals")
    3020                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3021                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3022              $C$DW$343       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
    3024                      .dwattr $C$DW$343, DW_AT_name("n_monophones")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   61

    3025                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_n_monophones")
    3026                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3027                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3028              $C$DW$344       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$21)
    3030                      .dwattr $C$DW$344, DW_AT_name("hlrTreeBase")
    3031                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_hlrTreeBase")
    3032                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3033                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3034              $C$DW$345       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
    3036                      .dwattr $C$DW$345, DW_AT_name("hlrTerminal")
    3037                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_hlrTerminal")
    3038                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3039                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$346       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$21)
    3042                      .dwattr $C$DW$346, DW_AT_name("pHMM2phone")
    3043                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_pHMM2phone")
    3044                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3045                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3046              $C$DW$347       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
    3048                      .dwattr $C$DW$347, DW_AT_name("hlrTransformIndex")
    3049                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_hlrTransformIndex")
    3050                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3051                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3052              $C$DW$348       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    3054                      .dwattr $C$DW$348, DW_AT_name("hlr_TRANSFORM_SIZE")
    3055                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    3056                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3057                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3058              $C$DW$349       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$21)
    3060                      .dwattr $C$DW$349, DW_AT_name("hlrTransforms")
    3061                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_hlrTransforms")
    3062                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3063                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3064              $C$DW$350       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$21)
    3066                      .dwattr $C$DW$350, DW_AT_name("pSegStat_dif1")
    3067                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_pSegStat_dif1")
    3068                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3069                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3070              $C$DW$351       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$21)
    3072                      .dwattr $C$DW$351, DW_AT_name("pSegStat_dif2")
    3073                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_pSegStat_dif2")
    3074                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3075                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3076              $C$DW$352       .dwtag  DW_TAG_member
    3077                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$21)
    3078                      .dwattr $C$DW$352, DW_AT_name("pEnhanced")
    3079                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_pEnhanced")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   62

    3080                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3081                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3082              $C$DW$353       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$21)
    3084                      .dwattr $C$DW$353, DW_AT_name("bk_node_cnt")
    3085                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_bk_node_cnt")
    3086                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3087                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3088                      .dwendtag $C$DW$T$23
    3089              
    3090              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    3091                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$23)
    3092                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3093              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    3094                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3095                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
    3096              
    3097              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3098                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    3099              $C$DW$354       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$9)
    3101                      .dwattr $C$DW$354, DW_AT_name("sym_code")
    3102                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_sym_code")
    3103                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3104                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3105              $C$DW$355       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$9)
    3107                      .dwattr $C$DW$355, DW_AT_name("start_cell")
    3108                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_start_cell")
    3109                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3110                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3111              $C$DW$356       .dwtag  DW_TAG_member
    3112                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$9)
    3113                      .dwattr $C$DW$356, DW_AT_name("depth")
    3114                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_depth")
    3115                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3116                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3117                      .dwendtag $C$DW$T$24
    3118              
    3119              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    3120                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$24)
    3121                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3122              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    3123                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    3124                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    3125              
    3126              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3127                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    3128              $C$DW$357       .dwtag  DW_TAG_member
    3129                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$8)
    3130                      .dwattr $C$DW$357, DW_AT_name("scr")
    3131                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_scr")
    3132                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3133                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3134              $C$DW$358       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   63

    3135                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$9)
    3136                      .dwattr $C$DW$358, DW_AT_name("sym")
    3137                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_sym")
    3138                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3139                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3140              $C$DW$359       .dwtag  DW_TAG_member
    3141                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$9)
    3142                      .dwattr $C$DW$359, DW_AT_name("frm")
    3143                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_frm")
    3144                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3145                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3146                      .dwendtag $C$DW$T$25
    3147              
    3148              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    3149                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$25)
    3150                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3151              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    3152                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    3153                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    3154              
    3155              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3156                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    3157              $C$DW$360       .dwtag  DW_TAG_member
    3158                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$9)
    3159                      .dwattr $C$DW$360, DW_AT_name("frm")
    3160                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_frm")
    3161                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3162                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3163              $C$DW$361       .dwtag  DW_TAG_member
    3164                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$9)
    3165                      .dwattr $C$DW$361, DW_AT_name("beam_idx")
    3166                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_beam_idx")
    3167                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3168                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3169                      .dwendtag $C$DW$T$26
    3170              
    3171              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    3172                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$26)
    3173                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3174              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    3175                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3176                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    3177              
    3178              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3179                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    3180              $C$DW$362       .dwtag  DW_TAG_member
    3181                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$9)
    3182                      .dwattr $C$DW$362, DW_AT_name("n_hmm")
    3183                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_n_hmm")
    3184                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3185                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3186              $C$DW$363       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$9)
    3188                      .dwattr $C$DW$363, DW_AT_name("n_sym")
    3189                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_n_sym")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   64

    3190                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3191                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3192              $C$DW$364       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$9)
    3194                      .dwattr $C$DW$364, DW_AT_name("n_word")
    3195                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_n_word")
    3196                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3197                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3198              $C$DW$365       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$9)
    3200                      .dwattr $C$DW$365, DW_AT_name("n_set")
    3201                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_n_set")
    3202                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3203                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3204              $C$DW$366       .dwtag  DW_TAG_member
    3205                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$9)
    3206                      .dwattr $C$DW$366, DW_AT_name("n_hmm_set")
    3207                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_n_hmm_set")
    3208                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3209                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3210              $C$DW$367       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$9)
    3212                      .dwattr $C$DW$367, DW_AT_name("start")
    3213                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_start")
    3214                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3215                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3216              $C$DW$368       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$9)
    3218                      .dwattr $C$DW$368, DW_AT_name("stop")
    3219                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_stop")
    3220                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3221                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3222              $C$DW$369       .dwtag  DW_TAG_member
    3223                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$27)
    3224                      .dwattr $C$DW$369, DW_AT_name("symlist")
    3225                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_symlist")
    3226                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3227                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3228                      .dwendtag $C$DW$T$28
    3229              
    3230              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    3231                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    3232                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3233              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    3234                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    3235                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    3236              
    3237              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3238                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    3239              $C$DW$370       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$9)
    3241                      .dwattr $C$DW$370, DW_AT_name("high_pos")
    3242                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_high_pos")
    3243                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3244                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   65

    3245              $C$DW$371       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$9)
    3247                      .dwattr $C$DW$371, DW_AT_name("cur_pos")
    3248                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_cur_pos")
    3249                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3250                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3251                      .dwendtag $C$DW$T$29
    3252              
    3253              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    3254                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3255                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3256              
    3257              $C$DW$T$31      .dwtag  DW_TAG_array_type
    3258                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3259                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3260                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    3261              $C$DW$372       .dwtag  DW_TAG_subrange_type
    3262                      .dwattr $C$DW$372, DW_AT_upper_bound(0x01)
    3263                      .dwendtag $C$DW$T$31
    3264              
    3265              
    3266              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3267                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    3268              $C$DW$373       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$30)
    3270                      .dwattr $C$DW$373, DW_AT_name("state")
    3271                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_state")
    3272                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3273                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3274              $C$DW$374       .dwtag  DW_TAG_member
    3275                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$31)
    3276                      .dwattr $C$DW$374, DW_AT_name("sym")
    3277                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_sym")
    3278                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3279                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3280              $C$DW$375       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$30)
    3282                      .dwattr $C$DW$375, DW_AT_name("beam")
    3283                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_beam")
    3284                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3285                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3286              $C$DW$376       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$30)
    3288                      .dwattr $C$DW$376, DW_AT_name("time")
    3289                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_time")
    3290                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3291                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3292                      .dwendtag $C$DW$T$32
    3293              
    3294              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    3295                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$32)
    3296                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3297              
    3298              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3299                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   66

    3300              $C$DW$377       .dwtag  DW_TAG_member
    3301                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$33)
    3302                      .dwattr $C$DW$377, DW_AT_name("cur_sym")
    3303                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_cur_sym")
    3304                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3305                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3306              $C$DW$378       .dwtag  DW_TAG_member
    3307                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$9)
    3308                      .dwattr $C$DW$378, DW_AT_name("cur_state")
    3309                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_cur_state")
    3310                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3311                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3312                      .dwendtag $C$DW$T$34
    3313              
    3314              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    3315                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
    3316                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    3317              
    3318              $C$DW$T$81      .dwtag  DW_TAG_array_type
    3319                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    3320                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3321                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x06)
    3322              $C$DW$379       .dwtag  DW_TAG_subrange_type
    3323                      .dwattr $C$DW$379, DW_AT_upper_bound(0x01)
    3324                      .dwendtag $C$DW$T$81
    3325              
    3326              
    3327              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3328                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    3329              $C$DW$380       .dwtag  DW_TAG_member
    3330                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$9)
    3331                      .dwattr $C$DW$380, DW_AT_name("max_nbr_syms")
    3332                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_max_nbr_syms")
    3333                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3334                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3335              $C$DW$381       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$8)
    3337                      .dwattr $C$DW$381, DW_AT_name("nbr_syms")
    3338                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_nbr_syms")
    3339                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3340                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3341              $C$DW$382       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$21)
    3343                      .dwattr $C$DW$382, DW_AT_name("sym2pos")
    3344                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_sym2pos")
    3345                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3346                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3347              $C$DW$383       .dwtag  DW_TAG_member
    3348                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$35)
    3349                      .dwattr $C$DW$383, DW_AT_name("syms")
    3350                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_syms")
    3351                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3352                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3353                      .dwendtag $C$DW$T$36
    3354              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   67

    3355              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    3356                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
    3357                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3358              
    3359              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3360                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    3361              $C$DW$384       .dwtag  DW_TAG_member
    3362                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$8)
    3363                      .dwattr $C$DW$384, DW_AT_name("scr")
    3364                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_scr")
    3365                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3366                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3367              $C$DW$385       .dwtag  DW_TAG_member
    3368                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$8)
    3369                      .dwattr $C$DW$385, DW_AT_name("n_ans")
    3370                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_n_ans")
    3371                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3372                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3373              $C$DW$386       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$37)
    3375                      .dwattr $C$DW$386, DW_AT_name("answers")
    3376                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_answers")
    3377                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3378                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3379                      .dwendtag $C$DW$T$38
    3380              
    3381              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    3382                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
    3383                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3384              
    3385              $C$DW$T$41      .dwtag  DW_TAG_array_type
    3386                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3387                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3388                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
    3389              $C$DW$387       .dwtag  DW_TAG_subrange_type
    3390                      .dwattr $C$DW$387, DW_AT_upper_bound(0x1d)
    3391                      .dwendtag $C$DW$T$41
    3392              
    3393              
    3394              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3395                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
    3396              $C$DW$388       .dwtag  DW_TAG_member
    3397                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$8)
    3398                      .dwattr $C$DW$388, DW_AT_name("n_bests")
    3399                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_n_bests")
    3400                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3401                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3402              $C$DW$389       .dwtag  DW_TAG_member
    3403                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$39)
    3404                      .dwattr $C$DW$389, DW_AT_name("best_idx")
    3405                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_best_idx")
    3406                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3407                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3408              $C$DW$390       .dwtag  DW_TAG_member
    3409                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$41)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   68

    3410                      .dwattr $C$DW$390, DW_AT_name("elem")
    3411                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_elem")
    3412                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3413                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3414                      .dwendtag $C$DW$T$42
    3415              
    3416              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    3417                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
    3418                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3419              
    3420              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3421                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
    3422              $C$DW$391       .dwtag  DW_TAG_member
    3423                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    3424                      .dwattr $C$DW$391, DW_AT_name("alpha_p")
    3425                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_alpha_p")
    3426                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3427                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3428              $C$DW$392       .dwtag  DW_TAG_member
    3429                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    3430                      .dwattr $C$DW$392, DW_AT_name("sAlpha")
    3431                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_sAlpha")
    3432                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3433                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3434              $C$DW$393       .dwtag  DW_TAG_member
    3435                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$8)
    3436                      .dwattr $C$DW$393, DW_AT_name("sBeta")
    3437                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_sBeta")
    3438                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3439                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3440              $C$DW$394       .dwtag  DW_TAG_member
    3441                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$8)
    3442                      .dwattr $C$DW$394, DW_AT_name("lambdaLTEhigherE")
    3443                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    3444                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3445                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3446              $C$DW$395       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$8)
    3448                      .dwattr $C$DW$395, DW_AT_name("frm_count")
    3449                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_frm_count")
    3450                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3451                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3452              $C$DW$396       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    3454                      .dwattr $C$DW$396, DW_AT_name("prob_sp")
    3455                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_prob_sp")
    3456                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3457                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3458              $C$DW$397       .dwtag  DW_TAG_member
    3459                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
    3460                      .dwattr $C$DW$397, DW_AT_name("s_noise_floor")
    3461                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_s_noise_floor")
    3462                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3463                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3464              $C$DW$398       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   69

    3465                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
    3466                      .dwattr $C$DW$398, DW_AT_name("snr")
    3467                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_snr")
    3468                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3469                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3470              $C$DW$399       .dwtag  DW_TAG_member
    3471                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    3472                      .dwattr $C$DW$399, DW_AT_name("ps_long_term_noise")
    3473                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_ps_long_term_noise")
    3474                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3475                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3476              $C$DW$400       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$8)
    3478                      .dwattr $C$DW$400, DW_AT_name("frmEn")
    3479                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_frmEn")
    3480                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3481                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3482              $C$DW$401       .dwtag  DW_TAG_member
    3483                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$8)
    3484                      .dwattr $C$DW$401, DW_AT_name("meanEn")
    3485                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_meanEn")
    3486                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3487                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3488              $C$DW$402       .dwtag  DW_TAG_member
    3489                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$8)
    3490                      .dwattr $C$DW$402, DW_AT_name("prevMeanEn")
    3491                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_prevMeanEn")
    3492                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3493                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3494              $C$DW$403       .dwtag  DW_TAG_member
    3495                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$8)
    3496                      .dwattr $C$DW$403, DW_AT_name("noiselvl")
    3497                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_noiselvl")
    3498                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3499                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3500              $C$DW$404       .dwtag  DW_TAG_member
    3501                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$8)
    3502                      .dwattr $C$DW$404, DW_AT_name("lambdaLTE")
    3503                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_lambdaLTE")
    3504                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3505                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3506              $C$DW$405       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$8)
    3508                      .dwattr $C$DW$405, DW_AT_name("nbSpeechFrame")
    3509                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_nbSpeechFrame")
    3510                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3511                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3512              $C$DW$406       .dwtag  DW_TAG_member
    3513                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$8)
    3514                      .dwattr $C$DW$406, DW_AT_name("hangOver")
    3515                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_hangOver")
    3516                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3517                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3518                      .dwendtag $C$DW$T$43
    3519              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   70

    3520              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    3521                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$43)
    3522                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3523              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    3524                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3525                      .dwattr $C$DW$T$87, DW_AT_address_class(0x17)
    3526              
    3527              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3528                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
    3529              $C$DW$407       .dwtag  DW_TAG_member
    3530                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$8)
    3531                      .dwattr $C$DW$407, DW_AT_name("mean")
    3532                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_mean")
    3533                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3534                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3535              $C$DW$408       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$8)
    3537                      .dwattr $C$DW$408, DW_AT_name("inv")
    3538                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_inv")
    3539                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3540                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3541              $C$DW$409       .dwtag  DW_TAG_member
    3542                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$8)
    3543                      .dwattr $C$DW$409, DW_AT_name("gconst")
    3544                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_gconst")
    3545                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3546                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3547                      .dwendtag $C$DW$T$44
    3548              
    3549              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    3550                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    3551                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3552              
    3553              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3554                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
    3555              $C$DW$410       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$45)
    3557                      .dwattr $C$DW$410, DW_AT_name("base_mem")
    3558                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_base_mem")
    3559                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3560                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3561              $C$DW$411       .dwtag  DW_TAG_member
    3562                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3563                      .dwattr $C$DW$411, DW_AT_name("mem_count")
    3564                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_mem_count")
    3565                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    3566                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3567              $C$DW$412       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$22)
    3569                      .dwattr $C$DW$412, DW_AT_name("answers")
    3570                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_answers")
    3571                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    3572                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3573              $C$DW$413       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   71

    3575                      .dwattr $C$DW$413, DW_AT_name("uStp")
    3576                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_uStp")
    3577                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    3578                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3579              $C$DW$414       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3581                      .dwattr $C$DW$414, DW_AT_name("nWords")
    3582                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_nWords")
    3583                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    3584                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3585              $C$DW$415       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$8)
    3587                      .dwattr $C$DW$415, DW_AT_name("nS")
    3588                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_nS")
    3589                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    3590                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3591              $C$DW$416       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$21)
    3593                      .dwattr $C$DW$416, DW_AT_name("cm_scr")
    3594                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_cm_scr")
    3595                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    3596                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3597              $C$DW$417       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$8)
    3599                      .dwattr $C$DW$417, DW_AT_name("bNeedUpdate")
    3600                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_bNeedUpdate")
    3601                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    3602                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$418       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$21)
    3605                      .dwattr $C$DW$418, DW_AT_name("cm_anti_scr")
    3606                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_cm_anti_scr")
    3607                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    3608                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3609              $C$DW$419       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$12)
    3611                      .dwattr $C$DW$419, DW_AT_name("cm_fg_scr")
    3612                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_cm_fg_scr")
    3613                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    3614                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3615              $C$DW$420       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$12)
    3617                      .dwattr $C$DW$420, DW_AT_name("cm_bk_scr")
    3618                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_cm_bk_scr")
    3619                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    3620                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3621              $C$DW$421       .dwtag  DW_TAG_member
    3622                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$8)
    3623                      .dwattr $C$DW$421, DW_AT_name("th_nbest")
    3624                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_th_nbest")
    3625                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    3626                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3627              $C$DW$422       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$8)
    3629                      .dwattr $C$DW$422, DW_AT_name("nSpeech")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   72

    3630                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_nSpeech")
    3631                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    3632                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3633              $C$DW$423       .dwtag  DW_TAG_member
    3634                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$8)
    3635                      .dwattr $C$DW$423, DW_AT_name("nNoise")
    3636                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_nNoise")
    3637                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    3638                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3639              $C$DW$424       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$12)
    3641                      .dwattr $C$DW$424, DW_AT_name("speech_power")
    3642                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_speech_power")
    3643                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    3644                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3645              $C$DW$425       .dwtag  DW_TAG_member
    3646                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$12)
    3647                      .dwattr $C$DW$425, DW_AT_name("noise_power")
    3648                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_noise_power")
    3649                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    3650                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3651              $C$DW$426       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$12)
    3653                      .dwattr $C$DW$426, DW_AT_name("noise_power_sqr")
    3654                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_noise_power_sqr")
    3655                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    3656                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3657              $C$DW$427       .dwtag  DW_TAG_member
    3658                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$8)
    3659                      .dwattr $C$DW$427, DW_AT_name("NSNR")
    3660                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_NSNR")
    3661                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    3662                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3663              $C$DW$428       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$46)
    3665                      .dwattr $C$DW$428, DW_AT_name("H0")
    3666                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_H0")
    3667                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    3668                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3669              $C$DW$429       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$46)
    3671                      .dwattr $C$DW$429, DW_AT_name("H1")
    3672                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_H1")
    3673                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    3674                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3675              $C$DW$430       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$21)
    3677                      .dwattr $C$DW$430, DW_AT_name("lgBeta")
    3678                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_lgBeta")
    3679                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    3680                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3681              $C$DW$431       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$47)
    3683                      .dwattr $C$DW$431, DW_AT_name("acc_dif2_beta")
    3684                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_acc_dif2_beta")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   73

    3685                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    3686                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3687              $C$DW$432       .dwtag  DW_TAG_member
    3688                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$8)
    3689                      .dwattr $C$DW$432, DW_AT_name("bCalced")
    3690                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_bCalced")
    3691                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    3692                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3693              $C$DW$433       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$21)
    3695                      .dwattr $C$DW$433, DW_AT_name("sCH")
    3696                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_sCH")
    3697                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    3698                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3699              $C$DW$434       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$47)
    3701                      .dwattr $C$DW$434, DW_AT_name("lAccum")
    3702                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_lAccum")
    3703                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    3704                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3705              $C$DW$435       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$8)
    3707                      .dwattr $C$DW$435, DW_AT_name("adp_th")
    3708                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_adp_th")
    3709                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    3710                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3711                      .dwendtag $C$DW$T$48
    3712              
    3713              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    3714                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$48)
    3715                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3716              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    3717                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3718                      .dwattr $C$DW$T$89, DW_AT_address_class(0x17)
    3719              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3720                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3721                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3722                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3723              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3724                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3725                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3726                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3727              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3728                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3729                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3730                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3731              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3732                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3733                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3734                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3735              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3736                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3737                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3738                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3739              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   74

    3740                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$8)
    3741                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    3742              
    3743              $C$DW$T$39      .dwtag  DW_TAG_array_type
    3744                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
    3745                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3746                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    3747              $C$DW$436       .dwtag  DW_TAG_subrange_type
    3748                      .dwattr $C$DW$436, DW_AT_upper_bound(0x1d)
    3749                      .dwendtag $C$DW$T$39
    3750              
    3751              
    3752              $C$DW$T$45      .dwtag  DW_TAG_array_type
    3753                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$8)
    3754                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3755                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x514)
    3756              $C$DW$437       .dwtag  DW_TAG_subrange_type
    3757                      .dwattr $C$DW$437, DW_AT_upper_bound(0x513)
    3758                      .dwendtag $C$DW$T$45
    3759              
    3760              
    3761              $C$DW$T$50      .dwtag  DW_TAG_array_type
    3762                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$8)
    3763                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3764                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x100)
    3765              $C$DW$438       .dwtag  DW_TAG_subrange_type
    3766                      .dwattr $C$DW$438, DW_AT_upper_bound(0xff)
    3767                      .dwendtag $C$DW$T$50
    3768              
    3769              
    3770              $C$DW$T$51      .dwtag  DW_TAG_array_type
    3771                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    3772                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3773                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    3774              $C$DW$439       .dwtag  DW_TAG_subrange_type
    3775                      .dwattr $C$DW$439, DW_AT_upper_bound(0x0f)
    3776                      .dwendtag $C$DW$T$51
    3777              
    3778              
    3779              $C$DW$T$52      .dwtag  DW_TAG_array_type
    3780                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    3781                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3782                      .dwattr $C$DW$T$52, DW_AT_byte_size(0xe0)
    3783              $C$DW$440       .dwtag  DW_TAG_subrange_type
    3784                      .dwattr $C$DW$440, DW_AT_upper_bound(0x0d)
    3785              $C$DW$441       .dwtag  DW_TAG_subrange_type
    3786                      .dwattr $C$DW$441, DW_AT_upper_bound(0x0f)
    3787                      .dwendtag $C$DW$T$52
    3788              
    3789              $C$DW$442       .dwtag  DW_TAG_TI_far_type
    3790                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$8)
    3791              $C$DW$T$53      .dwtag  DW_TAG_const_type
    3792                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$442)
    3793              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    3794                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   75

    3795                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    3796              
    3797              $C$DW$T$55      .dwtag  DW_TAG_array_type
    3798                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3799                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3800                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x20)
    3801              $C$DW$443       .dwtag  DW_TAG_subrange_type
    3802                      .dwattr $C$DW$443, DW_AT_upper_bound(0x0f)
    3803                      .dwendtag $C$DW$T$55
    3804              
    3805              
    3806              $C$DW$T$59      .dwtag  DW_TAG_array_type
    3807                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$8)
    3808                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3809                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x80)
    3810              $C$DW$444       .dwtag  DW_TAG_subrange_type
    3811                      .dwattr $C$DW$444, DW_AT_upper_bound(0x7f)
    3812                      .dwendtag $C$DW$T$59
    3813              
    3814              
    3815              $C$DW$T$60      .dwtag  DW_TAG_array_type
    3816                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    3817                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3818                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x1a)
    3819              $C$DW$445       .dwtag  DW_TAG_subrange_type
    3820                      .dwattr $C$DW$445, DW_AT_upper_bound(0x19)
    3821                      .dwendtag $C$DW$T$60
    3822              
    3823              
    3824              $C$DW$T$78      .dwtag  DW_TAG_array_type
    3825                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$8)
    3826                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3827                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x20)
    3828              $C$DW$446       .dwtag  DW_TAG_subrange_type
    3829                      .dwattr $C$DW$446, DW_AT_upper_bound(0x1f)
    3830                      .dwendtag $C$DW$T$78
    3831              
    3832              
    3833              $C$DW$T$84      .dwtag  DW_TAG_array_type
    3834                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$8)
    3835                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3836                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x14)
    3837              $C$DW$447       .dwtag  DW_TAG_subrange_type
    3838                      .dwattr $C$DW$447, DW_AT_upper_bound(0x13)
    3839                      .dwendtag $C$DW$T$84
    3840              
    3841              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3842                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3843                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3844                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3845              
    3846              $C$DW$T$27      .dwtag  DW_TAG_array_type
    3847                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    3848                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3849                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   76

    3850              $C$DW$448       .dwtag  DW_TAG_subrange_type
    3851                      .dwattr $C$DW$448, DW_AT_upper_bound(0x00)
    3852                      .dwendtag $C$DW$T$27
    3853              
    3854              
    3855              $C$DW$T$33      .dwtag  DW_TAG_array_type
    3856                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    3857                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3858                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    3859              $C$DW$449       .dwtag  DW_TAG_subrange_type
    3860                      .dwattr $C$DW$449, DW_AT_upper_bound(0x01)
    3861                      .dwendtag $C$DW$T$33
    3862              
    3863              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    3864                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    3865                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    3866              $C$DW$450       .dwtag  DW_TAG_TI_far_type
    3867                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$9)
    3868              $C$DW$T$127     .dwtag  DW_TAG_const_type
    3869                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$450)
    3870              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    3871                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    3872                      .dwattr $C$DW$T$128, DW_AT_address_class(0x17)
    3873              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    3874                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    3875                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3876              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3877                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    3878                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    3879              
    3880              $C$DW$T$37      .dwtag  DW_TAG_array_type
    3881                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
    3882                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3883                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    3884              $C$DW$451       .dwtag  DW_TAG_subrange_type
    3885                      .dwattr $C$DW$451, DW_AT_upper_bound(0x13)
    3886                      .dwendtag $C$DW$T$37
    3887              
    3888              
    3889              $C$DW$T$85      .dwtag  DW_TAG_array_type
    3890                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
    3891                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3892                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    3893              $C$DW$452       .dwtag  DW_TAG_subrange_type
    3894                      .dwattr $C$DW$452, DW_AT_upper_bound(0x01)
    3895                      .dwendtag $C$DW$T$85
    3896              
    3897              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3898                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3899                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3900                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3901              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3902                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3903                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3904                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   77

    3905              $C$DW$T$12      .dwtag  DW_TAG_base_type
    3906                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3907                      .dwattr $C$DW$T$12, DW_AT_name("long")
    3908                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    3909              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    3910                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
    3911                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    3912              
    3913              $C$DW$T$61      .dwtag  DW_TAG_array_type
    3914                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$12)
    3915                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3916                      .dwattr $C$DW$T$61, DW_AT_byte_size(0xd0)
    3917              $C$DW$453       .dwtag  DW_TAG_subrange_type
    3918                      .dwattr $C$DW$453, DW_AT_upper_bound(0x67)
    3919                      .dwendtag $C$DW$T$61
    3920              
    3921              
    3922              $C$DW$T$64      .dwtag  DW_TAG_array_type
    3923                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
    3924                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3925                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x20)
    3926              $C$DW$454       .dwtag  DW_TAG_subrange_type
    3927                      .dwattr $C$DW$454, DW_AT_upper_bound(0x0f)
    3928                      .dwendtag $C$DW$T$64
    3929              
    3930              $C$DW$T$13      .dwtag  DW_TAG_base_type
    3931                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3932                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3933                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    3934              $C$DW$T$14      .dwtag  DW_TAG_base_type
    3935                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3936                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    3937                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    3938                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    3939                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    3940              $C$DW$T$15      .dwtag  DW_TAG_base_type
    3941                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3942                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3943                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    3944                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    3945                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    3946              $C$DW$T$16      .dwtag  DW_TAG_base_type
    3947                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3948                      .dwattr $C$DW$T$16, DW_AT_name("float")
    3949                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    3950              $C$DW$T$17      .dwtag  DW_TAG_base_type
    3951                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3952                      .dwattr $C$DW$T$17, DW_AT_name("double")
    3953                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    3954              $C$DW$T$18      .dwtag  DW_TAG_base_type
    3955                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3956                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    3957                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    3958              $C$DW$T$73      .dwtag  DW_TAG_base_type
    3959                      .dwattr $C$DW$T$73, DW_AT_encoding(DW_ATE_signed_char)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   78

    3960                      .dwattr $C$DW$T$73, DW_AT_name("signed char")
    3961                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    3962              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    3963                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3964                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    3965              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    3966                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$74)
    3967                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    3968              $C$DW$455       .dwtag  DW_TAG_TI_far_type
    3969                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$73)
    3970              $C$DW$T$140     .dwtag  DW_TAG_const_type
    3971                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$455)
    3972              $C$DW$T$141     .dwtag  DW_TAG_pointer_type
    3973                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$140)
    3974                      .dwattr $C$DW$T$141, DW_AT_address_class(0x17)
    3975              
    3976              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3977                      .dwattr $C$DW$T$49, DW_AT_name("ele")
    3978                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x03)
    3979              $C$DW$456       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$9)
    3981                      .dwattr $C$DW$456, DW_AT_name("sym")
    3982                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_sym")
    3983                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3984                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3985              $C$DW$457       .dwtag  DW_TAG_member
    3986                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$9)
    3987                      .dwattr $C$DW$457, DW_AT_name("idx_flag")
    3988                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_idx_flag")
    3989                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3990                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3991              $C$DW$458       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$9)
    3993                      .dwattr $C$DW$458, DW_AT_name("next")
    3994                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_next")
    3995                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3996                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3997                      .dwendtag $C$DW$T$49
    3998              
    3999              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    4000                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$49)
    4001                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4002              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    4003                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    4004                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    4005              
    4006              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    4007                      .dwattr $C$DW$T$90, DW_AT_name("gmhmm_type")
    4008                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x7fe)
    4009              $C$DW$459       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4011                      .dwattr $C$DW$459, DW_AT_name("avedepth")
    4012                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_avedepth")
    4013                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4014                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   79

    4015              $C$DW$460       .dwtag  DW_TAG_member
    4016                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4017                      .dwattr $C$DW$460, DW_AT_name("bestdepth")
    4018                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_bestdepth")
    4019                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4020                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4021              $C$DW$461       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4023                      .dwattr $C$DW$461, DW_AT_name("index_mean")
    4024                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_index_mean")
    4025                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4026                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4027              $C$DW$462       .dwtag  DW_TAG_member
    4028                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4029                      .dwattr $C$DW$462, DW_AT_name("signal_cnt")
    4030                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_signal_cnt")
    4031                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4032                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4033              $C$DW$463       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$8)
    4035                      .dwattr $C$DW$463, DW_AT_name("buf_idx")
    4036                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_buf_idx")
    4037                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4038                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4039              $C$DW$464       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    4041                      .dwattr $C$DW$464, DW_AT_name("speech_detected")
    4042                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_speech_detected")
    4043                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4044                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4045              $C$DW$465       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    4047                      .dwattr $C$DW$465, DW_AT_name("mfcc_cnt")
    4048                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_mfcc_cnt")
    4049                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4050                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4051              $C$DW$466       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    4053                      .dwattr $C$DW$466, DW_AT_name("nbr_cpy")
    4054                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_nbr_cpy")
    4055                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4056                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4057              $C$DW$467       .dwtag  DW_TAG_member
    4058                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$8)
    4059                      .dwattr $C$DW$467, DW_AT_name("last_sig")
    4060                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_last_sig")
    4061                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4062                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4063              $C$DW$468       .dwtag  DW_TAG_member
    4064                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$50)
    4065                      .dwattr $C$DW$468, DW_AT_name("sample_signal")
    4066                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_sample_signal")
    4067                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4068                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4069              $C$DW$469       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   80

    4070                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$8)
    4071                      .dwattr $C$DW$469, DW_AT_name("amplitude_max")
    4072                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_amplitude_max")
    4073                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    4074                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4075              $C$DW$470       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$8)
    4077                      .dwattr $C$DW$470, DW_AT_name("amplitude_min")
    4078                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_amplitude_min")
    4079                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    4080                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4081              $C$DW$471       .dwtag  DW_TAG_member
    4082                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$8)
    4083                      .dwattr $C$DW$471, DW_AT_name("pred_first_frame")
    4084                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_pred_first_frame")
    4085                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    4086                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4087              $C$DW$472       .dwtag  DW_TAG_member
    4088                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$8)
    4089                      .dwattr $C$DW$472, DW_AT_name("frm_cnt")
    4090                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_frm_cnt")
    4091                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    4092                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4093              $C$DW$473       .dwtag  DW_TAG_member
    4094                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$8)
    4095                      .dwattr $C$DW$473, DW_AT_name("beam_count")
    4096                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_beam_count")
    4097                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    4098                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4099              $C$DW$474       .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$8)
    4101                      .dwattr $C$DW$474, DW_AT_name("active_beam_cells")
    4102                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_active_beam_cells")
    4103                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    4104                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4105              $C$DW$475       .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$8)
    4107                      .dwattr $C$DW$475, DW_AT_name("active_time_cells")
    4108                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_active_time_cells")
    4109                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    4110                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4111              $C$DW$476       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$9)
    4113                      .dwattr $C$DW$476, DW_AT_name("ending_sym_count")
    4114                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_ending_sym_count")
    4115                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    4116                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$477       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$8)
    4119                      .dwattr $C$DW$477, DW_AT_name("comp_type")
    4120                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_comp_type")
    4121                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    4122                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$478       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   81

    4125                      .dwattr $C$DW$478, DW_AT_name("low_vol_limit")
    4126                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_low_vol_limit")
    4127                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    4128                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$479       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$9)
    4131                      .dwattr $C$DW$479, DW_AT_name("high_vol_limit")
    4132                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_high_vol_limit")
    4133                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
    4134                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$480       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$8)
    4137                      .dwattr $C$DW$480, DW_AT_name("vol")
    4138                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_vol")
    4139                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    4140                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$481       .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    4143                      .dwattr $C$DW$481, DW_AT_name("n_mfcc")
    4144                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_n_mfcc")
    4145                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    4146                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$482       .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$8)
    4149                      .dwattr $C$DW$482, DW_AT_name("nbr_dim")
    4150                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_nbr_dim")
    4151                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    4152                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$483       .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
    4155                      .dwattr $C$DW$483, DW_AT_name("n_filter")
    4156                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_n_filter")
    4157                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    4158                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$484       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$52)
    4161                      .dwattr $C$DW$484, DW_AT_name("mfcc_buf")
    4162                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_mfcc_buf")
    4163                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    4164                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4165              $C$DW$485       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$51)
    4167                      .dwattr $C$DW$485, DW_AT_name("mfcc_mean")
    4168                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_mfcc_mean")
    4169                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f8]
    4170                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$486       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$55)
    4173                      .dwattr $C$DW$486, DW_AT_name("cosxfm")
    4174                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_cosxfm")
    4175                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    4176                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4177              $C$DW$487       .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$58)
    4179                      .dwattr $C$DW$487, DW_AT_name("mel_filter")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:18 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1152810                         PAGE   82

    4180                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_mel_filter")
    4181                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
    4182                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4183              $C$DW$488       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$8)
    4185                      .dwattr $C$DW$488, DW_AT_name("th_noise_flr")
