TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE    1

    6992              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:19 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4580              $C$DW$489       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineVALTreeMemorySize"), DW_AT_const_value(0x2
    4581              $C$DW$490       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSym2PosMapSize"), DW_AT_const_value(0x25f)
    4582              $C$DW$491       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineShortUtterance"), DW_AT_const_value(0x2bc)
    4583              $C$DW$492       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadHMM2Phone"), DW_AT_const_value(0x320)
    4584              $C$DW$493       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNoSilencePhone"), DW_AT_const_value(0x321)
    4585              $C$DW$494       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhone2Voicing"), DW_AT_const_value(0x322)
    4586              $C$DW$495       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhoneDuration"), DW_AT_const_value(0x323)
    4587              $C$DW$496       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMismatch"), DW_AT_const_value(0x324)
    4588              $C$DW$497       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMissWord"), DW_AT_const_value(0x325)
    4589              $C$DW$498       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneDuration"), DW_AT_const_value(0x326)
    4590              $C$DW$499       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneWord"), DW_AT_const_value(0x327)
    4591              $C$DW$500       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveTTSMean"), DW_AT_const_value(0x328)
    4592              $C$DW$501       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveVoicing"), DW_AT_const_value(0x329)
    4593              $C$DW$502       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveDuration"), DW_AT_const_value(0x32a)
    4594              $C$DW$503       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSTTS"), DW_AT_const_value(0x32b)
    4595              $C$DW$504       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneList"), DW_AT_const_value(0x32c)
    4596              $C$DW$505       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumPhones"), DW_AT_const_value(0x32d)
    4597              $C$DW$506       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumWords"), DW_AT_const_value(0x32e)
    4598              $C$DW$507       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputFile"), DW_AT_const_value(0x32f)
    4599              $C$DW$508       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputMFCC"), DW_AT_const_value(0x330)
    4600              $C$DW$509       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputDuration"), DW_AT_const_value(0x331)
    4601              $C$DW$510       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputVoicing"), DW_AT_const_value(0x332)
    4602              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNotFound"), DW_AT_const_value(0x333)
    4603              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputMeanSize"), DW_AT_const_value(0x334)
    4604              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutput"), DW_AT_const_value(0x335)
    4605                      .dwendtag $C$DW$T$95
    4606              
    4607              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineStatusType")
    4608                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    4609                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  110

    4610              
    4611              $C$DW$T$107     .dwtag  DW_TAG_enumeration_type
    4612                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x01)
    4613              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSuccess"), DW_AT_const_value(0x00)
    4614              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACMemoryFail"), DW_AT_const_value(0x01)
    4615              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACLoadFail"), DW_AT_const_value(0x02)
    4616              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACReset"), DW_AT_const_value(0x03)
    4617              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSaveFail"), DW_AT_const_value(0x04)
    4618              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSBCInitFail"), DW_AT_const_value(0x05)
    4619              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSBCLoadFail"), DW_AT_const_value(0x06)
    4620              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSVAFail"), DW_AT_const_value(0x07)
    4621              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACFail"), DW_AT_const_value(0x08)
    4622              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACNoAlignment"), DW_AT_const_value(0x09)
    4623              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACRJLoadFail"), DW_AT_const_value(0x0a)
    4624                      .dwendtag $C$DW$T$107
    4625              
    4626              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineJACStatusType")
    4627                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    4628                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    4629              
    4630              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4631                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
    4632              $C$DW$525       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$8)
    4634                      .dwattr $C$DW$525, DW_AT_name("num")
    4635                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_num")
    4636                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4637                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4638              $C$DW$526       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$8)
    4640                      .dwattr $C$DW$526, DW_AT_name("x1")
    4641                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_x1")
    4642                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4643                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4644              $C$DW$527       .dwtag  DW_TAG_member
    4645                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$8)
    4646                      .dwattr $C$DW$527, DW_AT_name("x2")
    4647                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_x2")
    4648                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4649                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4650                      .dwendtag $C$DW$T$19
    4651              
    4652              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    4653                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$19)
    4654                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4655              $C$DW$528       .dwtag  DW_TAG_TI_far_type
    4656                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$60)
    4657              $C$DW$T$61      .dwtag  DW_TAG_const_type
    4658                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$528)
    4659              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    4660                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    4661                      .dwattr $C$DW$T$62, DW_AT_address_class(0x17)
    4662              
    4663              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4664                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  111

    4665              $C$DW$529       .dwtag  DW_TAG_member
    4666                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$20)
    4667                      .dwattr $C$DW$529, DW_AT_name("max_mem_usage")
    4668                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_max_mem_usage")
    4669                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4670                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4671              $C$DW$530       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$20)
    4673                      .dwattr $C$DW$530, DW_AT_name("n_terminals")
    4674                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_n_terminals")
    4675                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4676                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4677              $C$DW$531       .dwtag  DW_TAG_member
    4678                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$20)
    4679                      .dwattr $C$DW$531, DW_AT_name("n_monophones")
    4680                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_n_monophones")
    4681                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4682                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4683              $C$DW$532       .dwtag  DW_TAG_member
    4684                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$21)
    4685                      .dwattr $C$DW$532, DW_AT_name("hlrTreeBase")
    4686                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_hlrTreeBase")
    4687                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4688                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4689              $C$DW$533       .dwtag  DW_TAG_member
    4690                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$22)
    4691                      .dwattr $C$DW$533, DW_AT_name("hlrTerminal")
    4692                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_hlrTerminal")
    4693                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4694                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4695              $C$DW$534       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$21)
    4697                      .dwattr $C$DW$534, DW_AT_name("pHMM2phone")
    4698                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_pHMM2phone")
    4699                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4700                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4701              $C$DW$535       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$22)
    4703                      .dwattr $C$DW$535, DW_AT_name("hlrTransformIndex")
    4704                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_hlrTransformIndex")
    4705                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4706                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4707              $C$DW$536       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$20)
    4709                      .dwattr $C$DW$536, DW_AT_name("hlr_TRANSFORM_SIZE")
    4710                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    4711                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4712                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    4713              $C$DW$537       .dwtag  DW_TAG_member
    4714                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$21)
    4715                      .dwattr $C$DW$537, DW_AT_name("hlrTransforms")
    4716                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_hlrTransforms")
    4717                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4718                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4719              $C$DW$538       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  112

    4720                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$21)
    4721                      .dwattr $C$DW$538, DW_AT_name("pSegStat_dif1")
    4722                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_pSegStat_dif1")
    4723                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4724                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4725              $C$DW$539       .dwtag  DW_TAG_member
    4726                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$21)
    4727                      .dwattr $C$DW$539, DW_AT_name("pSegStat_dif2")
    4728                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_pSegStat_dif2")
    4729                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4730                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4731              $C$DW$540       .dwtag  DW_TAG_member
    4732                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$21)
    4733                      .dwattr $C$DW$540, DW_AT_name("pEnhanced")
    4734                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_pEnhanced")
    4735                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4736                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4737              $C$DW$541       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$21)
    4739                      .dwattr $C$DW$541, DW_AT_name("bk_node_cnt")
    4740                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_bk_node_cnt")
    4741                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4742                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4743                      .dwendtag $C$DW$T$23
    4744              
    4745              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    4746                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$23)
    4747                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4748              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    4749                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    4750                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
    4751              
    4752              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4753                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    4754              $C$DW$542       .dwtag  DW_TAG_member
    4755                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$9)
    4756                      .dwattr $C$DW$542, DW_AT_name("sym_code")
    4757                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_sym_code")
    4758                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4759                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4760              $C$DW$543       .dwtag  DW_TAG_member
    4761                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$9)
    4762                      .dwattr $C$DW$543, DW_AT_name("start_cell")
    4763                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_start_cell")
    4764                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4765                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4766              $C$DW$544       .dwtag  DW_TAG_member
    4767                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$9)
    4768                      .dwattr $C$DW$544, DW_AT_name("depth")
    4769                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_depth")
    4770                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4771                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4772                      .dwendtag $C$DW$T$24
    4773              
    4774              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  113

    4775                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$24)
    4776                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4777              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    4778                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    4779                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    4780              
    4781              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4782                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    4783              $C$DW$545       .dwtag  DW_TAG_member
    4784                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$8)
    4785                      .dwattr $C$DW$545, DW_AT_name("scr")
    4786                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_scr")
    4787                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4788                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4789              $C$DW$546       .dwtag  DW_TAG_member
    4790                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$9)
    4791                      .dwattr $C$DW$546, DW_AT_name("sym")
    4792                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_sym")
    4793                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4794                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4795              $C$DW$547       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$9)
    4797                      .dwattr $C$DW$547, DW_AT_name("frm")
    4798                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_frm")
    4799                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4800                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4801                      .dwendtag $C$DW$T$25
    4802              
    4803              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    4804                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$25)
    4805                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4806              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    4807                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    4808                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    4809              
    4810              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4811                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    4812              $C$DW$548       .dwtag  DW_TAG_member
    4813                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$9)
    4814                      .dwattr $C$DW$548, DW_AT_name("frm")
    4815                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_frm")
    4816                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4817                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4818              $C$DW$549       .dwtag  DW_TAG_member
    4819                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$9)
    4820                      .dwattr $C$DW$549, DW_AT_name("beam_idx")
    4821                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_beam_idx")
    4822                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4823                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4824                      .dwendtag $C$DW$T$26
    4825              
    4826              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    4827                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$26)
    4828                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4829              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  114

    4830                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    4831                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    4832              
    4833              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4834                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    4835              $C$DW$550       .dwtag  DW_TAG_member
    4836                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$9)
    4837                      .dwattr $C$DW$550, DW_AT_name("n_hmm")
    4838                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_n_hmm")
    4839                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4840                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4841              $C$DW$551       .dwtag  DW_TAG_member
    4842                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$9)
    4843                      .dwattr $C$DW$551, DW_AT_name("n_sym")
    4844                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_n_sym")
    4845                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4846                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4847              $C$DW$552       .dwtag  DW_TAG_member
    4848                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$9)
    4849                      .dwattr $C$DW$552, DW_AT_name("n_word")
    4850                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_n_word")
    4851                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4852                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4853              $C$DW$553       .dwtag  DW_TAG_member
    4854                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$9)
    4855                      .dwattr $C$DW$553, DW_AT_name("n_set")
    4856                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_n_set")
    4857                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4858                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4859              $C$DW$554       .dwtag  DW_TAG_member
    4860                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$9)
    4861                      .dwattr $C$DW$554, DW_AT_name("n_hmm_set")
    4862                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_n_hmm_set")
    4863                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4864                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4865              $C$DW$555       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$9)
    4867                      .dwattr $C$DW$555, DW_AT_name("start")
    4868                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_start")
    4869                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4870                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4871              $C$DW$556       .dwtag  DW_TAG_member
    4872                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$9)
    4873                      .dwattr $C$DW$556, DW_AT_name("stop")
    4874                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_stop")
    4875                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4876                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4877              $C$DW$557       .dwtag  DW_TAG_member
    4878                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$27)
    4879                      .dwattr $C$DW$557, DW_AT_name("symlist")
    4880                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_symlist")
    4881                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4882                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4883                      .dwendtag $C$DW$T$28
    4884              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  115

    4885              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    4886                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$28)
    4887                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    4888              $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    4889                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    4890                      .dwattr $C$DW$T$80, DW_AT_address_class(0x17)
    4891              
    4892              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4893                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    4894              $C$DW$558       .dwtag  DW_TAG_member
    4895                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$9)
    4896                      .dwattr $C$DW$558, DW_AT_name("high_pos")
    4897                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_high_pos")
    4898                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4899                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4900              $C$DW$559       .dwtag  DW_TAG_member
    4901                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$9)
    4902                      .dwattr $C$DW$559, DW_AT_name("cur_pos")
    4903                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_cur_pos")
    4904                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4905                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4906                      .dwendtag $C$DW$T$29
    4907              
    4908              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    4909                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    4910                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    4911              
    4912              $C$DW$T$31      .dwtag  DW_TAG_array_type
    4913                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    4914                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4915                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    4916              $C$DW$560       .dwtag  DW_TAG_subrange_type
    4917                      .dwattr $C$DW$560, DW_AT_upper_bound(0x01)
    4918                      .dwendtag $C$DW$T$31
    4919              
    4920              
    4921              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4922                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    4923              $C$DW$561       .dwtag  DW_TAG_member
    4924                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$30)
    4925                      .dwattr $C$DW$561, DW_AT_name("state")
    4926                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_state")
    4927                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4928                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4929              $C$DW$562       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$31)
    4931                      .dwattr $C$DW$562, DW_AT_name("sym")
    4932                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_sym")
    4933                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4934                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4935              $C$DW$563       .dwtag  DW_TAG_member
    4936                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$30)
    4937                      .dwattr $C$DW$563, DW_AT_name("beam")
    4938                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_beam")
    4939                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  116

    4940                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4941              $C$DW$564       .dwtag  DW_TAG_member
    4942                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$30)
    4943                      .dwattr $C$DW$564, DW_AT_name("time")
    4944                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_time")
    4945                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4946                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4947                      .dwendtag $C$DW$T$32
    4948              
    4949              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    4950                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$32)
    4951                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4952              
    4953              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4954                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
    4955              $C$DW$565       .dwtag  DW_TAG_member
    4956                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$33)
    4957                      .dwattr $C$DW$565, DW_AT_name("cur_sym")
    4958                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_cur_sym")
    4959                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4960                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4961              $C$DW$566       .dwtag  DW_TAG_member
    4962                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$9)
    4963                      .dwattr $C$DW$566, DW_AT_name("cur_state")
    4964                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_cur_state")
    4965                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4966                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4967                      .dwendtag $C$DW$T$34
    4968              
    4969              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    4970                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$34)
    4971                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4972              
    4973              $C$DW$T$85      .dwtag  DW_TAG_array_type
    4974                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    4975                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4976                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x06)
    4977              $C$DW$567       .dwtag  DW_TAG_subrange_type
    4978                      .dwattr $C$DW$567, DW_AT_upper_bound(0x01)
    4979                      .dwendtag $C$DW$T$85
    4980              
    4981              
    4982              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4983                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    4984              $C$DW$568       .dwtag  DW_TAG_member
    4985                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$9)
    4986                      .dwattr $C$DW$568, DW_AT_name("max_nbr_syms")
    4987                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_max_nbr_syms")
    4988                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4989                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4990              $C$DW$569       .dwtag  DW_TAG_member
    4991                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$8)
    4992                      .dwattr $C$DW$569, DW_AT_name("nbr_syms")
    4993                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_nbr_syms")
    4994                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  117

    4995                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4996              $C$DW$570       .dwtag  DW_TAG_member
    4997                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$21)
    4998                      .dwattr $C$DW$570, DW_AT_name("sym2pos")
    4999                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_sym2pos")
    5000                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5001                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    5002              $C$DW$571       .dwtag  DW_TAG_member
    5003                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$35)
    5004                      .dwattr $C$DW$571, DW_AT_name("syms")
    5005                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_syms")
    5006                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5007                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    5008                      .dwendtag $C$DW$T$36
    5009              
    5010              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    5011                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$36)
    5012                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    5013              
    5014              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5015                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    5016              $C$DW$572       .dwtag  DW_TAG_member
    5017                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$8)
    5018                      .dwattr $C$DW$572, DW_AT_name("scr")
    5019                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_scr")
    5020                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5021                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    5022              $C$DW$573       .dwtag  DW_TAG_member
    5023                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$8)
    5024                      .dwattr $C$DW$573, DW_AT_name("n_ans")
    5025                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_n_ans")
    5026                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5027                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    5028              $C$DW$574       .dwtag  DW_TAG_member
    5029                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$37)
    5030                      .dwattr $C$DW$574, DW_AT_name("answers")
    5031                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_answers")
    5032                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5033                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    5034                      .dwendtag $C$DW$T$38
    5035              
    5036              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    5037                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
    5038                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    5039              
    5040              $C$DW$T$41      .dwtag  DW_TAG_array_type
    5041                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    5042                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    5043                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
    5044              $C$DW$575       .dwtag  DW_TAG_subrange_type
    5045                      .dwattr $C$DW$575, DW_AT_upper_bound(0x1d)
    5046                      .dwendtag $C$DW$T$41
    5047              
    5048              
    5049              $C$DW$T$42      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  118

    5050                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
    5051              $C$DW$576       .dwtag  DW_TAG_member
    5052                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$8)
    5053                      .dwattr $C$DW$576, DW_AT_name("n_bests")
    5054                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_n_bests")
    5055                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5056                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    5057              $C$DW$577       .dwtag  DW_TAG_member
    5058                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$39)
    5059                      .dwattr $C$DW$577, DW_AT_name("best_idx")
    5060                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_best_idx")
    5061                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5062                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    5063              $C$DW$578       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$41)
    5065                      .dwattr $C$DW$578, DW_AT_name("elem")
    5066                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_elem")
    5067                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5068                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    5069                      .dwendtag $C$DW$T$42
    5070              
    5071              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    5072                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$42)
    5073                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    5074              
    5075              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    5076                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
    5077              $C$DW$579       .dwtag  DW_TAG_member
    5078                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$20)
    5079                      .dwattr $C$DW$579, DW_AT_name("alpha_p")
    5080                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_alpha_p")
    5081                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5082                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    5083              $C$DW$580       .dwtag  DW_TAG_member
    5084                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$20)
    5085                      .dwattr $C$DW$580, DW_AT_name("sAlpha")
    5086                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_sAlpha")
    5087                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5088                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    5089              $C$DW$581       .dwtag  DW_TAG_member
    5090                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$8)
    5091                      .dwattr $C$DW$581, DW_AT_name("sBeta")
    5092                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_sBeta")
    5093                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5094                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    5095              $C$DW$582       .dwtag  DW_TAG_member
    5096                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$8)
    5097                      .dwattr $C$DW$582, DW_AT_name("lambdaLTEhigherE")
    5098                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    5099                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5100                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    5101              $C$DW$583       .dwtag  DW_TAG_member
    5102                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$8)
    5103                      .dwattr $C$DW$583, DW_AT_name("frm_count")
    5104                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_frm_count")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  119

    5105                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5106                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    5107              $C$DW$584       .dwtag  DW_TAG_member
    5108                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
    5109                      .dwattr $C$DW$584, DW_AT_name("prob_sp")
    5110                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_prob_sp")
    5111                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5112                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    5113              $C$DW$585       .dwtag  DW_TAG_member
    5114                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$21)
    5115                      .dwattr $C$DW$585, DW_AT_name("s_noise_floor")
    5116                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_s_noise_floor")
    5117                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5118                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    5119              $C$DW$586       .dwtag  DW_TAG_member
    5120                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$21)
    5121                      .dwattr $C$DW$586, DW_AT_name("snr")
    5122                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_snr")
    5123                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5124                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    5125              $C$DW$587       .dwtag  DW_TAG_member
    5126                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$21)
    5127                      .dwattr $C$DW$587, DW_AT_name("ps_long_term_noise")
    5128                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_ps_long_term_noise")
    5129                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5130                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    5131              $C$DW$588       .dwtag  DW_TAG_member
    5132                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$8)
    5133                      .dwattr $C$DW$588, DW_AT_name("frmEn")
    5134                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_frmEn")
    5135                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5136                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    5137              $C$DW$589       .dwtag  DW_TAG_member
    5138                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$8)
    5139                      .dwattr $C$DW$589, DW_AT_name("meanEn")
    5140                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_meanEn")
    5141                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5142                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    5143              $C$DW$590       .dwtag  DW_TAG_member
    5144                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$8)
    5145                      .dwattr $C$DW$590, DW_AT_name("prevMeanEn")
    5146                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_prevMeanEn")
    5147                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5148                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    5149              $C$DW$591       .dwtag  DW_TAG_member
    5150                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$8)
    5151                      .dwattr $C$DW$591, DW_AT_name("noiselvl")
    5152                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_noiselvl")
    5153                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5154                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    5155              $C$DW$592       .dwtag  DW_TAG_member
    5156                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$8)
    5157                      .dwattr $C$DW$592, DW_AT_name("lambdaLTE")
    5158                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_lambdaLTE")
    5159                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  120

    5160                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    5161              $C$DW$593       .dwtag  DW_TAG_member
    5162                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$8)
    5163                      .dwattr $C$DW$593, DW_AT_name("nbSpeechFrame")
    5164                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_nbSpeechFrame")
    5165                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5166                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    5167              $C$DW$594       .dwtag  DW_TAG_member
    5168                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$8)
    5169                      .dwattr $C$DW$594, DW_AT_name("hangOver")
    5170                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_hangOver")
    5171                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5172                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    5173                      .dwendtag $C$DW$T$43
    5174              
    5175              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    5176                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$43)
    5177                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    5178              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    5179                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    5180                      .dwattr $C$DW$T$91, DW_AT_address_class(0x17)
    5181              
    5182              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5183                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
    5184              $C$DW$595       .dwtag  DW_TAG_member
    5185                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$8)
    5186                      .dwattr $C$DW$595, DW_AT_name("mean")
    5187                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_mean")
    5188                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5189                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    5190              $C$DW$596       .dwtag  DW_TAG_member
    5191                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$8)
    5192                      .dwattr $C$DW$596, DW_AT_name("inv")
    5193                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_inv")
    5194                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5195                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    5196              $C$DW$597       .dwtag  DW_TAG_member
    5197                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$8)
    5198                      .dwattr $C$DW$597, DW_AT_name("gconst")
    5199                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_gconst")
    5200                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5201                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    5202                      .dwendtag $C$DW$T$44
    5203              
    5204              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    5205                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    5206                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5207              
    5208              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    5209                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
    5210              $C$DW$598       .dwtag  DW_TAG_member
    5211                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$45)
    5212                      .dwattr $C$DW$598, DW_AT_name("base_mem")
    5213                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_base_mem")
    5214                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  121

    5215                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    5216              $C$DW$599       .dwtag  DW_TAG_member
    5217                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$20)
    5218                      .dwattr $C$DW$599, DW_AT_name("mem_count")
    5219                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_mem_count")
    5220                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    5221                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5222              $C$DW$600       .dwtag  DW_TAG_member
    5223                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$22)
    5224                      .dwattr $C$DW$600, DW_AT_name("answers")
    5225                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_answers")
    5226                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    5227                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5228              $C$DW$601       .dwtag  DW_TAG_member
    5229                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$22)
    5230                      .dwattr $C$DW$601, DW_AT_name("uStp")
    5231                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_uStp")
    5232                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    5233                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5234              $C$DW$602       .dwtag  DW_TAG_member
    5235                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$20)
    5236                      .dwattr $C$DW$602, DW_AT_name("nWords")
    5237                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_nWords")
    5238                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    5239                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5240              $C$DW$603       .dwtag  DW_TAG_member
    5241                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$8)
    5242                      .dwattr $C$DW$603, DW_AT_name("nS")
    5243                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_nS")
    5244                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    5245                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5246              $C$DW$604       .dwtag  DW_TAG_member
    5247                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$21)
    5248                      .dwattr $C$DW$604, DW_AT_name("cm_scr")
    5249                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_cm_scr")
    5250                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    5251                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5252              $C$DW$605       .dwtag  DW_TAG_member
    5253                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$8)
    5254                      .dwattr $C$DW$605, DW_AT_name("bNeedUpdate")
    5255                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_bNeedUpdate")
    5256                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    5257                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5258              $C$DW$606       .dwtag  DW_TAG_member
    5259                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$21)
    5260                      .dwattr $C$DW$606, DW_AT_name("cm_anti_scr")
    5261                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_cm_anti_scr")
    5262                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    5263                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5264              $C$DW$607       .dwtag  DW_TAG_member
    5265                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$12)
    5266                      .dwattr $C$DW$607, DW_AT_name("cm_fg_scr")
    5267                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_cm_fg_scr")
    5268                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    5269                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  122

    5270              $C$DW$608       .dwtag  DW_TAG_member
    5271                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$12)
    5272                      .dwattr $C$DW$608, DW_AT_name("cm_bk_scr")
    5273                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_cm_bk_scr")
    5274                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    5275                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5276              $C$DW$609       .dwtag  DW_TAG_member
    5277                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$8)
    5278                      .dwattr $C$DW$609, DW_AT_name("th_nbest")
    5279                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_th_nbest")
    5280                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    5281                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5282              $C$DW$610       .dwtag  DW_TAG_member
    5283                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$8)
    5284                      .dwattr $C$DW$610, DW_AT_name("nSpeech")
    5285                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_nSpeech")
    5286                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    5287                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5288              $C$DW$611       .dwtag  DW_TAG_member
    5289                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$8)
    5290                      .dwattr $C$DW$611, DW_AT_name("nNoise")
    5291                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_nNoise")
    5292                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    5293                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5294              $C$DW$612       .dwtag  DW_TAG_member
    5295                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$12)
    5296                      .dwattr $C$DW$612, DW_AT_name("speech_power")
    5297                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_speech_power")
    5298                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    5299                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5300              $C$DW$613       .dwtag  DW_TAG_member
    5301                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$12)
    5302                      .dwattr $C$DW$613, DW_AT_name("noise_power")
    5303                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_noise_power")
    5304                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    5305                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5306              $C$DW$614       .dwtag  DW_TAG_member
    5307                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$12)
    5308                      .dwattr $C$DW$614, DW_AT_name("noise_power_sqr")
    5309                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_noise_power_sqr")
    5310                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    5311                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5312              $C$DW$615       .dwtag  DW_TAG_member
    5313                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$8)
    5314                      .dwattr $C$DW$615, DW_AT_name("NSNR")
    5315                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_NSNR")
    5316                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    5317                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5318              $C$DW$616       .dwtag  DW_TAG_member
    5319                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$46)
    5320                      .dwattr $C$DW$616, DW_AT_name("H0")
    5321                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_H0")
    5322                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    5323                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5324              $C$DW$617       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  123

    5325                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$46)
    5326                      .dwattr $C$DW$617, DW_AT_name("H1")
    5327                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_H1")
    5328                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    5329                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5330              $C$DW$618       .dwtag  DW_TAG_member
    5331                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$21)
    5332                      .dwattr $C$DW$618, DW_AT_name("lgBeta")
    5333                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_lgBeta")
    5334                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    5335                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5336              $C$DW$619       .dwtag  DW_TAG_member
    5337                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$47)
    5338                      .dwattr $C$DW$619, DW_AT_name("acc_dif2_beta")
    5339                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_acc_dif2_beta")
    5340                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    5341                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5342              $C$DW$620       .dwtag  DW_TAG_member
    5343                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$8)
    5344                      .dwattr $C$DW$620, DW_AT_name("bCalced")
    5345                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_bCalced")
    5346                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    5347                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    5348              $C$DW$621       .dwtag  DW_TAG_member
    5349                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$21)
    5350                      .dwattr $C$DW$621, DW_AT_name("sCH")
    5351                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_sCH")
    5352                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    5353                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5354              $C$DW$622       .dwtag  DW_TAG_member
    5355                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$47)
    5356                      .dwattr $C$DW$622, DW_AT_name("lAccum")
    5357                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_lAccum")
    5358                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    5359                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    5360              $C$DW$623       .dwtag  DW_TAG_member
    5361                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$8)
    5362                      .dwattr $C$DW$623, DW_AT_name("adp_th")
    5363                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_adp_th")
    5364                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    5365                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5366                      .dwendtag $C$DW$T$48
    5367              
    5368              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    5369                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$48)
    5370                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    5371              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    5372                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    5373                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    5374              
    5375              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    5376                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    5377              $C$DW$624       .dwtag  DW_TAG_member
    5378                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$8)
    5379                      .dwattr $C$DW$624, DW_AT_name("tran")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  124

    5380                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_tran")
    5381                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5382                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5383              $C$DW$625       .dwtag  DW_TAG_member
    5384                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$27)
    5385                      .dwattr $C$DW$625, DW_AT_name("pdf_idx")
    5386                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_pdf_idx")
    5387                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5388                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5389                      .dwendtag $C$DW$T$49
    5390              
    5391              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("HmmType")
    5392                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$49)
    5393                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    5394              $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    5395                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    5396                      .dwattr $C$DW$T$119, DW_AT_address_class(0x17)
    5397              
    5398              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    5399                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x0c)
    5400              $C$DW$626       .dwtag  DW_TAG_member
    5401                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$10)
    5402                      .dwattr $C$DW$626, DW_AT_name("fd")
    5403                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_fd")
    5404                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5405                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5406              $C$DW$627       .dwtag  DW_TAG_member
    5407                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$50)
    5408                      .dwattr $C$DW$627, DW_AT_name("buf")
    5409                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_buf")
    5410                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5411                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5412              $C$DW$628       .dwtag  DW_TAG_member
    5413                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$50)
    5414                      .dwattr $C$DW$628, DW_AT_name("pos")
    5415                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_pos")
    5416                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5417                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5418              $C$DW$629       .dwtag  DW_TAG_member
    5419                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$50)
    5420                      .dwattr $C$DW$629, DW_AT_name("bufend")
    5421                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_bufend")
    5422                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5423                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5424              $C$DW$630       .dwtag  DW_TAG_member
    5425                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$50)
    5426                      .dwattr $C$DW$630, DW_AT_name("buff_stop")
    5427                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_buff_stop")
    5428                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5429                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5430              $C$DW$631       .dwtag  DW_TAG_member
    5431                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$11)
    5432                      .dwattr $C$DW$631, DW_AT_name("flags")
    5433                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_flags")
    5434                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  125

    5435                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5436                      .dwendtag $C$DW$T$51
    5437              
    5438              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    5439                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$51)
    5440                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    5441              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    5442                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    5443                      .dwattr $C$DW$T$121, DW_AT_address_class(0x17)
    5444              
    5445              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    5446                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x03)
    5447              $C$DW$632       .dwtag  DW_TAG_member
    5448                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$9)
    5449                      .dwattr $C$DW$632, DW_AT_name("hmm_code")
    5450                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_hmm_code")
    5451                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5452                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5453              $C$DW$633       .dwtag  DW_TAG_member
    5454                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$9)
    5455                      .dwattr $C$DW$633, DW_AT_name("n_next")
    5456                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_n_next")
    5457                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5458                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5459              $C$DW$634       .dwtag  DW_TAG_member
    5460                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$27)
    5461                      .dwattr $C$DW$634, DW_AT_name("next")
    5462                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_next")
    5463                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5464                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5465                      .dwendtag $C$DW$T$52
    5466              
    5467              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("SymType")
    5468                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$52)
    5469                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    5470              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    5471                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    5472                      .dwattr $C$DW$T$125, DW_AT_address_class(0x17)
    5473              
    5474              $C$DW$T$126     .dwtag  DW_TAG_enumeration_type
    5475                      .dwattr $C$DW$T$126, DW_AT_name("ObsType")
    5476                      .dwattr $C$DW$T$126, DW_AT_byte_size(0x01)
    5477              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("VITERBI"), DW_AT_const_value(0x00)
    5478              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("FULL"), DW_AT_const_value(0x01)
    5479              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("COMPONENT"), DW_AT_const_value(0x02)
    5480                      .dwendtag $C$DW$T$126
    5481              
    5482              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("ObsType")
    5483                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    5484                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    5485              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    5486                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    5487              $C$DW$T$4       .dwtag  DW_TAG_base_type
    5488                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    5489                      .dwattr $C$DW$T$4, DW_AT_name("bool")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  126

    5490                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    5491              $C$DW$T$5       .dwtag  DW_TAG_base_type
    5492                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    5493                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    5494                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    5495              $C$DW$T$6       .dwtag  DW_TAG_base_type
    5496                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5497                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    5498                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    5499              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    5500                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$6)
    5501                      .dwattr $C$DW$T$50, DW_AT_address_class(0x17)
    5502              $C$DW$T$7       .dwtag  DW_TAG_base_type
    5503                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    5504                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    5505                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    5506              $C$DW$T$8       .dwtag  DW_TAG_base_type
    5507                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    5508                      .dwattr $C$DW$T$8, DW_AT_name("short")
    5509                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    5510              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    5511                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$8)
    5512                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    5513              
    5514              $C$DW$T$39      .dwtag  DW_TAG_array_type
    5515                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
    5516                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    5517                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    5518              $C$DW$638       .dwtag  DW_TAG_subrange_type
    5519                      .dwattr $C$DW$638, DW_AT_upper_bound(0x1d)
    5520                      .dwendtag $C$DW$T$39
    5521              
    5522              
    5523              $C$DW$T$45      .dwtag  DW_TAG_array_type
    5524                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$8)
    5525                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    5526                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x514)
    5527              $C$DW$639       .dwtag  DW_TAG_subrange_type
    5528                      .dwattr $C$DW$639, DW_AT_upper_bound(0x513)
    5529                      .dwendtag $C$DW$T$45
    5530              
    5531              
    5532              $C$DW$T$54      .dwtag  DW_TAG_array_type
    5533                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$8)
    5534                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    5535                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x100)
    5536              $C$DW$640       .dwtag  DW_TAG_subrange_type
    5537                      .dwattr $C$DW$640, DW_AT_upper_bound(0xff)
    5538                      .dwendtag $C$DW$T$54
    5539              
    5540              
    5541              $C$DW$T$55      .dwtag  DW_TAG_array_type
    5542                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$8)
    5543                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    5544                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  127

    5545              $C$DW$641       .dwtag  DW_TAG_subrange_type
    5546                      .dwattr $C$DW$641, DW_AT_upper_bound(0x0f)
    5547                      .dwendtag $C$DW$T$55
    5548              
    5549              
    5550              $C$DW$T$56      .dwtag  DW_TAG_array_type
    5551                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$8)
    5552                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    5553                      .dwattr $C$DW$T$56, DW_AT_byte_size(0xe0)
    5554              $C$DW$642       .dwtag  DW_TAG_subrange_type
    5555                      .dwattr $C$DW$642, DW_AT_upper_bound(0x0d)
    5556              $C$DW$643       .dwtag  DW_TAG_subrange_type
    5557                      .dwattr $C$DW$643, DW_AT_upper_bound(0x0f)
    5558                      .dwendtag $C$DW$T$56
    5559              
    5560              $C$DW$644       .dwtag  DW_TAG_TI_far_type
    5561                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$8)
    5562              $C$DW$T$57      .dwtag  DW_TAG_const_type
    5563                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$644)
    5564              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    5565                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    5566                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
    5567              
    5568              $C$DW$T$59      .dwtag  DW_TAG_array_type
    5569                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    5570                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    5571                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x20)
    5572              $C$DW$645       .dwtag  DW_TAG_subrange_type
    5573                      .dwattr $C$DW$645, DW_AT_upper_bound(0x0f)
    5574                      .dwendtag $C$DW$T$59
    5575              
    5576              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    5577                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$58)
    5578                      .dwattr $C$DW$T$128, DW_AT_address_class(0x17)
    5579              
    5580              $C$DW$T$63      .dwtag  DW_TAG_array_type
    5581                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$8)
    5582                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5583                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x80)
    5584              $C$DW$646       .dwtag  DW_TAG_subrange_type
    5585                      .dwattr $C$DW$646, DW_AT_upper_bound(0x7f)
    5586                      .dwendtag $C$DW$T$63
    5587              
    5588              
    5589              $C$DW$T$64      .dwtag  DW_TAG_array_type
    5590                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$8)
    5591                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    5592                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x1a)
    5593              $C$DW$647       .dwtag  DW_TAG_subrange_type
    5594                      .dwattr $C$DW$647, DW_AT_upper_bound(0x19)
    5595                      .dwendtag $C$DW$T$64
    5596              
    5597              
    5598              $C$DW$T$82      .dwtag  DW_TAG_array_type
    5599                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  128

    5600                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    5601                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x20)
    5602              $C$DW$648       .dwtag  DW_TAG_subrange_type
    5603                      .dwattr $C$DW$648, DW_AT_upper_bound(0x1f)
    5604                      .dwendtag $C$DW$T$82
    5605              
    5606              
    5607              $C$DW$T$88      .dwtag  DW_TAG_array_type
    5608                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$8)
    5609                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    5610                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x14)
    5611              $C$DW$649       .dwtag  DW_TAG_subrange_type
    5612                      .dwattr $C$DW$649, DW_AT_upper_bound(0x13)
    5613                      .dwendtag $C$DW$T$88
    5614              
    5615              
    5616              $C$DW$T$167     .dwtag  DW_TAG_array_type
    5617                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$8)
    5618                      .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    5619                      .dwattr $C$DW$T$167, DW_AT_byte_size(0x3e8)
    5620              $C$DW$650       .dwtag  DW_TAG_subrange_type
    5621                      .dwattr $C$DW$650, DW_AT_upper_bound(0x3e7)
    5622                      .dwendtag $C$DW$T$167
    5623              
    5624              $C$DW$T$9       .dwtag  DW_TAG_base_type
    5625                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    5626                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    5627                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    5628              
    5629              $C$DW$T$27      .dwtag  DW_TAG_array_type
    5630                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    5631                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    5632                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5633              $C$DW$651       .dwtag  DW_TAG_subrange_type
    5634                      .dwattr $C$DW$651, DW_AT_upper_bound(0x00)
    5635                      .dwendtag $C$DW$T$27
    5636              
    5637              
    5638              $C$DW$T$33      .dwtag  DW_TAG_array_type
    5639                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    5640                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    5641                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    5642              $C$DW$652       .dwtag  DW_TAG_subrange_type
    5643                      .dwattr $C$DW$652, DW_AT_upper_bound(0x01)
    5644                      .dwendtag $C$DW$T$33
    5645              
    5646              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    5647                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    5648                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    5649              $C$DW$653       .dwtag  DW_TAG_TI_far_type
    5650                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$9)
    5651              $C$DW$T$131     .dwtag  DW_TAG_const_type
    5652                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$653)
    5653              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    5654                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  129

    5655                      .dwattr $C$DW$T$132, DW_AT_address_class(0x17)
    5656              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    5657                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    5658                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    5659              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    5660                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    5661                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    5662              
    5663              $C$DW$T$37      .dwtag  DW_TAG_array_type
    5664                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
    5665                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    5666                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    5667              $C$DW$654       .dwtag  DW_TAG_subrange_type
    5668                      .dwattr $C$DW$654, DW_AT_upper_bound(0x13)
    5669                      .dwendtag $C$DW$T$37
    5670              
    5671              
    5672              $C$DW$T$89      .dwtag  DW_TAG_array_type
    5673                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$20)
    5674                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    5675                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x02)
    5676              $C$DW$655       .dwtag  DW_TAG_subrange_type
    5677                      .dwattr $C$DW$655, DW_AT_upper_bound(0x01)
    5678                      .dwendtag $C$DW$T$89
    5679              
    5680              
    5681              $C$DW$T$172     .dwtag  DW_TAG_array_type
    5682                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$20)
    5683                      .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    5684                      .dwattr $C$DW$T$172, DW_AT_byte_size(0x01)
    5685              $C$DW$656       .dwtag  DW_TAG_subrange_type
    5686                      .dwattr $C$DW$656, DW_AT_upper_bound(0x00)
    5687                      .dwendtag $C$DW$T$172
    5688              
    5689              $C$DW$657       .dwtag  DW_TAG_TI_far_type
    5690                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$20)
    5691              $C$DW$T$147     .dwtag  DW_TAG_const_type
    5692                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$657)
    5693              $C$DW$T$10      .dwtag  DW_TAG_base_type
    5694                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    5695                      .dwattr $C$DW$T$10, DW_AT_name("int")
    5696                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    5697              $C$DW$T$11      .dwtag  DW_TAG_base_type
    5698                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    5699                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    5700                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    5701              $C$DW$T$12      .dwtag  DW_TAG_base_type
    5702                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    5703                      .dwattr $C$DW$T$12, DW_AT_name("long")
    5704                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    5705              $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("Int32")
    5706                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$12)
    5707                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    5708              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    5709                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  130

    5710                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    5711              
    5712              $C$DW$T$65      .dwtag  DW_TAG_array_type
    5713                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$12)
    5714                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    5715                      .dwattr $C$DW$T$65, DW_AT_byte_size(0xd0)
    5716              $C$DW$658       .dwtag  DW_TAG_subrange_type
    5717                      .dwattr $C$DW$658, DW_AT_upper_bound(0x67)
    5718                      .dwendtag $C$DW$T$65
    5719              
    5720              
    5721              $C$DW$T$68      .dwtag  DW_TAG_array_type
    5722                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$12)
    5723                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    5724                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x20)
    5725              $C$DW$659       .dwtag  DW_TAG_subrange_type
    5726                      .dwattr $C$DW$659, DW_AT_upper_bound(0x0f)
    5727                      .dwendtag $C$DW$T$68
    5728              
    5729              $C$DW$660       .dwtag  DW_TAG_TI_far_type
    5730                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$12)
    5731              $C$DW$T$184     .dwtag  DW_TAG_const_type
    5732                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$660)
    5733              
    5734              $C$DW$T$185     .dwtag  DW_TAG_array_type
    5735                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    5736                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    5737                      .dwattr $C$DW$T$185, DW_AT_byte_size(0x34)
    5738              $C$DW$661       .dwtag  DW_TAG_subrange_type
    5739                      .dwattr $C$DW$661, DW_AT_upper_bound(0x19)
    5740                      .dwendtag $C$DW$T$185
    5741              
    5742              
    5743              $C$DW$T$187     .dwtag  DW_TAG_array_type
    5744                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$12)
    5745                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    5746                      .dwattr $C$DW$T$187, DW_AT_byte_size(0x9c)
    5747              $C$DW$662       .dwtag  DW_TAG_subrange_type
    5748                      .dwattr $C$DW$662, DW_AT_upper_bound(0x4d)
    5749                      .dwendtag $C$DW$T$187
    5750              
    5751              $C$DW$T$13      .dwtag  DW_TAG_base_type
    5752                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5753                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    5754                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    5755              $C$DW$T$189     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    5756                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$13)
    5757                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    5758              $C$DW$T$14      .dwtag  DW_TAG_base_type
    5759                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    5760                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    5761                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    5762                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    5763                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    5764              $C$DW$T$15      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  131

    5765                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    5766                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    5767                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    5768                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    5769                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    5770              $C$DW$T$16      .dwtag  DW_TAG_base_type
    5771                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    5772                      .dwattr $C$DW$T$16, DW_AT_name("float")
    5773                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    5774              $C$DW$T$17      .dwtag  DW_TAG_base_type
    5775                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    5776                      .dwattr $C$DW$T$17, DW_AT_name("double")
    5777                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    5778              $C$DW$T$18      .dwtag  DW_TAG_base_type
    5779                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    5780                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    5781                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    5782              $C$DW$T$77      .dwtag  DW_TAG_base_type
    5783                      .dwattr $C$DW$T$77, DW_AT_encoding(DW_ATE_signed_char)
    5784                      .dwattr $C$DW$T$77, DW_AT_name("signed char")
    5785                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x01)
    5786              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    5787                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    5788                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    5789              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    5790                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$78)
    5791                      .dwattr $C$DW$T$81, DW_AT_address_class(0x17)
    5792              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    5793                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$77)
    5794              $C$DW$T$109     .dwtag  DW_TAG_const_type
    5795                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$663)
    5796              $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    5797                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    5798                      .dwattr $C$DW$T$110, DW_AT_address_class(0x17)
    5799              
    5800              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    5801                      .dwattr $C$DW$T$53, DW_AT_name("ele")
    5802                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x03)
    5803              $C$DW$664       .dwtag  DW_TAG_member
    5804                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$9)
    5805                      .dwattr $C$DW$664, DW_AT_name("sym")
    5806                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_sym")
    5807                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5808                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5809              $C$DW$665       .dwtag  DW_TAG_member
    5810                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$9)
    5811                      .dwattr $C$DW$665, DW_AT_name("idx_flag")
    5812                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_idx_flag")
    5813                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5814                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5815              $C$DW$666       .dwtag  DW_TAG_member
    5816                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$9)
    5817                      .dwattr $C$DW$666, DW_AT_name("next")
    5818                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_next")
    5819                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:23 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1618010                         PAGE  132

    5820                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5821                      .dwendtag $C$DW$T$53
    5822              
    5823              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    5824                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$53)
    5825                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    5826              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    5827                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    5828                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    5829              
    5830              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    5831                      .dwattr $C$DW$T$94, DW_AT_name("gmhmm_type")
    5832                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x7fe)
    5833              $C$DW$667       .dwtag  DW_TAG_member
    5834                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$20)
    5835                      .dwattr $C$DW$667, DW_AT_name("avedepth")
    5836                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_avedepth")
    5837                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5838                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5839              $C$DW$668       .dwtag  DW_TAG_member
    5840                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$20)
    5841                      .dwattr $C$DW$668, DW_AT_name("bestdepth")
    5842                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_bestdepth")
    5843                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5844                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5845              $C$DW$669       .dwtag  DW_TAG_member
    5846                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$20)
    5847                      .dwattr $C$DW$669, DW_AT_name("index_mean")
    5848                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_index_mean")
    5849                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5850                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5851              $C$DW$670       .dwtag  DW_TAG_member
    5852                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$20)
    5853                      .dwattr $C$DW$670, DW_AT_name("signal_cnt")
    5854                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_signal_cnt")
    5855                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5856                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5857              $C$DW$671       .dwtag  DW_TAG_member
    5858                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$8)
    5859                      .dwattr $C$DW$671, DW_AT_name("buf_idx")
    5860                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_buf_idx")
    5861                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
