TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE    1

    3020              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:24 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         000041 BF   
     778 000042 A51C          MOV *SP(#14), T1 ; |308| 
     779 000044 D31A          MPYM *SP(#13), T1, AC0 ; |308| 
         000046 05   
     780 000047 2209          MOV AC0, AR1 ; |308| 
     781 000049 ED6D          MOV dbl(*AR3(#1184)), XAR0
         00004b 8F04 
         00004d A0   
     782 00004e ED6D          MOV dbl(*AR3(#1182)), XAR2
         000050 AF04 
         000052 9E   
     783 000053 D31A          MPYM *SP(#13), T1, AC0 ; |308| 
         000055 05   
     784 000056 220B          MOV AC0, AR3 ; |308| 
     785 000058 ED14          MOV dbl(*SP(#10)), XAR4
         00005a CF   
     786 00005b 1490          AADD AR1, AR0 ; |308| 
         00005d 80   
     787 00005e ED14          MOV dbl(*SP(#10)), XAR1
         000060 9F   
     788 000061 14B0          AADD AR3, AR2 ; |308| 
         000063 A0   
     789 000064 ED14          MOV dbl(*SP(#10)), XAR3
         000066 BF   
     790 000067 3C14          MOV #1, T0
     791 000069 A58D          MOV *AR4(#277), T1 ; |308| 
         00006b 0115 
     792 00006d B42F          AMAR *+AR1(#866) ; |308| 
         00006f 0362 
     793 000071 B46F          AMAR *+AR3(#840) ; |308| 
         000073 0348 
     794 000075 AC8D          MOV *AR4(#279), AR4 ; |308| 
         000077 0117 
     795              $C$DW$68        .dwtag  DW_TAG_TI_branch
     796                      .dwattr $C$DW$68, DW_AT_low_pc(0x00)
     797                      .dwattr $C$DW$68, DW_AT_name("_pmc")
     798                      .dwattr $C$DW$68, DW_AT_TI_call
     799 000079 6C00          CALL #_pmc ; |308| 
         00007b 0000!
     800                                                      ; call occurs [#_pmc] ; |308| 
     801                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     802 00007d 4E11          AADD #17, SP
     803                      .dwcfi  cfa_offset, 1
     804              $C$DW$69        .dwtag  DW_TAG_TI_branch
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   19

     805                      .dwattr $C$DW$69, DW_AT_low_pc(0x00)
     806                      .dwattr $C$DW$69, DW_AT_TI_return
     807 00007f 4804          RET
     808                                                      ; return occurs
     809                      .dwattr $C$DW$60, DW_AT_TI_end_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL
     810                      .dwattr $C$DW$60, DW_AT_TI_end_line(0x138)
     811                      .dwattr $C$DW$60, DW_AT_TI_end_column(0x01)
     812                      .dwendentry
     813                      .dwendtag $C$DW$60
     814              
     815              ;******************************************************************************
     816              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     817              ;******************************************************************************
     818                      .global _cos_transform
     819                      .global _pmc
     820                      .global __divli
     821              
     822              ;*******************************************************************************
     823              ;* TYPE INFORMATION                                                            *
     824              ;*******************************************************************************
     825              
     826              $C$DW$T$91      .dwtag  DW_TAG_enumeration_type
     827                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
     828              $C$DW$70        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSuccess"), DW_AT_const_value(0x00)
     829              $C$DW$71        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACMemoryFail"), DW_AT_const_value(0x01)
     830              $C$DW$72        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACLoadFail"), DW_AT_const_value(0x02)
     831              $C$DW$73        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACReset"), DW_AT_const_value(0x03)
     832              $C$DW$74        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSaveFail"), DW_AT_const_value(0x04)
     833              $C$DW$75        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSBCInitFail"), DW_AT_const_value(0x05)
     834              $C$DW$76        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSBCLoadFail"), DW_AT_const_value(0x06)
     835              $C$DW$77        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSVAFail"), DW_AT_const_value(0x07)
     836              $C$DW$78        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACFail"), DW_AT_const_value(0x08)
     837              $C$DW$79        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACNoAlignment"), DW_AT_const_value(0x09)
     838              $C$DW$80        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACRJLoadFail"), DW_AT_const_value(0x0a)
     839                      .dwendtag $C$DW$T$91
     840              
     841              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineJACStatusType")
     842                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
     843                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
     844              
     845              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     846                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
     847              $C$DW$81        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$8)
     849                      .dwattr $C$DW$81, DW_AT_name("num")
     850                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_num")
     851                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$82        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$8)
     855                      .dwattr $C$DW$82, DW_AT_name("x1")
     856                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_x1")
     857                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     858                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$83        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   20

     860                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$8)
     861                      .dwattr $C$DW$83, DW_AT_name("x2")
     862                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_x2")
     863                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     864                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     865                      .dwendtag $C$DW$T$19
     866              
     867              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
     868                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
     870              $C$DW$84        .dwtag  DW_TAG_TI_far_type
     871                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$56)
     872              $C$DW$T$57      .dwtag  DW_TAG_const_type
     873                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$84)
     874              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
     875                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
     876                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
     877              
     878              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     879                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     880              $C$DW$85        .dwtag  DW_TAG_member
     881                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
     882                      .dwattr $C$DW$85, DW_AT_name("max_mem_usage")
     883                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_max_mem_usage")
     884                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     886              $C$DW$86        .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
     888                      .dwattr $C$DW$86, DW_AT_name("n_terminals")
     889                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_n_terminals")
     890                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     891                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     892              $C$DW$87        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
     894                      .dwattr $C$DW$87, DW_AT_name("n_monophones")
     895                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_n_monophones")
     896                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     897                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     898              $C$DW$88        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
     900                      .dwattr $C$DW$88, DW_AT_name("hlrTreeBase")
     901                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_hlrTreeBase")
     902                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     903                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     904              $C$DW$89        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$22)
     906                      .dwattr $C$DW$89, DW_AT_name("hlrTerminal")
     907                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_hlrTerminal")
     908                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     909                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     910              $C$DW$90        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
     912                      .dwattr $C$DW$90, DW_AT_name("pHMM2phone")
     913                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_pHMM2phone")
     914                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   21

     915                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     916              $C$DW$91        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
     918                      .dwattr $C$DW$91, DW_AT_name("hlrTransformIndex")
     919                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_hlrTransformIndex")
     920                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     921                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$92        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
     924                      .dwattr $C$DW$92, DW_AT_name("hlr_TRANSFORM_SIZE")
     925                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
     926                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     927                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$93        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
     930                      .dwattr $C$DW$93, DW_AT_name("hlrTransforms")
     931                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_hlrTransforms")
     932                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     933                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     934              $C$DW$94        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
     936                      .dwattr $C$DW$94, DW_AT_name("pSegStat_dif1")
     937                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_pSegStat_dif1")
     938                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     939                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     940              $C$DW$95        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
     942                      .dwattr $C$DW$95, DW_AT_name("pSegStat_dif2")
     943                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_pSegStat_dif2")
     944                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     945                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     946              $C$DW$96        .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
     948                      .dwattr $C$DW$96, DW_AT_name("pEnhanced")
     949                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_pEnhanced")
     950                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     951                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     952              $C$DW$97        .dwtag  DW_TAG_member
     953                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
     954                      .dwattr $C$DW$97, DW_AT_name("bk_node_cnt")
     955                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bk_node_cnt")
     956                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     957                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     958                      .dwendtag $C$DW$T$23
     959              
     960              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
     961                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$23)
     962                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     963              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
     964                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
     965                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
     966              
     967              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     968                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
     969              $C$DW$98        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   22

     970                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$9)
     971                      .dwattr $C$DW$98, DW_AT_name("sym_code")
     972                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_sym_code")
     973                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$99        .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$9)
     977                      .dwattr $C$DW$99, DW_AT_name("start_cell")
     978                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_start_cell")
     979                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     980                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     981              $C$DW$100       .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$9)
     983                      .dwattr $C$DW$100, DW_AT_name("depth")
     984                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_depth")
     985                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     986                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     987                      .dwendtag $C$DW$T$24
     988              
     989              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
     990                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$24)
     991                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     992              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
     993                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
     994                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
     995              
     996              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     997                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
     998              $C$DW$101       .dwtag  DW_TAG_member
     999                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$8)
    1000                      .dwattr $C$DW$101, DW_AT_name("scr")
    1001                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_scr")
    1002                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1004              $C$DW$102       .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$9)
    1006                      .dwattr $C$DW$102, DW_AT_name("sym")
    1007                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_sym")
    1008                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1009                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$103       .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$9)
    1012                      .dwattr $C$DW$103, DW_AT_name("frm")
    1013                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_frm")
    1014                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1015                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1016                      .dwendtag $C$DW$T$25
    1017              
    1018              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    1019                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$25)
    1020                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1021              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    1022                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1023                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    1024              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   23

    1025              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1026                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1027              $C$DW$104       .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$9)
    1029                      .dwattr $C$DW$104, DW_AT_name("frm")
    1030                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_frm")
    1031                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1032                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$105       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$9)
    1035                      .dwattr $C$DW$105, DW_AT_name("beam_idx")
    1036                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_beam_idx")
    1037                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1038                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1039                      .dwendtag $C$DW$T$26
    1040              
    1041              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    1042                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$26)
    1043                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1044              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    1045                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    1046                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    1047              
    1048              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1049                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    1050              $C$DW$106       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$9)
    1052                      .dwattr $C$DW$106, DW_AT_name("n_hmm")
    1053                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_n_hmm")
    1054                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1056              $C$DW$107       .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$9)
    1058                      .dwattr $C$DW$107, DW_AT_name("n_sym")
    1059                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_n_sym")
    1060                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1061                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1062              $C$DW$108       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$9)
    1064                      .dwattr $C$DW$108, DW_AT_name("n_word")
    1065                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_n_word")
    1066                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1067                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1068              $C$DW$109       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$9)
    1070                      .dwattr $C$DW$109, DW_AT_name("n_set")
    1071                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_n_set")
    1072                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1073                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1074              $C$DW$110       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$9)
    1076                      .dwattr $C$DW$110, DW_AT_name("n_hmm_set")
    1077                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_n_hmm_set")
    1078                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1079                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   24

    1080              $C$DW$111       .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$9)
    1082                      .dwattr $C$DW$111, DW_AT_name("start")
    1083                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_start")
    1084                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1085                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1086              $C$DW$112       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$9)
    1088                      .dwattr $C$DW$112, DW_AT_name("stop")
    1089                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_stop")
    1090                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1091                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1092              $C$DW$113       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$27)
    1094                      .dwattr $C$DW$113, DW_AT_name("symlist")
    1095                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_symlist")
    1096                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1097                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1098                      .dwendtag $C$DW$T$28
    1099              
    1100              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    1101                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    1102                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1103              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    1104                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    1105                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    1106              
    1107              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1108                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1109              $C$DW$114       .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$9)
    1111                      .dwattr $C$DW$114, DW_AT_name("high_pos")
    1112                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_high_pos")
    1113                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1114                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1115              $C$DW$115       .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$9)
    1117                      .dwattr $C$DW$115, DW_AT_name("cur_pos")
    1118                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_cur_pos")
    1119                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1120                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1121                      .dwendtag $C$DW$T$29
    1122              
    1123              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    1124                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1125                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1126              
    1127              $C$DW$T$31      .dwtag  DW_TAG_array_type
    1128                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1129                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1130                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1131              $C$DW$116       .dwtag  DW_TAG_subrange_type
    1132                      .dwattr $C$DW$116, DW_AT_upper_bound(0x01)
    1133                      .dwendtag $C$DW$T$31
    1134              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   25

    1135              
    1136              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1137                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    1138              $C$DW$117       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$30)
    1140                      .dwattr $C$DW$117, DW_AT_name("state")
    1141                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_state")
    1142                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1144              $C$DW$118       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$31)
    1146                      .dwattr $C$DW$118, DW_AT_name("sym")
    1147                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_sym")
    1148                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1149                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1150              $C$DW$119       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$30)
    1152                      .dwattr $C$DW$119, DW_AT_name("beam")
    1153                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_beam")
    1154                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1155                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$120       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$30)
    1158                      .dwattr $C$DW$120, DW_AT_name("time")
    1159                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_time")
    1160                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1161                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1162                      .dwendtag $C$DW$T$32
    1163              
    1164              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    1165                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$32)
    1166                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1167              
    1168              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1169                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
    1170              $C$DW$121       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    1172                      .dwattr $C$DW$121, DW_AT_name("cur_sym")
    1173                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_cur_sym")
    1174                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1175                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1176              $C$DW$122       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$9)
    1178                      .dwattr $C$DW$122, DW_AT_name("cur_state")
    1179                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_cur_state")
    1180                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1181                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1182                      .dwendtag $C$DW$T$34
    1183              
    1184              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    1185                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
    1186                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1187              
    1188              $C$DW$T$81      .dwtag  DW_TAG_array_type
    1189                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   26

    1190                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1191                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x06)
    1192              $C$DW$123       .dwtag  DW_TAG_subrange_type
    1193                      .dwattr $C$DW$123, DW_AT_upper_bound(0x01)
    1194                      .dwendtag $C$DW$T$81
    1195              
    1196              
    1197              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1198                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    1199              $C$DW$124       .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$9)
    1201                      .dwattr $C$DW$124, DW_AT_name("max_nbr_syms")
    1202                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_max_nbr_syms")
    1203                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1205              $C$DW$125       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$8)
    1207                      .dwattr $C$DW$125, DW_AT_name("nbr_syms")
    1208                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_nbr_syms")
    1209                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1210                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1211              $C$DW$126       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$21)
    1213                      .dwattr $C$DW$126, DW_AT_name("sym2pos")
    1214                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_sym2pos")
    1215                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1216                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1217              $C$DW$127       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$35)
    1219                      .dwattr $C$DW$127, DW_AT_name("syms")
    1220                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_syms")
    1221                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1222                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1223                      .dwendtag $C$DW$T$36
    1224              
    1225              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    1226                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
    1227                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1228              
    1229              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1230                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    1231              $C$DW$128       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$8)
    1233                      .dwattr $C$DW$128, DW_AT_name("scr")
    1234                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_scr")
    1235                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1237              $C$DW$129       .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$8)
    1239                      .dwattr $C$DW$129, DW_AT_name("n_ans")
    1240                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_n_ans")
    1241                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1242                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1243              $C$DW$130       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$37)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   27

    1245                      .dwattr $C$DW$130, DW_AT_name("answers")
    1246                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_answers")
    1247                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1248                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1249                      .dwendtag $C$DW$T$38
    1250              
    1251              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    1252                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
    1253                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1254              
    1255              $C$DW$T$41      .dwtag  DW_TAG_array_type
    1256                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1257                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1258                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
    1259              $C$DW$131       .dwtag  DW_TAG_subrange_type
    1260                      .dwattr $C$DW$131, DW_AT_upper_bound(0x1d)
    1261                      .dwendtag $C$DW$T$41
    1262              
    1263              
    1264              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1265                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
    1266              $C$DW$132       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$8)
    1268                      .dwattr $C$DW$132, DW_AT_name("n_bests")
    1269                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_n_bests")
    1270                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1272              $C$DW$133       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$39)
    1274                      .dwattr $C$DW$133, DW_AT_name("best_idx")
    1275                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_best_idx")
    1276                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1277                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$134       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$41)
    1280                      .dwattr $C$DW$134, DW_AT_name("elem")
    1281                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_elem")
    1282                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1283                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1284                      .dwendtag $C$DW$T$42
    1285              
    1286              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    1287                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
    1288                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1289              
    1290              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1291                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
    1292              $C$DW$135       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1294                      .dwattr $C$DW$135, DW_AT_name("alpha_p")
    1295                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_alpha_p")
    1296                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1298              $C$DW$136       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   28

    1300                      .dwattr $C$DW$136, DW_AT_name("sAlpha")
    1301                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_sAlpha")
    1302                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1303                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1304              $C$DW$137       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$8)
    1306                      .dwattr $C$DW$137, DW_AT_name("sBeta")
    1307                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_sBeta")
    1308                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1309                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1310              $C$DW$138       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$8)
    1312                      .dwattr $C$DW$138, DW_AT_name("lambdaLTEhigherE")
    1313                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    1314                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1315                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1316              $C$DW$139       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$8)
    1318                      .dwattr $C$DW$139, DW_AT_name("frm_count")
    1319                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_frm_count")
    1320                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1321                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1322              $C$DW$140       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1324                      .dwattr $C$DW$140, DW_AT_name("prob_sp")
    1325                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_prob_sp")
    1326                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1327                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1328              $C$DW$141       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
    1330                      .dwattr $C$DW$141, DW_AT_name("s_noise_floor")
    1331                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_s_noise_floor")
    1332                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1333                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$142       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    1336                      .dwattr $C$DW$142, DW_AT_name("snr")
    1337                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_snr")
    1338                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1339                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1340              $C$DW$143       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    1342                      .dwattr $C$DW$143, DW_AT_name("ps_long_term_noise")
    1343                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ps_long_term_noise")
    1344                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1345                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1346              $C$DW$144       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$8)
    1348                      .dwattr $C$DW$144, DW_AT_name("frmEn")
    1349                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_frmEn")
    1350                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1351                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1352              $C$DW$145       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$8)
    1354                      .dwattr $C$DW$145, DW_AT_name("meanEn")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   29

    1355                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_meanEn")
    1356                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1357                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1358              $C$DW$146       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$8)
    1360                      .dwattr $C$DW$146, DW_AT_name("prevMeanEn")
    1361                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_prevMeanEn")
    1362                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1363                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$147       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$8)
    1366                      .dwattr $C$DW$147, DW_AT_name("noiselvl")
    1367                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_noiselvl")
    1368                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1369                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$148       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$8)
    1372                      .dwattr $C$DW$148, DW_AT_name("lambdaLTE")
    1373                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_lambdaLTE")
    1374                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1375                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$149       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$8)
    1378                      .dwattr $C$DW$149, DW_AT_name("nbSpeechFrame")
    1379                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_nbSpeechFrame")
    1380                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1381                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1382              $C$DW$150       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$8)
    1384                      .dwattr $C$DW$150, DW_AT_name("hangOver")
    1385                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_hangOver")
    1386                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1387                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1388                      .dwendtag $C$DW$T$43
    1389              
    1390              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    1391                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$43)
    1392                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1393              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    1394                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1395                      .dwattr $C$DW$T$87, DW_AT_address_class(0x17)
    1396              
    1397              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1398                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
    1399              $C$DW$151       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$8)
    1401                      .dwattr $C$DW$151, DW_AT_name("mean")
    1402                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_mean")
    1403                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1405              $C$DW$152       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$8)
    1407                      .dwattr $C$DW$152, DW_AT_name("inv")
    1408                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_inv")
    1409                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   30

    1410                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1411              $C$DW$153       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$8)
    1413                      .dwattr $C$DW$153, DW_AT_name("gconst")
    1414                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_gconst")
    1415                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1416                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1417                      .dwendtag $C$DW$T$44
    1418              
    1419              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    1420                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    1421                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1422              
    1423              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1424                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
    1425              $C$DW$154       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$45)
    1427                      .dwattr $C$DW$154, DW_AT_name("base_mem")
    1428                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_base_mem")
    1429                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1431              $C$DW$155       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    1433                      .dwattr $C$DW$155, DW_AT_name("mem_count")
    1434                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_mem_count")
    1435                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    1436                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1437              $C$DW$156       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$22)
    1439                      .dwattr $C$DW$156, DW_AT_name("answers")
    1440                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_answers")
    1441                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    1442                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1443              $C$DW$157       .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
    1445                      .dwattr $C$DW$157, DW_AT_name("uStp")
    1446                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_uStp")
    1447                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    1448                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1449              $C$DW$158       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    1451                      .dwattr $C$DW$158, DW_AT_name("nWords")
    1452                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_nWords")
    1453                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    1454                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1455              $C$DW$159       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$8)
    1457                      .dwattr $C$DW$159, DW_AT_name("nS")
    1458                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_nS")
    1459                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    1460                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1461              $C$DW$160       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    1463                      .dwattr $C$DW$160, DW_AT_name("cm_scr")
    1464                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_cm_scr")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   31

    1465                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    1466                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1467              $C$DW$161       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$8)
    1469                      .dwattr $C$DW$161, DW_AT_name("bNeedUpdate")
    1470                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bNeedUpdate")
    1471                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    1472                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1473              $C$DW$162       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    1475                      .dwattr $C$DW$162, DW_AT_name("cm_anti_scr")
    1476                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_cm_anti_scr")
    1477                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    1478                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1479              $C$DW$163       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$12)
    1481                      .dwattr $C$DW$163, DW_AT_name("cm_fg_scr")
    1482                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_cm_fg_scr")
    1483                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    1484                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1485              $C$DW$164       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$12)
    1487                      .dwattr $C$DW$164, DW_AT_name("cm_bk_scr")
    1488                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_cm_bk_scr")
    1489                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    1490                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$165       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$8)
    1493                      .dwattr $C$DW$165, DW_AT_name("th_nbest")
    1494                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_th_nbest")
    1495                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    1496                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$166       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$8)
    1499                      .dwattr $C$DW$166, DW_AT_name("nSpeech")
    1500                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_nSpeech")
    1501                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    1502                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$167       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$8)
    1505                      .dwattr $C$DW$167, DW_AT_name("nNoise")
    1506                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_nNoise")
    1507                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    1508                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$168       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$12)
    1511                      .dwattr $C$DW$168, DW_AT_name("speech_power")
    1512                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_speech_power")
    1513                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    1514                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1515              $C$DW$169       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$12)
    1517                      .dwattr $C$DW$169, DW_AT_name("noise_power")
    1518                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_noise_power")
    1519                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   32

    1520                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$170       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$12)
    1523                      .dwattr $C$DW$170, DW_AT_name("noise_power_sqr")
    1524                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_noise_power_sqr")
    1525                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    1526                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1527              $C$DW$171       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$8)
    1529                      .dwattr $C$DW$171, DW_AT_name("NSNR")
    1530                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_NSNR")
    1531                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    1532                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1533              $C$DW$172       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$46)
    1535                      .dwattr $C$DW$172, DW_AT_name("H0")
    1536                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_H0")
    1537                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    1538                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$173       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$46)
    1541                      .dwattr $C$DW$173, DW_AT_name("H1")
    1542                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_H1")
    1543                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    1544                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$174       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    1547                      .dwattr $C$DW$174, DW_AT_name("lgBeta")
    1548                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_lgBeta")
    1549                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    1550                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1551              $C$DW$175       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$47)
    1553                      .dwattr $C$DW$175, DW_AT_name("acc_dif2_beta")
    1554                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_acc_dif2_beta")
    1555                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    1556                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1557              $C$DW$176       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$8)
    1559                      .dwattr $C$DW$176, DW_AT_name("bCalced")
    1560                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bCalced")
    1561                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    1562                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1563              $C$DW$177       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    1565                      .dwattr $C$DW$177, DW_AT_name("sCH")
    1566                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_sCH")
    1567                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    1568                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1569              $C$DW$178       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$47)
    1571                      .dwattr $C$DW$178, DW_AT_name("lAccum")
    1572                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_lAccum")
    1573                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    1574                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   33

    1575              $C$DW$179       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$8)
    1577                      .dwattr $C$DW$179, DW_AT_name("adp_th")
    1578                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_adp_th")
    1579                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    1580                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1581                      .dwendtag $C$DW$T$48
    1582              
    1583              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    1584                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$48)
    1585                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1586              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    1587                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1588                      .dwattr $C$DW$T$89, DW_AT_address_class(0x17)
    1589              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1590                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1591                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1592                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1593              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1594                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1595                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1596                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1597              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1598                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1599                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1600                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1601              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1602                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1603                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1604                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1605              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1606                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1607                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1608                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1609              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    1610                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$8)
    1611                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    1612              
    1613              $C$DW$T$39      .dwtag  DW_TAG_array_type
    1614                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
    1615                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1616                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    1617              $C$DW$180       .dwtag  DW_TAG_subrange_type
    1618                      .dwattr $C$DW$180, DW_AT_upper_bound(0x1d)
    1619                      .dwendtag $C$DW$T$39
    1620              
    1621              
    1622              $C$DW$T$45      .dwtag  DW_TAG_array_type
    1623                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$8)
    1624                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1625                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x514)
    1626              $C$DW$181       .dwtag  DW_TAG_subrange_type
    1627                      .dwattr $C$DW$181, DW_AT_upper_bound(0x513)
    1628                      .dwendtag $C$DW$T$45
    1629              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   34

    1630              
    1631              $C$DW$T$50      .dwtag  DW_TAG_array_type
    1632                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$8)
    1633                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1634                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x100)
    1635              $C$DW$182       .dwtag  DW_TAG_subrange_type
    1636                      .dwattr $C$DW$182, DW_AT_upper_bound(0xff)
    1637                      .dwendtag $C$DW$T$50
    1638              
    1639              
    1640              $C$DW$T$51      .dwtag  DW_TAG_array_type
    1641                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    1642                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1643                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    1644              $C$DW$183       .dwtag  DW_TAG_subrange_type
    1645                      .dwattr $C$DW$183, DW_AT_upper_bound(0x0f)
    1646                      .dwendtag $C$DW$T$51
    1647              
    1648              
    1649              $C$DW$T$52      .dwtag  DW_TAG_array_type
    1650                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    1651                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1652                      .dwattr $C$DW$T$52, DW_AT_byte_size(0xe0)
    1653              $C$DW$184       .dwtag  DW_TAG_subrange_type
    1654                      .dwattr $C$DW$184, DW_AT_upper_bound(0x0d)
    1655              $C$DW$185       .dwtag  DW_TAG_subrange_type
    1656                      .dwattr $C$DW$185, DW_AT_upper_bound(0x0f)
    1657                      .dwendtag $C$DW$T$52
    1658              
    1659              $C$DW$186       .dwtag  DW_TAG_TI_far_type
    1660                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$8)
    1661              $C$DW$T$53      .dwtag  DW_TAG_const_type
    1662                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$186)
    1663              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    1664                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1665                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    1666              
    1667              $C$DW$T$55      .dwtag  DW_TAG_array_type
    1668                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1669                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1670                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x20)
    1671              $C$DW$187       .dwtag  DW_TAG_subrange_type
    1672                      .dwattr $C$DW$187, DW_AT_upper_bound(0x0f)
    1673                      .dwendtag $C$DW$T$55
    1674              
    1675              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    1676                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$54)
    1677                      .dwattr $C$DW$T$96, DW_AT_address_class(0x17)
    1678              
    1679              $C$DW$T$59      .dwtag  DW_TAG_array_type
    1680                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$8)
    1681                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1682                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x80)
    1683              $C$DW$188       .dwtag  DW_TAG_subrange_type
    1684                      .dwattr $C$DW$188, DW_AT_upper_bound(0x7f)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   35

    1685                      .dwendtag $C$DW$T$59
    1686              
    1687              
    1688              $C$DW$T$60      .dwtag  DW_TAG_array_type
    1689                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    1690                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1691                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x1a)
    1692              $C$DW$189       .dwtag  DW_TAG_subrange_type
    1693                      .dwattr $C$DW$189, DW_AT_upper_bound(0x19)
    1694                      .dwendtag $C$DW$T$60
    1695              
    1696              
    1697              $C$DW$T$78      .dwtag  DW_TAG_array_type
    1698                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$8)
    1699                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1700                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x20)
    1701              $C$DW$190       .dwtag  DW_TAG_subrange_type
    1702                      .dwattr $C$DW$190, DW_AT_upper_bound(0x1f)
    1703                      .dwendtag $C$DW$T$78
    1704              
    1705              
    1706              $C$DW$T$84      .dwtag  DW_TAG_array_type
    1707                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$8)
    1708                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1709                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x14)
    1710              $C$DW$191       .dwtag  DW_TAG_subrange_type
    1711                      .dwattr $C$DW$191, DW_AT_upper_bound(0x13)
    1712                      .dwendtag $C$DW$T$84
    1713              
    1714              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1715                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1716                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1717                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1718              
    1719              $C$DW$T$27      .dwtag  DW_TAG_array_type
    1720                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    1721                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1722                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1723              $C$DW$192       .dwtag  DW_TAG_subrange_type
    1724                      .dwattr $C$DW$192, DW_AT_upper_bound(0x00)
    1725                      .dwendtag $C$DW$T$27
    1726              
    1727              
    1728              $C$DW$T$33      .dwtag  DW_TAG_array_type
    1729                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    1730                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1731                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1732              $C$DW$193       .dwtag  DW_TAG_subrange_type
    1733                      .dwattr $C$DW$193, DW_AT_upper_bound(0x01)
    1734                      .dwendtag $C$DW$T$33
    1735              
    1736              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1737                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    1738                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1739              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   36

    1740                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    1741                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1742              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    1743                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    1744                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    1745              
    1746              $C$DW$T$37      .dwtag  DW_TAG_array_type
    1747                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
    1748                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1749                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    1750              $C$DW$194       .dwtag  DW_TAG_subrange_type
    1751                      .dwattr $C$DW$194, DW_AT_upper_bound(0x13)
    1752                      .dwendtag $C$DW$T$37
    1753              
    1754              
    1755              $C$DW$T$85      .dwtag  DW_TAG_array_type
    1756                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
    1757                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1758                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    1759              $C$DW$195       .dwtag  DW_TAG_subrange_type
    1760                      .dwattr $C$DW$195, DW_AT_upper_bound(0x01)
    1761                      .dwendtag $C$DW$T$85
    1762              
    1763              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1764                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1765                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1766                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1767              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1768                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1769                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1770                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1771              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1772                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1773                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1774                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1775              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1776                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
    1777                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    1778              
    1779              $C$DW$T$61      .dwtag  DW_TAG_array_type
    1780                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$12)
    1781                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1782                      .dwattr $C$DW$T$61, DW_AT_byte_size(0xd0)
    1783              $C$DW$196       .dwtag  DW_TAG_subrange_type
    1784                      .dwattr $C$DW$196, DW_AT_upper_bound(0x67)
    1785                      .dwendtag $C$DW$T$61
    1786              
    1787              
    1788              $C$DW$T$64      .dwtag  DW_TAG_array_type
    1789                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
    1790                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1791                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x20)
    1792              $C$DW$197       .dwtag  DW_TAG_subrange_type
    1793                      .dwattr $C$DW$197, DW_AT_upper_bound(0x0f)
    1794                      .dwendtag $C$DW$T$64
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   37

    1795              
    1796              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1797                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1798                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1799                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1800              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1801                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1802                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1803                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1804                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1805                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1806              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1807                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1808                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1809                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1810                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1811                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1812              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1813                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1814                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1815                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1816              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1817                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1818                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1819                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1820              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1821                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1822                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1823                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1824              $C$DW$T$73      .dwtag  DW_TAG_base_type
    1825                      .dwattr $C$DW$T$73, DW_AT_encoding(DW_ATE_signed_char)
    1826                      .dwattr $C$DW$T$73, DW_AT_name("signed char")
    1827                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    1828              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    1829                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1830                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    1831              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    1832                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$74)
    1833                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    1834              
    1835              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1836                      .dwattr $C$DW$T$49, DW_AT_name("ele")
    1837                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x03)
    1838              $C$DW$198       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$9)
    1840                      .dwattr $C$DW$198, DW_AT_name("sym")
    1841                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_sym")
    1842                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1843                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1844              $C$DW$199       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$9)
    1846                      .dwattr $C$DW$199, DW_AT_name("idx_flag")
    1847                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_idx_flag")
    1848                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1849                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   38

    1850              $C$DW$200       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$9)
    1852                      .dwattr $C$DW$200, DW_AT_name("next")
    1853                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_next")
    1854                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1855                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1856                      .dwendtag $C$DW$T$49
    1857              
    1858              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    1859                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$49)
    1860                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1861              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    1862                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    1863                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    1864              
    1865              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    1866                      .dwattr $C$DW$T$90, DW_AT_name("gmhmm_type")
    1867                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x7fe)
    1868              $C$DW$201       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    1870                      .dwattr $C$DW$201, DW_AT_name("avedepth")
    1871                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_avedepth")
    1872                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1873                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1874              $C$DW$202       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    1876                      .dwattr $C$DW$202, DW_AT_name("bestdepth")
    1877                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bestdepth")
    1878                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1879                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1880              $C$DW$203       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    1882                      .dwattr $C$DW$203, DW_AT_name("index_mean")
    1883                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_index_mean")
    1884                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1885                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1886              $C$DW$204       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    1888                      .dwattr $C$DW$204, DW_AT_name("signal_cnt")
    1889                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_signal_cnt")
    1890                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1891                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1892              $C$DW$205       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$8)
    1894                      .dwattr $C$DW$205, DW_AT_name("buf_idx")
    1895                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_buf_idx")
    1896                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1897                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1898              $C$DW$206       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
    1900                      .dwattr $C$DW$206, DW_AT_name("speech_detected")
    1901                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_speech_detected")
    1902                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1903                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1904              $C$DW$207       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   39

    1905                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    1906                      .dwattr $C$DW$207, DW_AT_name("mfcc_cnt")
    1907                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_mfcc_cnt")
    1908                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1909                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1910              $C$DW$208       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    1912                      .dwattr $C$DW$208, DW_AT_name("nbr_cpy")
    1913                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_nbr_cpy")
    1914                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1915                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1916              $C$DW$209       .dwtag  DW_TAG_member
    1917                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$8)
    1918                      .dwattr $C$DW$209, DW_AT_name("last_sig")
    1919                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_last_sig")
    1920                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1921                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1922              $C$DW$210       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$50)
    1924                      .dwattr $C$DW$210, DW_AT_name("sample_signal")
    1925                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_sample_signal")
    1926                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1927                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1928              $C$DW$211       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$8)
    1930                      .dwattr $C$DW$211, DW_AT_name("amplitude_max")
    1931                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_amplitude_max")
    1932                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    1933                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1934              $C$DW$212       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$8)
    1936                      .dwattr $C$DW$212, DW_AT_name("amplitude_min")
    1937                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_amplitude_min")
    1938                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    1939                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1940              $C$DW$213       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$8)
    1942                      .dwattr $C$DW$213, DW_AT_name("pred_first_frame")
    1943                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_pred_first_frame")
    1944                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    1945                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1946              $C$DW$214       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$8)
    1948                      .dwattr $C$DW$214, DW_AT_name("frm_cnt")
    1949                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_frm_cnt")
    1950                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    1951                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1952              $C$DW$215       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$8)
    1954                      .dwattr $C$DW$215, DW_AT_name("beam_count")
    1955                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_beam_count")
    1956                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    1957                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1958              $C$DW$216       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   40

    1960                      .dwattr $C$DW$216, DW_AT_name("active_beam_cells")
    1961                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_active_beam_cells")
    1962                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    1963                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1964              $C$DW$217       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$8)
    1966                      .dwattr $C$DW$217, DW_AT_name("active_time_cells")
    1967                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_active_time_cells")
    1968                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    1969                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1970              $C$DW$218       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$9)
    1972                      .dwattr $C$DW$218, DW_AT_name("ending_sym_count")
    1973                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_ending_sym_count")
    1974                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1975                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1976              $C$DW$219       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$8)
    1978                      .dwattr $C$DW$219, DW_AT_name("comp_type")
    1979                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_comp_type")
    1980                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    1981                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1982              $C$DW$220       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$9)
    1984                      .dwattr $C$DW$220, DW_AT_name("low_vol_limit")
    1985                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_low_vol_limit")
    1986                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    1987                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1988              $C$DW$221       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$9)
    1990                      .dwattr $C$DW$221, DW_AT_name("high_vol_limit")
    1991                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_high_vol_limit")
    1992                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
    1993                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1994              $C$DW$222       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$8)
    1996                      .dwattr $C$DW$222, DW_AT_name("vol")
    1997                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_vol")
    1998                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1999                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2000              $C$DW$223       .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    2002                      .dwattr $C$DW$223, DW_AT_name("n_mfcc")
    2003                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_n_mfcc")
    2004                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    2005                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2006              $C$DW$224       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$8)
    2008                      .dwattr $C$DW$224, DW_AT_name("nbr_dim")
    2009                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_nbr_dim")
    2010                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    2011                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2012              $C$DW$225       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    2014                      .dwattr $C$DW$225, DW_AT_name("n_filter")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:25 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1118011                         PAGE   41

    2015                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_n_filter")
    2016                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    2017                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2018              $C$DW$226       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$52)
    2020                      .dwattr $C$DW$226, DW_AT_name("mfcc_buf")
    2021                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_mfcc_buf")
    2022                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2023                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2024              $C$DW$227       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$51)
    2026                      .dwattr $C$DW$227, DW_AT_name("mfcc_mean")
    2027                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_mfcc_mean")
    2028                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f8]
    2029                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2030              $C$DW$228       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$55)
    2032                      .dwattr $C$DW$228, DW_AT_name("cosxfm")
    2033                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_cosxfm")
    2034                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    2035                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2036              $C$DW$229       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$58)
    2038                      .dwattr $C$DW$229, DW_AT_name("mel_filter")
    2039                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_mel_filter")
    2040                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
    2041                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2042              $C$DW$230       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$8)
    2044                      .dwattr $C$DW$230, DW_AT_name("th_noise_flr")
    2045                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_th_noise_flr")
    2046                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x22a]
    2047                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$231       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$8)
    2050                      .dwattr $C$DW$231, DW_AT_name("th_speech_delta")
    2051                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_th_speech_delta")
    2052                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x22b]
    2053                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2054              $C$DW$232       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$8)
