TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE    1

    3452              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:26 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1200              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureDimensionFail"), DW_AT_const_value(
    1201              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSegmentSizeCheckFail"), DW_AT_const_value(
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   30

    1202              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelFileFail"), DW_AT_const_value(0x1c4)
    1203              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSaveFail"), DW_AT_const_value(0x1c5)
    1204              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineEnrollLoadFail"), DW_AT_const_value(0x1c6)
    1205              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackgoundCreationFail"), DW_AT_const_value
    1206              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineStateMemoryOut"), DW_AT_const_value(0x1f4)
    1207              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSearchMemoryOut"), DW_AT_const_value(0x1f5
    1208              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelMemorySize"), DW_AT_const_value(0x258
    1209              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureMemorySize"), DW_AT_const_value(0x2
    1210              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineNetworkMemorySize"), DW_AT_const_value(0x2
    1211              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelSize"), DW_AT_const_value(0x25b)
    1212              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackTrackMemorySize"), DW_AT_const_value(0
    1213              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineCMMemorySize"), DW_AT_const_value(0x25d)
    1214              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineVALTreeMemorySize"), DW_AT_const_value(0x2
    1215              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSym2PosMapSize"), DW_AT_const_value(0x25f)
    1216              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineShortUtterance"), DW_AT_const_value(0x2bc)
    1217              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadHMM2Phone"), DW_AT_const_value(0x320)
    1218              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNoSilencePhone"), DW_AT_const_value(0x321)
    1219              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhone2Voicing"), DW_AT_const_value(0x322)
    1220              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhoneDuration"), DW_AT_const_value(0x323)
    1221              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMismatch"), DW_AT_const_value(0x324)
    1222              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMissWord"), DW_AT_const_value(0x325)
    1223              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneDuration"), DW_AT_const_value(0x326)
    1224              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneWord"), DW_AT_const_value(0x327)
    1225              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveTTSMean"), DW_AT_const_value(0x328)
    1226              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveVoicing"), DW_AT_const_value(0x329)
    1227              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveDuration"), DW_AT_const_value(0x32a)
    1228              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSTTS"), DW_AT_const_value(0x32b)
    1229              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneList"), DW_AT_const_value(0x32c)
    1230              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumPhones"), DW_AT_const_value(0x32d)
    1231              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumWords"), DW_AT_const_value(0x32e)
    1232              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputFile"), DW_AT_const_value(0x32f)
    1233              $C$DW$177       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputMFCC"), DW_AT_const_value(0x330)
    1234              $C$DW$178       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputDuration"), DW_AT_const_value(0x331)
    1235              $C$DW$179       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputVoicing"), DW_AT_const_value(0x332)
    1236              $C$DW$180       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNotFound"), DW_AT_const_value(0x333)
    1237              $C$DW$181       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputMeanSize"), DW_AT_const_value(0x334)
    1238              $C$DW$182       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutput"), DW_AT_const_value(0x335)
    1239                      .dwendtag $C$DW$T$98
    1240              
    1241              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineStatusType")
    1242                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    1243                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1244              
    1245              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1246                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
    1247              $C$DW$183       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$8)
    1249                      .dwattr $C$DW$183, DW_AT_name("num")
    1250                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_num")
    1251                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1253              $C$DW$184       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$8)
    1255                      .dwattr $C$DW$184, DW_AT_name("x1")
    1256                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_x1")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   31

    1257                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1258                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1259              $C$DW$185       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$8)
    1261                      .dwattr $C$DW$185, DW_AT_name("x2")
    1262                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_x2")
    1263                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1264                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1265                      .dwendtag $C$DW$T$19
    1266              
    1267              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    1268                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1270              $C$DW$186       .dwtag  DW_TAG_TI_far_type
    1271                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$57)
    1272              $C$DW$T$58      .dwtag  DW_TAG_const_type
    1273                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$186)
    1274              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1275                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1276                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    1277              
    1278              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1279                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x03)
    1280              $C$DW$187       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$8)
    1282                      .dwattr $C$DW$187, DW_AT_name("norm0")
    1283                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_norm0")
    1284                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1286              $C$DW$188       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$8)
    1288                      .dwattr $C$DW$188, DW_AT_name("norm1")
    1289                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_norm1")
    1290                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1291                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$189       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$8)
    1294                      .dwattr $C$DW$189, DW_AT_name("norm2")
    1295                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_norm2")
    1296                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1297                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1298                      .dwendtag $C$DW$T$20
    1299              
    1300              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("NormType")
    1301                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$20)
    1302                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    1303              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    1304                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    1305                      .dwattr $C$DW$T$104, DW_AT_address_class(0x17)
    1306              
    1307              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1308                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    1309              $C$DW$190       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    1311                      .dwattr $C$DW$190, DW_AT_name("max_mem_usage")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   32

    1312                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_max_mem_usage")
    1313                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$191       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$21)
    1317                      .dwattr $C$DW$191, DW_AT_name("n_terminals")
    1318                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_n_terminals")
    1319                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1320                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1321              $C$DW$192       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    1323                      .dwattr $C$DW$192, DW_AT_name("n_monophones")
    1324                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_n_monophones")
    1325                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1326                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$193       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    1329                      .dwattr $C$DW$193, DW_AT_name("hlrTreeBase")
    1330                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_hlrTreeBase")
    1331                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1332                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$194       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$23)
    1335                      .dwattr $C$DW$194, DW_AT_name("hlrTerminal")
    1336                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_hlrTerminal")
    1337                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1338                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1339              $C$DW$195       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    1341                      .dwattr $C$DW$195, DW_AT_name("pHMM2phone")
    1342                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_pHMM2phone")
    1343                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1344                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$196       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$23)
    1347                      .dwattr $C$DW$196, DW_AT_name("hlrTransformIndex")
    1348                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_hlrTransformIndex")
    1349                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1350                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1351              $C$DW$197       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    1353                      .dwattr $C$DW$197, DW_AT_name("hlr_TRANSFORM_SIZE")
    1354                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    1355                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1356                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1357              $C$DW$198       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    1359                      .dwattr $C$DW$198, DW_AT_name("hlrTransforms")
    1360                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_hlrTransforms")
    1361                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1362                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1363              $C$DW$199       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
    1365                      .dwattr $C$DW$199, DW_AT_name("pSegStat_dif1")
    1366                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_pSegStat_dif1")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   33

    1367                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1368                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1369              $C$DW$200       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$22)
    1371                      .dwattr $C$DW$200, DW_AT_name("pSegStat_dif2")
    1372                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_pSegStat_dif2")
    1373                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1374                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1375              $C$DW$201       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    1377                      .dwattr $C$DW$201, DW_AT_name("pEnhanced")
    1378                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_pEnhanced")
    1379                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1380                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$202       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    1383                      .dwattr $C$DW$202, DW_AT_name("bk_node_cnt")
    1384                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bk_node_cnt")
    1385                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1386                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1387                      .dwendtag $C$DW$T$24
    1388              
    1389              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    1390                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$24)
    1391                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1392              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    1393                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1394                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    1395              
    1396              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1397                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    1398              $C$DW$203       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$9)
    1400                      .dwattr $C$DW$203, DW_AT_name("sym_code")
    1401                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_sym_code")
    1402                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1404              $C$DW$204       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$9)
    1406                      .dwattr $C$DW$204, DW_AT_name("start_cell")
    1407                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_start_cell")
    1408                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1409                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1410              $C$DW$205       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$9)
    1412                      .dwattr $C$DW$205, DW_AT_name("depth")
    1413                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_depth")
    1414                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1415                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1416                      .dwendtag $C$DW$T$25
    1417              
    1418              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    1419                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$25)
    1420                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1421              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   34

    1422                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    1423                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
    1424              
    1425              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1426                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x03)
    1427              $C$DW$206       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$8)
    1429                      .dwattr $C$DW$206, DW_AT_name("scr")
    1430                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_scr")
    1431                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1432                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1433              $C$DW$207       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$9)
    1435                      .dwattr $C$DW$207, DW_AT_name("sym")
    1436                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_sym")
    1437                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1438                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1439              $C$DW$208       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$9)
    1441                      .dwattr $C$DW$208, DW_AT_name("frm")
    1442                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_frm")
    1443                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1444                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1445                      .dwendtag $C$DW$T$26
    1446              
    1447              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    1448                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$26)
    1449                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1450              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    1451                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1452                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
    1453              
    1454              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1455                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1456              $C$DW$209       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$9)
    1458                      .dwattr $C$DW$209, DW_AT_name("frm")
    1459                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_frm")
    1460                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$210       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$9)
    1464                      .dwattr $C$DW$210, DW_AT_name("beam_idx")
    1465                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_beam_idx")
    1466                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1467                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1468                      .dwendtag $C$DW$T$27
    1469              
    1470              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    1471                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$27)
    1472                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1473              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    1474                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1475                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    1476              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   35

    1477              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1478                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    1479              $C$DW$211       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$9)
    1481                      .dwattr $C$DW$211, DW_AT_name("n_hmm")
    1482                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_n_hmm")
    1483                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1484                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1485              $C$DW$212       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$9)
    1487                      .dwattr $C$DW$212, DW_AT_name("n_sym")
    1488                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_n_sym")
    1489                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1490                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$213       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$9)
    1493                      .dwattr $C$DW$213, DW_AT_name("n_word")
    1494                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_n_word")
    1495                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1496                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$214       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$9)
    1499                      .dwattr $C$DW$214, DW_AT_name("n_set")
    1500                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_n_set")
    1501                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1502                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$215       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$9)
    1505                      .dwattr $C$DW$215, DW_AT_name("n_hmm_set")
    1506                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_n_hmm_set")
    1507                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1508                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$216       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$9)
    1511                      .dwattr $C$DW$216, DW_AT_name("start")
    1512                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_start")
    1513                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1514                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1515              $C$DW$217       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$9)
    1517                      .dwattr $C$DW$217, DW_AT_name("stop")
    1518                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_stop")
    1519                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1520                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$218       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$28)
    1523                      .dwattr $C$DW$218, DW_AT_name("symlist")
    1524                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_symlist")
    1525                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1526                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1527                      .dwendtag $C$DW$T$29
    1528              
    1529              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    1530                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$29)
    1531                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   36

    1532              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    1533                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    1534                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    1535              
    1536              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1537                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1538              $C$DW$219       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$9)
    1540                      .dwattr $C$DW$219, DW_AT_name("high_pos")
    1541                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_high_pos")
    1542                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1543                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1544              $C$DW$220       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$9)
    1546                      .dwattr $C$DW$220, DW_AT_name("cur_pos")
    1547                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_cur_pos")
    1548                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1549                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1550                      .dwendtag $C$DW$T$30
    1551              
    1552              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    1553                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1554                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1555              
    1556              $C$DW$T$32      .dwtag  DW_TAG_array_type
    1557                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1558                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1559                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    1560              $C$DW$221       .dwtag  DW_TAG_subrange_type
    1561                      .dwattr $C$DW$221, DW_AT_upper_bound(0x01)
    1562                      .dwendtag $C$DW$T$32
    1563              
    1564              
    1565              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1566                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
    1567              $C$DW$222       .dwtag  DW_TAG_member
    1568                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$31)
    1569                      .dwattr $C$DW$222, DW_AT_name("state")
    1570                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_state")
    1571                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1573              $C$DW$223       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$32)
    1575                      .dwattr $C$DW$223, DW_AT_name("sym")
    1576                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_sym")
    1577                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1578                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1579              $C$DW$224       .dwtag  DW_TAG_member
    1580                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$31)
    1581                      .dwattr $C$DW$224, DW_AT_name("beam")
    1582                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_beam")
    1583                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1584                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1585              $C$DW$225       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$31)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   37

    1587                      .dwattr $C$DW$225, DW_AT_name("time")
    1588                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_time")
    1589                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1590                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1591                      .dwendtag $C$DW$T$33
    1592              
    1593              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    1594                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$33)
    1595                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1596              
    1597              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1598                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x03)
    1599              $C$DW$226       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$34)
    1601                      .dwattr $C$DW$226, DW_AT_name("cur_sym")
    1602                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_cur_sym")
    1603                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1604                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1605              $C$DW$227       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$9)
    1607                      .dwattr $C$DW$227, DW_AT_name("cur_state")
    1608                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_cur_state")
    1609                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1610                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1611                      .dwendtag $C$DW$T$35
    1612              
    1613              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    1614                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    1615                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1616              
    1617              $C$DW$T$82      .dwtag  DW_TAG_array_type
    1618                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    1619                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1620                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x06)
    1621              $C$DW$228       .dwtag  DW_TAG_subrange_type
    1622                      .dwattr $C$DW$228, DW_AT_upper_bound(0x01)
    1623                      .dwendtag $C$DW$T$82
    1624              
    1625              
    1626              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1627                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    1628              $C$DW$229       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$9)
    1630                      .dwattr $C$DW$229, DW_AT_name("max_nbr_syms")
    1631                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_max_nbr_syms")
    1632                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1634              $C$DW$230       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$8)
    1636                      .dwattr $C$DW$230, DW_AT_name("nbr_syms")
    1637                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_nbr_syms")
    1638                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1639                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1640              $C$DW$231       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   38

    1642                      .dwattr $C$DW$231, DW_AT_name("sym2pos")
    1643                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_sym2pos")
    1644                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1645                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1646              $C$DW$232       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$36)
    1648                      .dwattr $C$DW$232, DW_AT_name("syms")
    1649                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_syms")
    1650                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1651                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1652                      .dwendtag $C$DW$T$37
    1653              
    1654              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    1655                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$37)
    1656                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1657              
    1658              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1659                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x16)
    1660              $C$DW$233       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$8)
    1662                      .dwattr $C$DW$233, DW_AT_name("scr")
    1663                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_scr")
    1664                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1666              $C$DW$234       .dwtag  DW_TAG_member
    1667                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$8)
    1668                      .dwattr $C$DW$234, DW_AT_name("n_ans")
    1669                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_n_ans")
    1670                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1671                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1672              $C$DW$235       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$38)
    1674                      .dwattr $C$DW$235, DW_AT_name("answers")
    1675                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_answers")
    1676                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1677                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1678                      .dwendtag $C$DW$T$39
    1679              
    1680              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    1681                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$39)
    1682                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1683              
    1684              $C$DW$T$42      .dwtag  DW_TAG_array_type
    1685                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1686                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1687                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x294)
    1688              $C$DW$236       .dwtag  DW_TAG_subrange_type
    1689                      .dwattr $C$DW$236, DW_AT_upper_bound(0x1d)
    1690                      .dwendtag $C$DW$T$42
    1691              
    1692              
    1693              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1694                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x2b3)
    1695              $C$DW$237       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   39

    1697                      .dwattr $C$DW$237, DW_AT_name("n_bests")
    1698                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_n_bests")
    1699                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1700                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1701              $C$DW$238       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$40)
    1703                      .dwattr $C$DW$238, DW_AT_name("best_idx")
    1704                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_best_idx")
    1705                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1706                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$239       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$42)
    1709                      .dwattr $C$DW$239, DW_AT_name("elem")
    1710                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_elem")
    1711                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1712                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1713                      .dwendtag $C$DW$T$43
    1714              
    1715              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    1716                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$43)
    1717                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1718              
    1719              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1720                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x14)
    1721              $C$DW$240       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$21)
    1723                      .dwattr $C$DW$240, DW_AT_name("alpha_p")
    1724                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_alpha_p")
    1725                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1726                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1727              $C$DW$241       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$21)
    1729                      .dwattr $C$DW$241, DW_AT_name("sAlpha")
    1730                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_sAlpha")
    1731                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1732                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1733              $C$DW$242       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$8)
    1735                      .dwattr $C$DW$242, DW_AT_name("sBeta")
    1736                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_sBeta")
    1737                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1738                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1739              $C$DW$243       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$8)
    1741                      .dwattr $C$DW$243, DW_AT_name("lambdaLTEhigherE")
    1742                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    1743                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1744                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1745              $C$DW$244       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$8)
    1747                      .dwattr $C$DW$244, DW_AT_name("frm_count")
    1748                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_frm_count")
    1749                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1750                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1751              $C$DW$245       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   40

    1752                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$21)
    1753                      .dwattr $C$DW$245, DW_AT_name("prob_sp")
    1754                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_prob_sp")
    1755                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1756                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1757              $C$DW$246       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$22)
    1759                      .dwattr $C$DW$246, DW_AT_name("s_noise_floor")
    1760                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_s_noise_floor")
    1761                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1762                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1763              $C$DW$247       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$22)
    1765                      .dwattr $C$DW$247, DW_AT_name("snr")
    1766                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_snr")
    1767                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1768                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1769              $C$DW$248       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
    1771                      .dwattr $C$DW$248, DW_AT_name("ps_long_term_noise")
    1772                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_ps_long_term_noise")
    1773                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1774                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1775              $C$DW$249       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$8)
    1777                      .dwattr $C$DW$249, DW_AT_name("frmEn")
    1778                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_frmEn")
    1779                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1780                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1781              $C$DW$250       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$8)
    1783                      .dwattr $C$DW$250, DW_AT_name("meanEn")
    1784                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_meanEn")
    1785                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1786                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1787              $C$DW$251       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$8)
    1789                      .dwattr $C$DW$251, DW_AT_name("prevMeanEn")
    1790                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_prevMeanEn")
    1791                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1792                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1793              $C$DW$252       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$8)
    1795                      .dwattr $C$DW$252, DW_AT_name("noiselvl")
    1796                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_noiselvl")
    1797                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1798                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1799              $C$DW$253       .dwtag  DW_TAG_member
    1800                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$8)
    1801                      .dwattr $C$DW$253, DW_AT_name("lambdaLTE")
    1802                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_lambdaLTE")
    1803                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1804                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1805              $C$DW$254       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   41

    1807                      .dwattr $C$DW$254, DW_AT_name("nbSpeechFrame")
    1808                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_nbSpeechFrame")
    1809                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1810                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1811              $C$DW$255       .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$8)
    1813                      .dwattr $C$DW$255, DW_AT_name("hangOver")
    1814                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_hangOver")
    1815                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1816                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1817                      .dwendtag $C$DW$T$44
    1818              
    1819              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    1820                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
    1821                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1822              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    1823                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1824                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    1825              
    1826              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1827                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x03)
    1828              $C$DW$256       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$8)
    1830                      .dwattr $C$DW$256, DW_AT_name("mean")
    1831                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_mean")
    1832                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1833                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1834              $C$DW$257       .dwtag  DW_TAG_member
    1835                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$8)
    1836                      .dwattr $C$DW$257, DW_AT_name("inv")
    1837                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_inv")
    1838                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1839                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1840              $C$DW$258       .dwtag  DW_TAG_member
    1841                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$8)
    1842                      .dwattr $C$DW$258, DW_AT_name("gconst")
    1843                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_gconst")
    1844                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1845                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1846                      .dwendtag $C$DW$T$45
    1847              
    1848              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    1849                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$45)
    1850                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1851              
    1852              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1853                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x544)
    1854              $C$DW$259       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$46)
    1856                      .dwattr $C$DW$259, DW_AT_name("base_mem")
    1857                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_base_mem")
    1858                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1859                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1860              $C$DW$260       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   42

    1862                      .dwattr $C$DW$260, DW_AT_name("mem_count")
    1863                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_mem_count")
    1864                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    1865                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1866              $C$DW$261       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$23)
    1868                      .dwattr $C$DW$261, DW_AT_name("answers")
    1869                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_answers")
    1870                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    1871                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1872              $C$DW$262       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$23)
    1874                      .dwattr $C$DW$262, DW_AT_name("uStp")
    1875                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_uStp")
    1876                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    1877                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1878              $C$DW$263       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$21)
    1880                      .dwattr $C$DW$263, DW_AT_name("nWords")
    1881                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_nWords")
    1882                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    1883                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1884              $C$DW$264       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$8)
    1886                      .dwattr $C$DW$264, DW_AT_name("nS")
    1887                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_nS")
    1888                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    1889                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1890              $C$DW$265       .dwtag  DW_TAG_member
    1891                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$22)
    1892                      .dwattr $C$DW$265, DW_AT_name("cm_scr")
    1893                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_cm_scr")
    1894                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    1895                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1896              $C$DW$266       .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$8)
    1898                      .dwattr $C$DW$266, DW_AT_name("bNeedUpdate")
    1899                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_bNeedUpdate")
    1900                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    1901                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1902              $C$DW$267       .dwtag  DW_TAG_member
    1903                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$22)
    1904                      .dwattr $C$DW$267, DW_AT_name("cm_anti_scr")
    1905                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_cm_anti_scr")
    1906                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    1907                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1908              $C$DW$268       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$12)
    1910                      .dwattr $C$DW$268, DW_AT_name("cm_fg_scr")
    1911                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_cm_fg_scr")
    1912                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    1913                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1914              $C$DW$269       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$12)
    1916                      .dwattr $C$DW$269, DW_AT_name("cm_bk_scr")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   43

    1917                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_cm_bk_scr")
    1918                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    1919                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1920              $C$DW$270       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$8)
    1922                      .dwattr $C$DW$270, DW_AT_name("th_nbest")
    1923                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_th_nbest")
    1924                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    1925                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1926              $C$DW$271       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$8)
    1928                      .dwattr $C$DW$271, DW_AT_name("nSpeech")
    1929                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_nSpeech")
    1930                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    1931                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1932              $C$DW$272       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$8)
    1934                      .dwattr $C$DW$272, DW_AT_name("nNoise")
    1935                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_nNoise")
    1936                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    1937                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1938              $C$DW$273       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$12)
    1940                      .dwattr $C$DW$273, DW_AT_name("speech_power")
    1941                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_speech_power")
    1942                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    1943                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    1944              $C$DW$274       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$12)
    1946                      .dwattr $C$DW$274, DW_AT_name("noise_power")
    1947                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_noise_power")
    1948                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    1949                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1950              $C$DW$275       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$12)
    1952                      .dwattr $C$DW$275, DW_AT_name("noise_power_sqr")
    1953                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_noise_power_sqr")
    1954                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    1955                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1956              $C$DW$276       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$8)
    1958                      .dwattr $C$DW$276, DW_AT_name("NSNR")
    1959                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_NSNR")
    1960                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    1961                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    1962              $C$DW$277       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$47)
    1964                      .dwattr $C$DW$277, DW_AT_name("H0")
    1965                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_H0")
    1966                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    1967                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1968              $C$DW$278       .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$47)
    1970                      .dwattr $C$DW$278, DW_AT_name("H1")
    1971                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_H1")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   44

    1972                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    1973                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1974              $C$DW$279       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$22)
    1976                      .dwattr $C$DW$279, DW_AT_name("lgBeta")
    1977                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_lgBeta")
    1978                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    1979                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    1980              $C$DW$280       .dwtag  DW_TAG_member
    1981                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$48)
    1982                      .dwattr $C$DW$280, DW_AT_name("acc_dif2_beta")
    1983                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_acc_dif2_beta")
    1984                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    1985                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    1986              $C$DW$281       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$8)
    1988                      .dwattr $C$DW$281, DW_AT_name("bCalced")
    1989                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_bCalced")
    1990                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    1991                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$282       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$22)
    1994                      .dwattr $C$DW$282, DW_AT_name("sCH")
    1995                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_sCH")
    1996                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    1997                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    1998              $C$DW$283       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$48)
    2000                      .dwattr $C$DW$283, DW_AT_name("lAccum")
    2001                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_lAccum")
    2002                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    2003                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2004              $C$DW$284       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$8)
    2006                      .dwattr $C$DW$284, DW_AT_name("adp_th")
    2007                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_adp_th")
    2008                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    2009                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2010                      .dwendtag $C$DW$T$49
    2011              
    2012              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    2013                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$49)
    2014                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2015              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    2016                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    2017                      .dwattr $C$DW$T$90, DW_AT_address_class(0x17)
    2018              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2019                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2020                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2021                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2022              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2023                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2024                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2025                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2026              $C$DW$T$6       .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   45

    2027                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2028                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2029                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2030              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2031                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2032                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2033                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2034              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2035                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2036                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2037                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2038              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    2039                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$8)
    2040                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    2041              
    2042              $C$DW$T$40      .dwtag  DW_TAG_array_type
    2043                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$8)
    2044                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2045                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x1e)
    2046              $C$DW$285       .dwtag  DW_TAG_subrange_type
    2047                      .dwattr $C$DW$285, DW_AT_upper_bound(0x1d)
    2048                      .dwendtag $C$DW$T$40
    2049              
    2050              
    2051              $C$DW$T$46      .dwtag  DW_TAG_array_type
    2052                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$8)
    2053                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2054                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x514)
    2055              $C$DW$286       .dwtag  DW_TAG_subrange_type
    2056                      .dwattr $C$DW$286, DW_AT_upper_bound(0x513)
    2057                      .dwendtag $C$DW$T$46
    2058              
    2059              
    2060              $C$DW$T$51      .dwtag  DW_TAG_array_type
    2061                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    2062                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2063                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    2064              $C$DW$287       .dwtag  DW_TAG_subrange_type
    2065                      .dwattr $C$DW$287, DW_AT_upper_bound(0xff)
    2066                      .dwendtag $C$DW$T$51
    2067              
    2068              
    2069              $C$DW$T$52      .dwtag  DW_TAG_array_type
    2070                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    2071                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2072                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x10)
    2073              $C$DW$288       .dwtag  DW_TAG_subrange_type
    2074                      .dwattr $C$DW$288, DW_AT_upper_bound(0x0f)
    2075                      .dwendtag $C$DW$T$52
    2076              
    2077              
    2078              $C$DW$T$53      .dwtag  DW_TAG_array_type
    2079                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
    2080                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2081                      .dwattr $C$DW$T$53, DW_AT_byte_size(0xe0)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   46

    2082              $C$DW$289       .dwtag  DW_TAG_subrange_type
    2083                      .dwattr $C$DW$289, DW_AT_upper_bound(0x0d)
    2084              $C$DW$290       .dwtag  DW_TAG_subrange_type
    2085                      .dwattr $C$DW$290, DW_AT_upper_bound(0x0f)
    2086                      .dwendtag $C$DW$T$53
    2087              
    2088              $C$DW$T$108     .dwtag  DW_TAG_pointer_type
    2089                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$52)
    2090                      .dwattr $C$DW$T$108, DW_AT_address_class(0x17)
    2091              $C$DW$291       .dwtag  DW_TAG_TI_far_type
    2092                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$8)
    2093              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2094                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$291)
    2095              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    2096                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2097                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    2098              
    2099              $C$DW$T$56      .dwtag  DW_TAG_array_type
    2100                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2101                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2102                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x20)
    2103              $C$DW$292       .dwtag  DW_TAG_subrange_type
    2104                      .dwattr $C$DW$292, DW_AT_upper_bound(0x0f)
    2105                      .dwendtag $C$DW$T$56
    2106              
    2107              $C$DW$T$105     .dwtag  DW_TAG_pointer_type
    2108                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$55)
    2109                      .dwattr $C$DW$T$105, DW_AT_address_class(0x17)
    2110              
    2111              $C$DW$T$60      .dwtag  DW_TAG_array_type
    2112                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    2113                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2114                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x80)
    2115              $C$DW$293       .dwtag  DW_TAG_subrange_type
    2116                      .dwattr $C$DW$293, DW_AT_upper_bound(0x7f)
    2117                      .dwendtag $C$DW$T$60
    2118              
    2119              
    2120              $C$DW$T$61      .dwtag  DW_TAG_array_type
    2121                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$8)
    2122                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2123                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x1a)
    2124              $C$DW$294       .dwtag  DW_TAG_subrange_type
    2125                      .dwattr $C$DW$294, DW_AT_upper_bound(0x19)
    2126                      .dwendtag $C$DW$T$61
    2127              
    2128              
    2129              $C$DW$T$79      .dwtag  DW_TAG_array_type
    2130                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$8)
    2131                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2132                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x20)
    2133              $C$DW$295       .dwtag  DW_TAG_subrange_type
    2134                      .dwattr $C$DW$295, DW_AT_upper_bound(0x1f)
    2135                      .dwendtag $C$DW$T$79
    2136              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   47

    2137              
    2138              $C$DW$T$85      .dwtag  DW_TAG_array_type
    2139                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$8)
    2140                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2141                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x14)
    2142              $C$DW$296       .dwtag  DW_TAG_subrange_type
    2143                      .dwattr $C$DW$296, DW_AT_upper_bound(0x13)
    2144                      .dwendtag $C$DW$T$85
    2145              
    2146              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2147                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2148                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2149                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2150              
    2151              $C$DW$T$28      .dwtag  DW_TAG_array_type
    2152                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$9)
    2153                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2154                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2155              $C$DW$297       .dwtag  DW_TAG_subrange_type
    2156                      .dwattr $C$DW$297, DW_AT_upper_bound(0x00)
    2157                      .dwendtag $C$DW$T$28
    2158              
    2159              
    2160              $C$DW$T$34      .dwtag  DW_TAG_array_type
    2161                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    2162                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2163                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2164              $C$DW$298       .dwtag  DW_TAG_subrange_type
    2165                      .dwattr $C$DW$298, DW_AT_upper_bound(0x01)
    2166                      .dwendtag $C$DW$T$34
    2167              
    2168              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    2169                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$9)
    2170                      .dwattr $C$DW$T$36, DW_AT_address_class(0x17)
    2171              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    2172                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    2173                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2174              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    2175                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
    2176                      .dwattr $C$DW$T$23, DW_AT_address_class(0x17)
    2177              
    2178              $C$DW$T$38      .dwtag  DW_TAG_array_type
    2179                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$21)
    2180                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2181                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    2182              $C$DW$299       .dwtag  DW_TAG_subrange_type
    2183                      .dwattr $C$DW$299, DW_AT_upper_bound(0x13)
    2184                      .dwendtag $C$DW$T$38
    2185              
    2186              
    2187              $C$DW$T$86      .dwtag  DW_TAG_array_type
    2188                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$21)
    2189                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2190                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x02)
    2191              $C$DW$300       .dwtag  DW_TAG_subrange_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   48

    2192                      .dwattr $C$DW$300, DW_AT_upper_bound(0x01)
    2193                      .dwendtag $C$DW$T$86
    2194              
    2195              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2196                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2197                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2198                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2199              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2200                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2201                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2202                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2203              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2204                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2205                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2206                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2207              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    2208                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$12)
    2209                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
    2210              
    2211              $C$DW$T$62      .dwtag  DW_TAG_array_type
    2212                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$12)
    2213                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2214                      .dwattr $C$DW$T$62, DW_AT_byte_size(0xd0)
    2215              $C$DW$301       .dwtag  DW_TAG_subrange_type
    2216                      .dwattr $C$DW$301, DW_AT_upper_bound(0x67)
    2217                      .dwendtag $C$DW$T$62
    2218              
    2219              
    2220              $C$DW$T$65      .dwtag  DW_TAG_array_type
    2221                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$12)
    2222                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2223                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x20)
    2224              $C$DW$302       .dwtag  DW_TAG_subrange_type
    2225                      .dwattr $C$DW$302, DW_AT_upper_bound(0x0f)
    2226                      .dwendtag $C$DW$T$65
    2227              
    2228              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2229                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2230                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2231                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2232              $C$DW$T$14      .dwtag  DW_TAG_base_type
    2233                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2234                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    2235                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    2236                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    2237                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    2238              $C$DW$T$15      .dwtag  DW_TAG_base_type
    2239                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2240                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2241                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    2242                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    2243                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    2244              $C$DW$T$16      .dwtag  DW_TAG_base_type
    2245                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2246                      .dwattr $C$DW$T$16, DW_AT_name("float")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   49

    2247                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    2248              $C$DW$T$17      .dwtag  DW_TAG_base_type
    2249                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2250                      .dwattr $C$DW$T$17, DW_AT_name("double")
    2251                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    2252              $C$DW$T$18      .dwtag  DW_TAG_base_type
    2253                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2254                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    2255                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    2256              $C$DW$T$74      .dwtag  DW_TAG_base_type
    2257                      .dwattr $C$DW$T$74, DW_AT_encoding(DW_ATE_signed_char)
    2258                      .dwattr $C$DW$T$74, DW_AT_name("signed char")
    2259                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    2260              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    2261                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2262                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    2263              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    2264                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$75)
    2265                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    2266              
    2267              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2268                      .dwattr $C$DW$T$50, DW_AT_name("ele")
    2269                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x03)
    2270              $C$DW$303       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$9)
    2272                      .dwattr $C$DW$303, DW_AT_name("sym")
    2273                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_sym")
    2274                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2276              $C$DW$304       .dwtag  DW_TAG_member
    2277                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$9)
    2278                      .dwattr $C$DW$304, DW_AT_name("idx_flag")
    2279                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_idx_flag")
    2280                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2281                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2282              $C$DW$305       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$9)
    2284                      .dwattr $C$DW$305, DW_AT_name("next")
    2285                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_next")
    2286                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2287                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2288                      .dwendtag $C$DW$T$50
    2289              
    2290              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    2291                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$50)
    2292                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2293              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    2294                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2295                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    2296              
    2297              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    2298                      .dwattr $C$DW$T$91, DW_AT_name("gmhmm_type")
    2299                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x7fe)
    2300              $C$DW$306       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   50

    2302                      .dwattr $C$DW$306, DW_AT_name("avedepth")
    2303                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_avedepth")
    2304                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2306              $C$DW$307       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    2308                      .dwattr $C$DW$307, DW_AT_name("bestdepth")
    2309                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_bestdepth")
    2310                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2311                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2312              $C$DW$308       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    2314                      .dwattr $C$DW$308, DW_AT_name("index_mean")
    2315                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_index_mean")
    2316                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2317                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2318              $C$DW$309       .dwtag  DW_TAG_member
    2319                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    2320                      .dwattr $C$DW$309, DW_AT_name("signal_cnt")
    2321                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_signal_cnt")
    2322                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2323                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2324              $C$DW$310       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$8)
    2326                      .dwattr $C$DW$310, DW_AT_name("buf_idx")
    2327                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_buf_idx")
    2328                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2329                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2330              $C$DW$311       .dwtag  DW_TAG_member
    2331                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$21)
    2332                      .dwattr $C$DW$311, DW_AT_name("speech_detected")
    2333                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_speech_detected")
    2334                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2335                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2336              $C$DW$312       .dwtag  DW_TAG_member
    2337                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
    2338                      .dwattr $C$DW$312, DW_AT_name("mfcc_cnt")
    2339                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_mfcc_cnt")
    2340                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2341                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2342              $C$DW$313       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    2344                      .dwattr $C$DW$313, DW_AT_name("nbr_cpy")
    2345                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_nbr_cpy")
    2346                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2347                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2348              $C$DW$314       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$8)
    2350                      .dwattr $C$DW$314, DW_AT_name("last_sig")
    2351                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_last_sig")
    2352                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2353                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2354              $C$DW$315       .dwtag  DW_TAG_member
    2355                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$51)
    2356                      .dwattr $C$DW$315, DW_AT_name("sample_signal")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   51

    2357                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_sample_signal")
    2358                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2359                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2360              $C$DW$316       .dwtag  DW_TAG_member
    2361                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$8)
    2362                      .dwattr $C$DW$316, DW_AT_name("amplitude_max")
    2363                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_amplitude_max")
    2364                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    2365                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2366              $C$DW$317       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$8)
    2368                      .dwattr $C$DW$317, DW_AT_name("amplitude_min")
    2369                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_amplitude_min")
    2370                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    2371                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2372              $C$DW$318       .dwtag  DW_TAG_member
    2373                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$8)
    2374                      .dwattr $C$DW$318, DW_AT_name("pred_first_frame")
    2375                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_pred_first_frame")
    2376                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    2377                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2378              $C$DW$319       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$8)
    2380                      .dwattr $C$DW$319, DW_AT_name("frm_cnt")
    2381                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_frm_cnt")
    2382                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    2383                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2384              $C$DW$320       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$8)
    2386                      .dwattr $C$DW$320, DW_AT_name("beam_count")
    2387                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_beam_count")
    2388                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    2389                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2390              $C$DW$321       .dwtag  DW_TAG_member
    2391                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$8)
    2392                      .dwattr $C$DW$321, DW_AT_name("active_beam_cells")
    2393                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_active_beam_cells")
    2394                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    2395                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2396              $C$DW$322       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$8)
    2398                      .dwattr $C$DW$322, DW_AT_name("active_time_cells")
    2399                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_active_time_cells")
    2400                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    2401                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2402              $C$DW$323       .dwtag  DW_TAG_member
    2403                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$9)
    2404                      .dwattr $C$DW$323, DW_AT_name("ending_sym_count")
    2405                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_ending_sym_count")
    2406                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2407                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2408              $C$DW$324       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$8)
    2410                      .dwattr $C$DW$324, DW_AT_name("comp_type")
    2411                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_comp_type")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:27 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1502810                         PAGE   52

    2412                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    2413                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2414              $C$DW$325       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$9)
    2416                      .dwattr $C$DW$325, DW_AT_name("low_vol_limit")
    2417                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_low_vol_limit")
    2418                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    2419                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2420              $C$DW$326       .dwtag  DW_TAG_member
    2421                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$9)
    2422                      .dwattr $C$DW$326, DW_AT_name("high_vol_limit")
    2423                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_high_vol_limit")
    2424                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
    2425                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2426              $C$DW$327       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$8)
    2428                      .dwattr $C$DW$327, DW_AT_name("vol")
    2429                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_vol")
    2430                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2431                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2432              $C$DW$328       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
    2434                      .dwattr $C$DW$328, DW_AT_name("n_mfcc")
    2435                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_n_mfcc")
    2436                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    2437                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2438              $C$DW$329       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$8)
    2440                      .dwattr $C$DW$329, DW_AT_name("nbr_dim")
    2441                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_nbr_dim")
    2442                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    2443                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2444              $C$DW$330       .dwtag  DW_TAG_member
    2445                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
    2446                      .dwattr $C$DW$330, DW_AT_name("n_filter")
    2447                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_n_filter")
    2448                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    2449                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2450              $C$DW$331       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$53)
    2452                      .dwattr $C$DW$331, DW_AT_name("mfcc_buf")
    2453                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_mfcc_buf")
    2454                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2455                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2456              $C$DW$332       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$52)
