TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE    1

    5093              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:28 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2725              $C$DW$263       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureDimensionFail"), DW_AT_const_value(
    2726              $C$DW$264       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSegmentSizeCheckFail"), DW_AT_const_value(
    2727              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelFileFail"), DW_AT_const_value(0x1c4)
    2728              $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSaveFail"), DW_AT_const_value(0x1c5)
    2729              $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineEnrollLoadFail"), DW_AT_const_value(0x1c6)
    2730              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackgoundCreationFail"), DW_AT_const_value
    2731              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineStateMemoryOut"), DW_AT_const_value(0x1f4)
    2732              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSearchMemoryOut"), DW_AT_const_value(0x1f5
    2733              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelMemorySize"), DW_AT_const_value(0x258
    2734              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureMemorySize"), DW_AT_const_value(0x2
    2735              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineNetworkMemorySize"), DW_AT_const_value(0x2
    2736              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelSize"), DW_AT_const_value(0x25b)
    2737              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackTrackMemorySize"), DW_AT_const_value(0
    2738              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineCMMemorySize"), DW_AT_const_value(0x25d)
    2739              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineVALTreeMemorySize"), DW_AT_const_value(0x2
    2740              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSym2PosMapSize"), DW_AT_const_value(0x25f)
    2741              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineShortUtterance"), DW_AT_const_value(0x2bc)
    2742              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadHMM2Phone"), DW_AT_const_value(0x320)
    2743              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNoSilencePhone"), DW_AT_const_value(0x321)
    2744              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhone2Voicing"), DW_AT_const_value(0x322)
    2745              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhoneDuration"), DW_AT_const_value(0x323)
    2746              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMismatch"), DW_AT_const_value(0x324)
    2747              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMissWord"), DW_AT_const_value(0x325)
    2748              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneDuration"), DW_AT_const_value(0x326)
    2749              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneWord"), DW_AT_const_value(0x327)
    2750              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveTTSMean"), DW_AT_const_value(0x328)
    2751              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveVoicing"), DW_AT_const_value(0x329)
    2752              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveDuration"), DW_AT_const_value(0x32a)
    2753              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSTTS"), DW_AT_const_value(0x32b)
    2754              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneList"), DW_AT_const_value(0x32c)
    2755              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumPhones"), DW_AT_const_value(0x32d)
    2756              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumWords"), DW_AT_const_value(0x32e)
    2757              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputFile"), DW_AT_const_value(0x32f)
    2758              $C$DW$296       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputMFCC"), DW_AT_const_value(0x330)
    2759              $C$DW$297       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputDuration"), DW_AT_const_value(0x331)
    2760              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputVoicing"), DW_AT_const_value(0x332)
    2761              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNotFound"), DW_AT_const_value(0x333)
    2762              $C$DW$300       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputMeanSize"), DW_AT_const_value(0x334)
    2763              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutput"), DW_AT_const_value(0x335)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   64

    2764                      .dwendtag $C$DW$T$94
    2765              
    2766              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineStatusType")
    2767                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    2768                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2769              
    2770              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2771                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
    2772              $C$DW$302       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$10)
    2774                      .dwattr $C$DW$302, DW_AT_name("fd")
    2775                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_fd")
    2776                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2778              $C$DW$303       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    2780                      .dwattr $C$DW$303, DW_AT_name("buf")
    2781                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_buf")
    2782                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2783                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2784              $C$DW$304       .dwtag  DW_TAG_member
    2785                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    2786                      .dwattr $C$DW$304, DW_AT_name("pos")
    2787                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_pos")
    2788                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2789                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2790              $C$DW$305       .dwtag  DW_TAG_member
    2791                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    2792                      .dwattr $C$DW$305, DW_AT_name("bufend")
    2793                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_bufend")
    2794                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2795                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2796              $C$DW$306       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    2798                      .dwattr $C$DW$306, DW_AT_name("buff_stop")
    2799                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_buff_stop")
    2800                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2801                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2802              $C$DW$307       .dwtag  DW_TAG_member
    2803                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$11)
    2804                      .dwattr $C$DW$307, DW_AT_name("flags")
    2805                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_flags")
    2806                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2807                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2808                      .dwendtag $C$DW$T$20
    2809              
    2810              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    2811                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$20)
    2812                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    2813              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    2814                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    2815                      .dwattr $C$DW$T$100, DW_AT_address_class(0x17)
    2816              
    2817              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2818                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x03)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   65

    2819              $C$DW$308       .dwtag  DW_TAG_member
    2820                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$8)
    2821                      .dwattr $C$DW$308, DW_AT_name("num")
    2822                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_num")
    2823                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2824                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2825              $C$DW$309       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$8)
    2827                      .dwattr $C$DW$309, DW_AT_name("x1")
    2828                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_x1")
    2829                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2830                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2831              $C$DW$310       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$8)
    2833                      .dwattr $C$DW$310, DW_AT_name("x2")
    2834                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_x2")
    2835                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2836                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2837                      .dwendtag $C$DW$T$21
    2838              
    2839              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    2840                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$21)
    2841                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2842              $C$DW$311       .dwtag  DW_TAG_TI_far_type
    2843                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$59)
    2844              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2845                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$311)
    2846              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    2847                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2848                      .dwattr $C$DW$T$61, DW_AT_address_class(0x17)
    2849              
    2850              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2851                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x18)
    2852              $C$DW$312       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$22)
    2854                      .dwattr $C$DW$312, DW_AT_name("max_mem_usage")
    2855                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_max_mem_usage")
    2856                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2857                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2858              $C$DW$313       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$22)
    2860                      .dwattr $C$DW$313, DW_AT_name("n_terminals")
    2861                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_n_terminals")
    2862                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2863                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2864              $C$DW$314       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$22)
    2866                      .dwattr $C$DW$314, DW_AT_name("n_monophones")
    2867                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_n_monophones")
    2868                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2869                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2870              $C$DW$315       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$23)
    2872                      .dwattr $C$DW$315, DW_AT_name("hlrTreeBase")
    2873                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_hlrTreeBase")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   66

    2874                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2875                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2876              $C$DW$316       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$24)
    2878                      .dwattr $C$DW$316, DW_AT_name("hlrTerminal")
    2879                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_hlrTerminal")
    2880                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2881                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2882              $C$DW$317       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$23)
    2884                      .dwattr $C$DW$317, DW_AT_name("pHMM2phone")
    2885                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_pHMM2phone")
    2886                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2887                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2888              $C$DW$318       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$24)
    2890                      .dwattr $C$DW$318, DW_AT_name("hlrTransformIndex")
    2891                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_hlrTransformIndex")
    2892                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2893                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2894              $C$DW$319       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$22)
    2896                      .dwattr $C$DW$319, DW_AT_name("hlr_TRANSFORM_SIZE")
    2897                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    2898                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2899                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$320       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$23)
    2902                      .dwattr $C$DW$320, DW_AT_name("hlrTransforms")
    2903                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_hlrTransforms")
    2904                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2905                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$321       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$23)
    2908                      .dwattr $C$DW$321, DW_AT_name("pSegStat_dif1")
    2909                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_pSegStat_dif1")
    2910                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2911                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$322       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$23)
    2914                      .dwattr $C$DW$322, DW_AT_name("pSegStat_dif2")
    2915                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_pSegStat_dif2")
    2916                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2917                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2918              $C$DW$323       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$23)
    2920                      .dwattr $C$DW$323, DW_AT_name("pEnhanced")
    2921                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_pEnhanced")
    2922                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2923                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2924              $C$DW$324       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$23)
    2926                      .dwattr $C$DW$324, DW_AT_name("bk_node_cnt")
    2927                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_bk_node_cnt")
    2928                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   67

    2929                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2930                      .dwendtag $C$DW$T$25
    2931              
    2932              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    2933                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$25)
    2934                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2935              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    2936                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2937                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    2938              
    2939              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2940                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x03)
    2941              $C$DW$325       .dwtag  DW_TAG_member
    2942                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$9)
    2943                      .dwattr $C$DW$325, DW_AT_name("sym_code")
    2944                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_sym_code")
    2945                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2946                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2947              $C$DW$326       .dwtag  DW_TAG_member
    2948                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$9)
    2949                      .dwattr $C$DW$326, DW_AT_name("start_cell")
    2950                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_start_cell")
    2951                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2952                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2953              $C$DW$327       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$9)
    2955                      .dwattr $C$DW$327, DW_AT_name("depth")
    2956                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_depth")
    2957                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2958                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2959                      .dwendtag $C$DW$T$26
    2960              
    2961              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    2962                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$26)
    2963                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2964              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    2965                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2966                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
    2967              
    2968              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2969                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x03)
    2970              $C$DW$328       .dwtag  DW_TAG_member
    2971                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$8)
    2972                      .dwattr $C$DW$328, DW_AT_name("scr")
    2973                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_scr")
    2974                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2975                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2976              $C$DW$329       .dwtag  DW_TAG_member
    2977                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$9)
    2978                      .dwattr $C$DW$329, DW_AT_name("sym")
    2979                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_sym")
    2980                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2981                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2982              $C$DW$330       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   68

    2984                      .dwattr $C$DW$330, DW_AT_name("frm")
    2985                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_frm")
    2986                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2987                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2988                      .dwendtag $C$DW$T$27
    2989              
    2990              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    2991                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$27)
    2992                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2993              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    2994                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2995                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    2996              
    2997              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2998                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2999              $C$DW$331       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$9)
    3001                      .dwattr $C$DW$331, DW_AT_name("frm")
    3002                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_frm")
    3003                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3004                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3005              $C$DW$332       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$9)
    3007                      .dwattr $C$DW$332, DW_AT_name("beam_idx")
    3008                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_beam_idx")
    3009                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3010                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3011                      .dwendtag $C$DW$T$28
    3012              
    3013              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    3014                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$28)
    3015                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3016              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    3017                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3018                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    3019              
    3020              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3021                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    3022              $C$DW$333       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$9)
    3024                      .dwattr $C$DW$333, DW_AT_name("n_hmm")
    3025                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_n_hmm")
    3026                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3027                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3028              $C$DW$334       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$9)
    3030                      .dwattr $C$DW$334, DW_AT_name("n_sym")
    3031                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_n_sym")
    3032                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3033                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3034              $C$DW$335       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$9)
    3036                      .dwattr $C$DW$335, DW_AT_name("n_word")
    3037                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_n_word")
    3038                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   69

    3039                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$336       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$9)
    3042                      .dwattr $C$DW$336, DW_AT_name("n_set")
    3043                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_n_set")
    3044                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3045                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3046              $C$DW$337       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$9)
    3048                      .dwattr $C$DW$337, DW_AT_name("n_hmm_set")
    3049                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_n_hmm_set")
    3050                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3051                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3052              $C$DW$338       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$9)
    3054                      .dwattr $C$DW$338, DW_AT_name("start")
    3055                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_start")
    3056                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3057                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3058              $C$DW$339       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$9)
    3060                      .dwattr $C$DW$339, DW_AT_name("stop")
    3061                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_stop")
    3062                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3063                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3064              $C$DW$340       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$29)
    3066                      .dwattr $C$DW$340, DW_AT_name("symlist")
    3067                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_symlist")
    3068                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3069                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3070                      .dwendtag $C$DW$T$30
    3071              
    3072              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    3073                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$30)
    3074                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3075              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    3076                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    3077                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    3078              
    3079              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3080                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    3081              $C$DW$341       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$9)
    3083                      .dwattr $C$DW$341, DW_AT_name("high_pos")
    3084                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_high_pos")
    3085                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3086                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3087              $C$DW$342       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$9)
    3089                      .dwattr $C$DW$342, DW_AT_name("cur_pos")
    3090                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_cur_pos")
    3091                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3092                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3093                      .dwendtag $C$DW$T$31
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   70

    3094              
    3095              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    3096                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    3097                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3098              
    3099              $C$DW$T$33      .dwtag  DW_TAG_array_type
    3100                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3101                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3102                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    3103              $C$DW$343       .dwtag  DW_TAG_subrange_type
    3104                      .dwattr $C$DW$343, DW_AT_upper_bound(0x01)
    3105                      .dwendtag $C$DW$T$33
    3106              
    3107              
    3108              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3109                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    3110              $C$DW$344       .dwtag  DW_TAG_member
    3111                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$32)
    3112                      .dwattr $C$DW$344, DW_AT_name("state")
    3113                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_state")
    3114                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3115                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3116              $C$DW$345       .dwtag  DW_TAG_member
    3117                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$33)
    3118                      .dwattr $C$DW$345, DW_AT_name("sym")
    3119                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_sym")
    3120                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3121                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3122              $C$DW$346       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$32)
    3124                      .dwattr $C$DW$346, DW_AT_name("beam")
    3125                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_beam")
    3126                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3127                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3128              $C$DW$347       .dwtag  DW_TAG_member
    3129                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$32)
    3130                      .dwattr $C$DW$347, DW_AT_name("time")
    3131                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_time")
    3132                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3133                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3134                      .dwendtag $C$DW$T$34
    3135              
    3136              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    3137                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$34)
    3138                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3139              
    3140              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3141                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x03)
    3142              $C$DW$348       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$35)
    3144                      .dwattr $C$DW$348, DW_AT_name("cur_sym")
    3145                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_cur_sym")
    3146                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3147                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3148              $C$DW$349       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   71

    3149                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$9)
    3150                      .dwattr $C$DW$349, DW_AT_name("cur_state")
    3151                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_cur_state")
    3152                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3153                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3154                      .dwendtag $C$DW$T$36
    3155              
    3156              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    3157                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$36)
    3158                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3159              
    3160              $C$DW$T$84      .dwtag  DW_TAG_array_type
    3161                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3162                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3163                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x06)
    3164              $C$DW$350       .dwtag  DW_TAG_subrange_type
    3165                      .dwattr $C$DW$350, DW_AT_upper_bound(0x01)
    3166                      .dwendtag $C$DW$T$84
    3167              
    3168              
    3169              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3170                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    3171              $C$DW$351       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$9)
    3173                      .dwattr $C$DW$351, DW_AT_name("max_nbr_syms")
    3174                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_max_nbr_syms")
    3175                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3176                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3177              $C$DW$352       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$8)
    3179                      .dwattr $C$DW$352, DW_AT_name("nbr_syms")
    3180                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_nbr_syms")
    3181                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3182                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$353       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    3185                      .dwattr $C$DW$353, DW_AT_name("sym2pos")
    3186                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_sym2pos")
    3187                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3188                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3189              $C$DW$354       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$37)
    3191                      .dwattr $C$DW$354, DW_AT_name("syms")
    3192                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_syms")
    3193                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3194                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3195                      .dwendtag $C$DW$T$38
    3196              
    3197              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    3198                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$38)
    3199                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3200              
    3201              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3202                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x16)
    3203              $C$DW$355       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   72

    3204                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$8)
    3205                      .dwattr $C$DW$355, DW_AT_name("scr")
    3206                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_scr")
    3207                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3208                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3209              $C$DW$356       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$8)
    3211                      .dwattr $C$DW$356, DW_AT_name("n_ans")
    3212                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_n_ans")
    3213                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3214                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3215              $C$DW$357       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$39)
    3217                      .dwattr $C$DW$357, DW_AT_name("answers")
    3218                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_answers")
    3219                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3220                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3221                      .dwendtag $C$DW$T$40
    3222              
    3223              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    3224                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    3225                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3226              
    3227              $C$DW$T$43      .dwtag  DW_TAG_array_type
    3228                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3229                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3230                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x294)
    3231              $C$DW$358       .dwtag  DW_TAG_subrange_type
    3232                      .dwattr $C$DW$358, DW_AT_upper_bound(0x1d)
    3233                      .dwendtag $C$DW$T$43
    3234              
    3235              
    3236              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3237                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x2b3)
    3238              $C$DW$359       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$8)
    3240                      .dwattr $C$DW$359, DW_AT_name("n_bests")
    3241                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_n_bests")
    3242                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3243                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3244              $C$DW$360       .dwtag  DW_TAG_member
    3245                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$41)
    3246                      .dwattr $C$DW$360, DW_AT_name("best_idx")
    3247                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_best_idx")
    3248                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3249                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3250              $C$DW$361       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$43)
    3252                      .dwattr $C$DW$361, DW_AT_name("elem")
    3253                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_elem")
    3254                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3255                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3256                      .dwendtag $C$DW$T$44
    3257              
    3258              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   73

    3259                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$44)
    3260                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3261              
    3262              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3263                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
    3264              $C$DW$362       .dwtag  DW_TAG_member
    3265                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$22)
    3266                      .dwattr $C$DW$362, DW_AT_name("alpha_p")
    3267                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_alpha_p")
    3268                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3269                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3270              $C$DW$363       .dwtag  DW_TAG_member
    3271                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$22)
    3272                      .dwattr $C$DW$363, DW_AT_name("sAlpha")
    3273                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_sAlpha")
    3274                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3275                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3276              $C$DW$364       .dwtag  DW_TAG_member
    3277                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$8)
    3278                      .dwattr $C$DW$364, DW_AT_name("sBeta")
    3279                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_sBeta")
    3280                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3281                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3282              $C$DW$365       .dwtag  DW_TAG_member
    3283                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$8)
    3284                      .dwattr $C$DW$365, DW_AT_name("lambdaLTEhigherE")
    3285                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    3286                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3287                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3288              $C$DW$366       .dwtag  DW_TAG_member
    3289                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$8)
    3290                      .dwattr $C$DW$366, DW_AT_name("frm_count")
    3291                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_frm_count")
    3292                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3293                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3294              $C$DW$367       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$22)
    3296                      .dwattr $C$DW$367, DW_AT_name("prob_sp")
    3297                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_prob_sp")
    3298                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3299                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3300              $C$DW$368       .dwtag  DW_TAG_member
    3301                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    3302                      .dwattr $C$DW$368, DW_AT_name("s_noise_floor")
    3303                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_s_noise_floor")
    3304                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3305                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3306              $C$DW$369       .dwtag  DW_TAG_member
    3307                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    3308                      .dwattr $C$DW$369, DW_AT_name("snr")
    3309                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_snr")
    3310                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3311                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3312              $C$DW$370       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   74

    3314                      .dwattr $C$DW$370, DW_AT_name("ps_long_term_noise")
    3315                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ps_long_term_noise")
    3316                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3317                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3318              $C$DW$371       .dwtag  DW_TAG_member
    3319                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$8)
    3320                      .dwattr $C$DW$371, DW_AT_name("frmEn")
    3321                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_frmEn")
    3322                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3323                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3324              $C$DW$372       .dwtag  DW_TAG_member
    3325                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$8)
    3326                      .dwattr $C$DW$372, DW_AT_name("meanEn")
    3327                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_meanEn")
    3328                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3329                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3330              $C$DW$373       .dwtag  DW_TAG_member
    3331                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$8)
    3332                      .dwattr $C$DW$373, DW_AT_name("prevMeanEn")
    3333                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_prevMeanEn")
    3334                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3335                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3336              $C$DW$374       .dwtag  DW_TAG_member
    3337                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$8)
    3338                      .dwattr $C$DW$374, DW_AT_name("noiselvl")
    3339                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_noiselvl")
    3340                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3341                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3342              $C$DW$375       .dwtag  DW_TAG_member
    3343                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$8)
    3344                      .dwattr $C$DW$375, DW_AT_name("lambdaLTE")
    3345                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_lambdaLTE")
    3346                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3347                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3348              $C$DW$376       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$8)
    3350                      .dwattr $C$DW$376, DW_AT_name("nbSpeechFrame")
    3351                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_nbSpeechFrame")
    3352                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3353                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3354              $C$DW$377       .dwtag  DW_TAG_member
    3355                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$8)
    3356                      .dwattr $C$DW$377, DW_AT_name("hangOver")
    3357                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_hangOver")
    3358                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3359                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3360                      .dwendtag $C$DW$T$45
    3361              
    3362              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    3363                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$45)
    3364                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3365              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    3366                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    3367                      .dwattr $C$DW$T$90, DW_AT_address_class(0x17)
    3368              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   75

    3369              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3370                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x03)
    3371              $C$DW$378       .dwtag  DW_TAG_member
    3372                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$8)
    3373                      .dwattr $C$DW$378, DW_AT_name("mean")
    3374                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_mean")
    3375                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3376                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3377              $C$DW$379       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$8)
    3379                      .dwattr $C$DW$379, DW_AT_name("inv")
    3380                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_inv")
    3381                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3382                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3383              $C$DW$380       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$8)
    3385                      .dwattr $C$DW$380, DW_AT_name("gconst")
    3386                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_gconst")
    3387                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3388                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3389                      .dwendtag $C$DW$T$46
    3390              
    3391              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    3392                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$46)
    3393                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3394              
    3395              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3396                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x544)
    3397              $C$DW$381       .dwtag  DW_TAG_member
    3398                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$47)
    3399                      .dwattr $C$DW$381, DW_AT_name("base_mem")
    3400                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_base_mem")
    3401                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3402                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3403              $C$DW$382       .dwtag  DW_TAG_member
    3404                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$22)
    3405                      .dwattr $C$DW$382, DW_AT_name("mem_count")
    3406                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_mem_count")
    3407                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    3408                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3409              $C$DW$383       .dwtag  DW_TAG_member
    3410                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$24)
    3411                      .dwattr $C$DW$383, DW_AT_name("answers")
    3412                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_answers")
    3413                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    3414                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3415              $C$DW$384       .dwtag  DW_TAG_member
    3416                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$24)
    3417                      .dwattr $C$DW$384, DW_AT_name("uStp")
    3418                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_uStp")
    3419                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    3420                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3421              $C$DW$385       .dwtag  DW_TAG_member
    3422                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$22)
    3423                      .dwattr $C$DW$385, DW_AT_name("nWords")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   76

    3424                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_nWords")
    3425                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    3426                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3427              $C$DW$386       .dwtag  DW_TAG_member
    3428                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$8)
    3429                      .dwattr $C$DW$386, DW_AT_name("nS")
    3430                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_nS")
    3431                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    3432                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3433              $C$DW$387       .dwtag  DW_TAG_member
    3434                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    3435                      .dwattr $C$DW$387, DW_AT_name("cm_scr")
    3436                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_cm_scr")
    3437                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    3438                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3439              $C$DW$388       .dwtag  DW_TAG_member
    3440                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$8)
    3441                      .dwattr $C$DW$388, DW_AT_name("bNeedUpdate")
    3442                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_bNeedUpdate")
    3443                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    3444                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3445              $C$DW$389       .dwtag  DW_TAG_member
    3446                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$23)
    3447                      .dwattr $C$DW$389, DW_AT_name("cm_anti_scr")
    3448                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_cm_anti_scr")
    3449                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    3450                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3451              $C$DW$390       .dwtag  DW_TAG_member
    3452                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$12)
    3453                      .dwattr $C$DW$390, DW_AT_name("cm_fg_scr")
    3454                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_cm_fg_scr")
    3455                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    3456                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3457              $C$DW$391       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$12)
    3459                      .dwattr $C$DW$391, DW_AT_name("cm_bk_scr")
    3460                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_cm_bk_scr")
    3461                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    3462                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3463              $C$DW$392       .dwtag  DW_TAG_member
    3464                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$8)
    3465                      .dwattr $C$DW$392, DW_AT_name("th_nbest")
    3466                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_th_nbest")
    3467                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    3468                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3469              $C$DW$393       .dwtag  DW_TAG_member
    3470                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$8)
    3471                      .dwattr $C$DW$393, DW_AT_name("nSpeech")
    3472                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_nSpeech")
    3473                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    3474                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3475              $C$DW$394       .dwtag  DW_TAG_member
    3476                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$8)
    3477                      .dwattr $C$DW$394, DW_AT_name("nNoise")
    3478                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_nNoise")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   77

    3479                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    3480                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3481              $C$DW$395       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$12)
    3483                      .dwattr $C$DW$395, DW_AT_name("speech_power")
    3484                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_speech_power")
    3485                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    3486                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3487              $C$DW$396       .dwtag  DW_TAG_member
    3488                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$12)
    3489                      .dwattr $C$DW$396, DW_AT_name("noise_power")
    3490                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_noise_power")
    3491                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    3492                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3493              $C$DW$397       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$12)
    3495                      .dwattr $C$DW$397, DW_AT_name("noise_power_sqr")
    3496                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_noise_power_sqr")
    3497                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    3498                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3499              $C$DW$398       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$8)
    3501                      .dwattr $C$DW$398, DW_AT_name("NSNR")
    3502                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_NSNR")
    3503                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    3504                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3505              $C$DW$399       .dwtag  DW_TAG_member
    3506                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$48)
    3507                      .dwattr $C$DW$399, DW_AT_name("H0")
    3508                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_H0")
    3509                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    3510                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3511              $C$DW$400       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$48)
    3513                      .dwattr $C$DW$400, DW_AT_name("H1")
    3514                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_H1")
    3515                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    3516                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3517              $C$DW$401       .dwtag  DW_TAG_member
    3518                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$23)
    3519                      .dwattr $C$DW$401, DW_AT_name("lgBeta")
    3520                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_lgBeta")
    3521                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    3522                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3523              $C$DW$402       .dwtag  DW_TAG_member
    3524                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$49)
    3525                      .dwattr $C$DW$402, DW_AT_name("acc_dif2_beta")
    3526                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_acc_dif2_beta")
    3527                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    3528                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3529              $C$DW$403       .dwtag  DW_TAG_member
    3530                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$8)
    3531                      .dwattr $C$DW$403, DW_AT_name("bCalced")
    3532                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_bCalced")
    3533                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   78

    3534                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3535              $C$DW$404       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$23)
    3537                      .dwattr $C$DW$404, DW_AT_name("sCH")
    3538                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_sCH")
    3539                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    3540                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3541              $C$DW$405       .dwtag  DW_TAG_member
    3542                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$49)
    3543                      .dwattr $C$DW$405, DW_AT_name("lAccum")
    3544                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_lAccum")
    3545                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    3546                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3547              $C$DW$406       .dwtag  DW_TAG_member
    3548                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$8)
    3549                      .dwattr $C$DW$406, DW_AT_name("adp_th")
    3550                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_adp_th")
    3551                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    3552                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3553                      .dwendtag $C$DW$T$50
    3554              
    3555              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    3556                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$50)
    3557                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    3558              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    3559                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    3560                      .dwattr $C$DW$T$92, DW_AT_address_class(0x17)
    3561              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3562                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    3563              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("Ptr")
    3564                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$3)
    3565                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3566              $C$DW$407       .dwtag  DW_TAG_TI_far_type
    3567              $C$DW$T$122     .dwtag  DW_TAG_const_type
    3568                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$407)
    3569              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
    3570                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    3571                      .dwattr $C$DW$T$123, DW_AT_address_class(0x17)
    3572              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3573                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3574                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3575                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3576              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3577                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3578                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3579                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3580              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3581                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3582                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3583                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3584              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    3585                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    3586                      .dwattr $C$DW$T$19, DW_AT_address_class(0x17)
    3587              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3588                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   79

    3589                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3590                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3591              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3592                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3593                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3594                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3595              $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    3596                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$8)
    3597                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    3598              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    3599                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
    3600                      .dwattr $C$DW$T$138, DW_AT_address_class(0x17)
    3601              
    3602              $C$DW$T$139     .dwtag  DW_TAG_array_type
    3603                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    3604                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    3605                      .dwattr $C$DW$T$139, DW_AT_byte_size(0x1a)
    3606              $C$DW$408       .dwtag  DW_TAG_subrange_type
    3607                      .dwattr $C$DW$408, DW_AT_upper_bound(0x0c)
    3608                      .dwendtag $C$DW$T$139
    3609              
    3610              
    3611              $C$DW$T$141     .dwtag  DW_TAG_array_type
    3612                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$137)
    3613                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    3614              $C$DW$409       .dwtag  DW_TAG_subrange_type
    3615                      .dwendtag $C$DW$T$141
    3616              
    3617              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    3618                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$8)
    3619                      .dwattr $C$DW$T$23, DW_AT_address_class(0x17)
    3620              
    3621              $C$DW$T$41      .dwtag  DW_TAG_array_type
    3622                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$8)
    3623                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3624                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e)
    3625              $C$DW$410       .dwtag  DW_TAG_subrange_type
    3626                      .dwattr $C$DW$410, DW_AT_upper_bound(0x1d)
    3627                      .dwendtag $C$DW$T$41
    3628              
    3629              
    3630              $C$DW$T$47      .dwtag  DW_TAG_array_type
    3631                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$8)
    3632                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3633                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x514)
    3634              $C$DW$411       .dwtag  DW_TAG_subrange_type
    3635                      .dwattr $C$DW$411, DW_AT_upper_bound(0x513)
    3636                      .dwendtag $C$DW$T$47
    3637              
    3638              
    3639              $C$DW$T$53      .dwtag  DW_TAG_array_type
    3640                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
    3641                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3642                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x100)
    3643              $C$DW$412       .dwtag  DW_TAG_subrange_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   80

    3644                      .dwattr $C$DW$412, DW_AT_upper_bound(0xff)
    3645                      .dwendtag $C$DW$T$53
    3646              
    3647              
    3648              $C$DW$T$54      .dwtag  DW_TAG_array_type
    3649                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$8)
    3650                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3651                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x10)
    3652              $C$DW$413       .dwtag  DW_TAG_subrange_type
    3653                      .dwattr $C$DW$413, DW_AT_upper_bound(0x0f)
    3654                      .dwendtag $C$DW$T$54
    3655              
    3656              
    3657              $C$DW$T$55      .dwtag  DW_TAG_array_type
    3658                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$8)
    3659                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3660                      .dwattr $C$DW$T$55, DW_AT_byte_size(0xe0)
    3661              $C$DW$414       .dwtag  DW_TAG_subrange_type
    3662                      .dwattr $C$DW$414, DW_AT_upper_bound(0x0d)
    3663              $C$DW$415       .dwtag  DW_TAG_subrange_type
    3664                      .dwattr $C$DW$415, DW_AT_upper_bound(0x0f)
    3665                      .dwendtag $C$DW$T$55
    3666              
    3667              $C$DW$416       .dwtag  DW_TAG_TI_far_type
    3668                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$8)
    3669              $C$DW$T$56      .dwtag  DW_TAG_const_type
    3670                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$416)
    3671              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    3672                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3673                      .dwattr $C$DW$T$57, DW_AT_address_class(0x17)
    3674              
    3675              $C$DW$T$58      .dwtag  DW_TAG_array_type
    3676                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3677                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3678                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x20)
    3679              $C$DW$417       .dwtag  DW_TAG_subrange_type
    3680                      .dwattr $C$DW$417, DW_AT_upper_bound(0x0f)
    3681                      .dwendtag $C$DW$T$58
    3682              
    3683              
    3684              $C$DW$T$62      .dwtag  DW_TAG_array_type
    3685                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$8)
    3686                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3687                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x80)
    3688              $C$DW$418       .dwtag  DW_TAG_subrange_type
    3689                      .dwattr $C$DW$418, DW_AT_upper_bound(0x7f)
    3690                      .dwendtag $C$DW$T$62
    3691              
    3692              
    3693              $C$DW$T$63      .dwtag  DW_TAG_array_type
    3694                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$8)
    3695                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3696                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x1a)
    3697              $C$DW$419       .dwtag  DW_TAG_subrange_type
    3698                      .dwattr $C$DW$419, DW_AT_upper_bound(0x19)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   81

    3699                      .dwendtag $C$DW$T$63
    3700              
    3701              
    3702              $C$DW$T$81      .dwtag  DW_TAG_array_type
    3703                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$8)
    3704                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3705                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x20)
    3706              $C$DW$420       .dwtag  DW_TAG_subrange_type
    3707                      .dwattr $C$DW$420, DW_AT_upper_bound(0x1f)
    3708                      .dwendtag $C$DW$T$81
    3709              
    3710              
    3711              $C$DW$T$87      .dwtag  DW_TAG_array_type
    3712                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$8)
    3713                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3714                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x14)
    3715              $C$DW$421       .dwtag  DW_TAG_subrange_type
    3716                      .dwattr $C$DW$421, DW_AT_upper_bound(0x13)
    3717                      .dwendtag $C$DW$T$87
    3718              
    3719              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3720                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3721                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3722                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3723              $C$DW$T$146     .dwtag  DW_TAG_typedef, DW_AT_name("Bool")
    3724                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$9)
    3725                      .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    3726              
    3727              $C$DW$T$29      .dwtag  DW_TAG_array_type
    3728                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$9)
    3729                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3730                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3731              $C$DW$422       .dwtag  DW_TAG_subrange_type
    3732                      .dwattr $C$DW$422, DW_AT_upper_bound(0x00)
    3733                      .dwendtag $C$DW$T$29
    3734              
    3735              
    3736              $C$DW$T$35      .dwtag  DW_TAG_array_type
    3737                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    3738                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3739                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3740              $C$DW$423       .dwtag  DW_TAG_subrange_type
    3741                      .dwattr $C$DW$423, DW_AT_upper_bound(0x01)
    3742                      .dwendtag $C$DW$T$35
    3743              
    3744              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3745                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$9)
    3746                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    3747              $C$DW$424       .dwtag  DW_TAG_TI_far_type
    3748                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$9)
    3749              $C$DW$T$131     .dwtag  DW_TAG_const_type
    3750                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$424)
    3751              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    3752                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    3753                      .dwattr $C$DW$T$132, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   82

    3754              
    3755              $C$DW$T$151     .dwtag  DW_TAG_array_type
    3756                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$9)
    3757                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    3758                      .dwattr $C$DW$T$151, DW_AT_byte_size(0x10)
    3759              $C$DW$425       .dwtag  DW_TAG_subrange_type
    3760                      .dwattr $C$DW$425, DW_AT_upper_bound(0x0f)
    3761                      .dwendtag $C$DW$T$151
    3762              
    3763              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    3764                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$9)
    3765                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3766              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    3767                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
    3768                      .dwattr $C$DW$T$24, DW_AT_address_class(0x17)
    3769              
    3770              $C$DW$T$39      .dwtag  DW_TAG_array_type
    3771                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$22)
    3772                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3773                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    3774              $C$DW$426       .dwtag  DW_TAG_subrange_type
    3775                      .dwattr $C$DW$426, DW_AT_upper_bound(0x13)
    3776                      .dwendtag $C$DW$T$39
    3777              
    3778              
    3779              $C$DW$T$88      .dwtag  DW_TAG_array_type
    3780                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$22)
    3781                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3782                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x02)
    3783              $C$DW$427       .dwtag  DW_TAG_subrange_type
    3784                      .dwattr $C$DW$427, DW_AT_upper_bound(0x01)
    3785                      .dwendtag $C$DW$T$88
    3786              
    3787              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3788                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3789                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3790                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3791              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("Int")
    3792                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$10)
    3793                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3794              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3795                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3796                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3797                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    3798              $C$DW$T$12      .dwtag  DW_TAG_base_type
    3799                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3800                      .dwattr $C$DW$T$12, DW_AT_name("long")
    3801                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    3802              $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("Int32")
    3803                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$12)
    3804                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    3805              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    3806                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$12)
    3807                      .dwattr $C$DW$T$49, DW_AT_address_class(0x17)
    3808              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   83

    3809              $C$DW$T$64      .dwtag  DW_TAG_array_type
    3810                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
    3811                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3812                      .dwattr $C$DW$T$64, DW_AT_byte_size(0xd0)
    3813              $C$DW$428       .dwtag  DW_TAG_subrange_type
    3814                      .dwattr $C$DW$428, DW_AT_upper_bound(0x67)
    3815                      .dwendtag $C$DW$T$64
    3816              
    3817              
    3818              $C$DW$T$67      .dwtag  DW_TAG_array_type
    3819                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$12)
    3820                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3821                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x20)
    3822              $C$DW$429       .dwtag  DW_TAG_subrange_type
    3823                      .dwattr $C$DW$429, DW_AT_upper_bound(0x0f)
    3824                      .dwendtag $C$DW$T$67
    3825              
    3826              $C$DW$T$13      .dwtag  DW_TAG_base_type
    3827                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3828                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3829                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    3830              $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
    3831                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$13)
    3832                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3833              $C$DW$T$161     .dwtag  DW_TAG_typedef, DW_AT_name("pMemory")
    3834                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
    3835                      .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    3836              $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3837                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$13)
    3838                      .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    3839              $C$DW$T$14      .dwtag  DW_TAG_base_type
    3840                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3841                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    3842                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    3843                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    3844                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    3845              $C$DW$T$15      .dwtag  DW_TAG_base_type
    3846                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3847                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3848                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    3849                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    3850                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    3851              $C$DW$T$16      .dwtag  DW_TAG_base_type
    3852                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3853                      .dwattr $C$DW$T$16, DW_AT_name("float")
    3854                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    3855              $C$DW$T$17      .dwtag  DW_TAG_base_type
    3856                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3857                      .dwattr $C$DW$T$17, DW_AT_name("double")
    3858                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    3859              $C$DW$T$18      .dwtag  DW_TAG_base_type
    3860                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3861                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    3862                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    3863              $C$DW$T$76      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   84

    3864                      .dwattr $C$DW$T$76, DW_AT_encoding(DW_ATE_signed_char)
    3865                      .dwattr $C$DW$T$76, DW_AT_name("signed char")
    3866                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x01)
    3867              $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("Char")
    3868                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$76)
    3869                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3870              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    3871                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    3872                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    3873              $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    3874                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$77)
    3875                      .dwattr $C$DW$T$80, DW_AT_address_class(0x17)
    3876              $C$DW$430       .dwtag  DW_TAG_TI_far_type
    3877                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$76)
    3878              $C$DW$T$110     .dwtag  DW_TAG_const_type
    3879                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$430)
    3880              $C$DW$T$111     .dwtag  DW_TAG_pointer_type
    3881                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
    3882                      .dwattr $C$DW$T$111, DW_AT_address_class(0x17)
    3883              
    3884              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3885                      .dwattr $C$DW$T$51, DW_AT_name("ele")
    3886                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x03)
    3887              $C$DW$431       .dwtag  DW_TAG_member
    3888                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$9)
    3889                      .dwattr $C$DW$431, DW_AT_name("sym")
    3890                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_sym")
    3891                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3892                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3893              $C$DW$432       .dwtag  DW_TAG_member
    3894                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$9)
    3895                      .dwattr $C$DW$432, DW_AT_name("idx_flag")
    3896                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_idx_flag")
    3897                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3898                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3899              $C$DW$433       .dwtag  DW_TAG_member
    3900                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$9)
    3901                      .dwattr $C$DW$433, DW_AT_name("next")
    3902                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_next")
    3903                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3904                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3905                      .dwendtag $C$DW$T$51
    3906              
    3907              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    3908                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$51)
    3909                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3910              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    3911                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    3912                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    3913              
    3914              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3915                      .dwattr $C$DW$T$52, DW_AT_name("fileConfiguration")
    3916                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3917              $C$DW$434       .dwtag  DW_TAG_member
    3918                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   85

    3919                      .dwattr $C$DW$434, DW_AT_name("byteMu")
    3920                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_byteMu")
    3921                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3922                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3923              $C$DW$435       .dwtag  DW_TAG_member
    3924                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$8)
    3925                      .dwattr $C$DW$435, DW_AT_name("byteVar")
    3926                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_byteVar")
    3927                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3928                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3929                      .dwendtag $C$DW$T$52
    3930              
    3931              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("fileConfiguration_t")
    3932                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$52)
    3933                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3934              $C$DW$T$105     .dwtag  DW_TAG_pointer_type
    3935                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    3936                      .dwattr $C$DW$T$105, DW_AT_address_class(0x17)
    3937              
    3938              $C$DW$T$93      .dwtag  DW_TAG_structure_type
    3939                      .dwattr $C$DW$T$93, DW_AT_name("gmhmm_type")
    3940                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x7fe)
    3941              $C$DW$436       .dwtag  DW_TAG_member
    3942                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$22)
    3943                      .dwattr $C$DW$436, DW_AT_name("avedepth")
    3944                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_avedepth")
    3945                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3946                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3947              $C$DW$437       .dwtag  DW_TAG_member
    3948                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$22)
    3949                      .dwattr $C$DW$437, DW_AT_name("bestdepth")
    3950                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_bestdepth")
    3951                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3952                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3953              $C$DW$438       .dwtag  DW_TAG_member
    3954                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$22)
    3955                      .dwattr $C$DW$438, DW_AT_name("index_mean")
    3956                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_index_mean")
    3957                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3958                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3959              $C$DW$439       .dwtag  DW_TAG_member
    3960                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$22)
    3961                      .dwattr $C$DW$439, DW_AT_name("signal_cnt")
    3962                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_signal_cnt")
    3963                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3964                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3965              $C$DW$440       .dwtag  DW_TAG_member
    3966                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$8)
    3967                      .dwattr $C$DW$440, DW_AT_name("buf_idx")
    3968                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_buf_idx")
    3969                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3970                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3971              $C$DW$441       .dwtag  DW_TAG_member
    3972                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    3973                      .dwattr $C$DW$441, DW_AT_name("speech_detected")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:30 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0522410                         PAGE   86

    3974                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_speech_detected")
    3975                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3976                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3977              $C$DW$442       .dwtag  DW_TAG_member
    3978                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$22)
    3979                      .dwattr $C$DW$442, DW_AT_name("mfcc_cnt")
    3980                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_mfcc_cnt")
    3981                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3982                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3983              $C$DW$443       .dwtag  DW_TAG_member
    3984                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$22)
    3985                      .dwattr $C$DW$443, DW_AT_name("nbr_cpy")
    3986                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_nbr_cpy")
    3987                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3988                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3989              $C$DW$444       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$8)
    3991                      .dwattr $C$DW$444, DW_AT_name("last_sig")
    3992                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_last_sig")
    3993                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3994                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3995              $C$DW$445       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$53)
