TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE    1

    9755              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:31 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         000085 000D 
    7384 000087 4A1B          B $C$L135 ; |1211| 
    7385                                                      ; branch occurs ; |1211| 
    7386 000089       $C$L134:    
    7387                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    7388 000089 A96D          MOV *AR3(#13), AR1 ; |1213| 
         00008b 000D 
    7389 00008d ED0C          MOV dbl(*SP(#6)), XAR5
         00008f DF   
    7390 000090 A477          MOV *AR3(short(#3)), T0 ; |1213| 
    7391 000092 D808          SUB AR1, *SP(#4), AR1 ; |1213| 
         000094 99   
    7392              $C$DW$453       .dwtag  DW_TAG_TI_branch
    7393                      .dwattr $C$DW$453, DW_AT_low_pc(0x00)
    7394                      .dwattr $C$DW$453, DW_AT_name("_q15_x")
    7395                      .dwattr $C$DW$453, DW_AT_TI_call
    7396              
    7397 000095 6C00          CALL #_q15_x ; |1213| 
         000097 0000!
    7398 000099 2390  ||      MOV AR1, AC0
    7399              
    7400                                                      ; call occurs [#_q15_x] ; |1213| 
    7401 00009b D6AD          ADD *AR5(#13), AC0, AC0 ; |1213| 
         00009d 0000 
         00009f 0D   
    7402 0000a0 C0AD          MOV AC0, *AR5(#13) ; |1213| 
         0000a2 000D 
    7403 0000a4       $C$L135:    
    7404                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    7405 0000a4 ED0C          MOV dbl(*SP(#6)), XAR3
         0000a6 BF   
    7406 0000a7 760A          MOV #2560, AR2 ; |1214| 
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  156

         0000a9 00A8 
    7407 0000ab A96D          MOV *AR3(#13), AR1 ; |1214| 
         0000ad 000D 
    7408 0000af 1298          CMP AR1 >= AR2, TC1 ; |1214| 
         0000b1 A0   
    7409 0000b2 6364          BCC $C$L136,TC1 ; |1214| 
    7410                                                      ; branchcc occurs ; |1214| 
    7411                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    7412 0000b4 FB6D          MOV #2560, *AR3(#13) ; |1215| 
         0000b6 0A00 
         0000b8 000D 
    7413 0000ba       $C$L136:    
    7414                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    7415 0000ba ED0C          MOV dbl(*SP(#6)), XAR3
         0000bc BF   
    7416 0000bd F079          CMP *AR3(short(#4)) == #9, TC1 ; |1218| 
         0000bf 0009 
    7417 0000c1 6474          BCC $C$L137,!TC1 ; |1218| 
    7418                                                      ; branchcc occurs ; |1218| 
    7419                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    7420 0000c3 A96D          MOV *AR3(#13), AR1 ; |1220| 
         0000c5 000D 
    7421 0000c7 C96D          MOV AR1, *AR3(#15) ; |1220| 
         0000c9 000F 
    7422 0000cb       $C$L137:    
    7423                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    7424 0000cb A408          MOV *SP(#4), T0 ; |1223| 
    7425                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    7426 0000cd 4E08          AADD #8, SP
    7427                      .dwcfi  cfa_offset, 2
    7428 0000cf 50D4          POPBOTH XAR5
    7429                      .dwcfi  restore_reg, 26
    7430                      .dwcfi  cfa_offset, 1
    7431              $C$DW$454       .dwtag  DW_TAG_TI_branch
    7432                      .dwattr $C$DW$454, DW_AT_low_pc(0x00)
    7433                      .dwattr $C$DW$454, DW_AT_TI_return
    7434 0000d1 4804          RET
    7435                                                      ; return occurs
    7436                      .dwattr $C$DW$444, DW_AT_TI_end_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CS
    7437                      .dwattr $C$DW$444, DW_AT_TI_end_line(0x4c8)
    7438                      .dwattr $C$DW$444, DW_AT_TI_end_column(0x01)
    7439                      .dwendentry
    7440                      .dwendtag $C$DW$444
    7441              
    7442              ;******************************************************************************
    7443              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    7444              ;******************************************************************************
    7445                      .global _q15_x
    7446                      .global _log_polyfit
    7447                      .global __mpyli
    7448                      .global __divli
    7449              
    7450              ;*******************************************************************************
    7451              ;* TYPE INFORMATION                                                            *
    7452              ;*******************************************************************************
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  157

    7453              
    7454              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7455                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
    7456              $C$DW$455       .dwtag  DW_TAG_member
    7457                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$8)
    7458                      .dwattr $C$DW$455, DW_AT_name("num")
    7459                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_num")
    7460                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7461                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    7462              $C$DW$456       .dwtag  DW_TAG_member
    7463                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$8)
    7464                      .dwattr $C$DW$456, DW_AT_name("x1")
    7465                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_x1")
    7466                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7467                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    7468              $C$DW$457       .dwtag  DW_TAG_member
    7469                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$8)
    7470                      .dwattr $C$DW$457, DW_AT_name("x2")
    7471                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_x2")
    7472                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7473                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    7474                      .dwendtag $C$DW$T$19
    7475              
    7476              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    7477                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$19)
    7478                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    7479              $C$DW$458       .dwtag  DW_TAG_TI_far_type
    7480                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$57)
    7481              $C$DW$T$58      .dwtag  DW_TAG_const_type
    7482                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$458)
    7483              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    7484                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    7485                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    7486              
    7487              $C$DW$T$92      .dwtag  DW_TAG_array_type
    7488                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$58)
    7489                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7490                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x180)
    7491              $C$DW$459       .dwtag  DW_TAG_subrange_type
    7492                      .dwattr $C$DW$459, DW_AT_upper_bound(0x7f)
    7493                      .dwendtag $C$DW$T$92
    7494              
    7495              
    7496              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7497                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x03)
    7498              $C$DW$460       .dwtag  DW_TAG_member
    7499                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$8)
    7500                      .dwattr $C$DW$460, DW_AT_name("norm0")
    7501                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_norm0")
    7502                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7503                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    7504              $C$DW$461       .dwtag  DW_TAG_member
    7505                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$8)
    7506                      .dwattr $C$DW$461, DW_AT_name("norm1")
    7507                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_norm1")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  158

    7508                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7509                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    7510              $C$DW$462       .dwtag  DW_TAG_member
    7511                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$8)
    7512                      .dwattr $C$DW$462, DW_AT_name("norm2")
    7513                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_norm2")
    7514                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7515                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7516                      .dwendtag $C$DW$T$20
    7517              
    7518              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("NormType")
    7519                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$20)
    7520                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7521              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    7522                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    7523                      .dwattr $C$DW$T$94, DW_AT_address_class(0x17)
    7524              
    7525              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    7526                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    7527              $C$DW$463       .dwtag  DW_TAG_member
    7528                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$21)
    7529                      .dwattr $C$DW$463, DW_AT_name("max_mem_usage")
    7530                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_max_mem_usage")
    7531                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7532                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7533              $C$DW$464       .dwtag  DW_TAG_member
    7534                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$21)
    7535                      .dwattr $C$DW$464, DW_AT_name("n_terminals")
    7536                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_n_terminals")
    7537                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7538                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    7539              $C$DW$465       .dwtag  DW_TAG_member
    7540                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$21)
    7541                      .dwattr $C$DW$465, DW_AT_name("n_monophones")
    7542                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_n_monophones")
    7543                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7544                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7545              $C$DW$466       .dwtag  DW_TAG_member
    7546                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$22)
    7547                      .dwattr $C$DW$466, DW_AT_name("hlrTreeBase")
    7548                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_hlrTreeBase")
    7549                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7550                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7551              $C$DW$467       .dwtag  DW_TAG_member
    7552                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$23)
    7553                      .dwattr $C$DW$467, DW_AT_name("hlrTerminal")
    7554                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_hlrTerminal")
    7555                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7556                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7557              $C$DW$468       .dwtag  DW_TAG_member
    7558                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$22)
    7559                      .dwattr $C$DW$468, DW_AT_name("pHMM2phone")
    7560                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_pHMM2phone")
    7561                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7562                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  159

    7563              $C$DW$469       .dwtag  DW_TAG_member
    7564                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$23)
    7565                      .dwattr $C$DW$469, DW_AT_name("hlrTransformIndex")
    7566                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_hlrTransformIndex")
    7567                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7568                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7569              $C$DW$470       .dwtag  DW_TAG_member
    7570                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$21)
    7571                      .dwattr $C$DW$470, DW_AT_name("hlr_TRANSFORM_SIZE")
    7572                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    7573                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7574                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7575              $C$DW$471       .dwtag  DW_TAG_member
    7576                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$22)
    7577                      .dwattr $C$DW$471, DW_AT_name("hlrTransforms")
    7578                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_hlrTransforms")
    7579                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7580                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7581              $C$DW$472       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$22)
    7583                      .dwattr $C$DW$472, DW_AT_name("pSegStat_dif1")
    7584                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_pSegStat_dif1")
    7585                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7586                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7587              $C$DW$473       .dwtag  DW_TAG_member
    7588                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$22)
    7589                      .dwattr $C$DW$473, DW_AT_name("pSegStat_dif2")
    7590                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_pSegStat_dif2")
    7591                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7592                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7593              $C$DW$474       .dwtag  DW_TAG_member
    7594                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    7595                      .dwattr $C$DW$474, DW_AT_name("pEnhanced")
    7596                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_pEnhanced")
    7597                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7598                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7599              $C$DW$475       .dwtag  DW_TAG_member
    7600                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$22)
    7601                      .dwattr $C$DW$475, DW_AT_name("bk_node_cnt")
    7602                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_bk_node_cnt")
    7603                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7604                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7605                      .dwendtag $C$DW$T$24
    7606              
    7607              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    7608                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$24)
    7609                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7610              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    7611                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    7612                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    7613              
    7614              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7615                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    7616              $C$DW$476       .dwtag  DW_TAG_member
    7617                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  160

    7618                      .dwattr $C$DW$476, DW_AT_name("sym_code")
    7619                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_sym_code")
    7620                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7621                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7622              $C$DW$477       .dwtag  DW_TAG_member
    7623                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$9)
    7624                      .dwattr $C$DW$477, DW_AT_name("start_cell")
    7625                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_start_cell")
    7626                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7627                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7628              $C$DW$478       .dwtag  DW_TAG_member
    7629                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$9)
    7630                      .dwattr $C$DW$478, DW_AT_name("depth")
    7631                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_depth")
    7632                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7633                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7634                      .dwendtag $C$DW$T$25
    7635              
    7636              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    7637                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$25)
    7638                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    7639              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    7640                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    7641                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
    7642              
    7643              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7644                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x03)
    7645              $C$DW$479       .dwtag  DW_TAG_member
    7646                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$8)
    7647                      .dwattr $C$DW$479, DW_AT_name("scr")
    7648                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_scr")
    7649                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7650                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7651              $C$DW$480       .dwtag  DW_TAG_member
    7652                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$9)
    7653                      .dwattr $C$DW$480, DW_AT_name("sym")
    7654                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_sym")
    7655                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7656                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7657              $C$DW$481       .dwtag  DW_TAG_member
    7658                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$9)
    7659                      .dwattr $C$DW$481, DW_AT_name("frm")
    7660                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_frm")
    7661                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7662                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7663                      .dwendtag $C$DW$T$26
    7664              
    7665              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    7666                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$26)
    7667                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    7668              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    7669                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    7670                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
    7671              
    7672              $C$DW$T$27      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  161

    7673                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    7674              $C$DW$482       .dwtag  DW_TAG_member
    7675                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$9)
    7676                      .dwattr $C$DW$482, DW_AT_name("frm")
    7677                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_frm")
    7678                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7679                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7680              $C$DW$483       .dwtag  DW_TAG_member
    7681                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$9)
    7682                      .dwattr $C$DW$483, DW_AT_name("beam_idx")
    7683                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_beam_idx")
    7684                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7685                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7686                      .dwendtag $C$DW$T$27
    7687              
    7688              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    7689                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$27)
    7690                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    7691              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    7692                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    7693                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    7694              
    7695              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7696                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    7697              $C$DW$484       .dwtag  DW_TAG_member
    7698                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$9)
    7699                      .dwattr $C$DW$484, DW_AT_name("n_hmm")
    7700                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_n_hmm")
    7701                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7702                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7703              $C$DW$485       .dwtag  DW_TAG_member
    7704                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$9)
    7705                      .dwattr $C$DW$485, DW_AT_name("n_sym")
    7706                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_n_sym")
    7707                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7708                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7709              $C$DW$486       .dwtag  DW_TAG_member
    7710                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$9)
    7711                      .dwattr $C$DW$486, DW_AT_name("n_word")
    7712                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_n_word")
    7713                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7714                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7715              $C$DW$487       .dwtag  DW_TAG_member
    7716                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$9)
    7717                      .dwattr $C$DW$487, DW_AT_name("n_set")
    7718                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_n_set")
    7719                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7720                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7721              $C$DW$488       .dwtag  DW_TAG_member
    7722                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$9)
    7723                      .dwattr $C$DW$488, DW_AT_name("n_hmm_set")
    7724                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_n_hmm_set")
    7725                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7726                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7727              $C$DW$489       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  162

    7728                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$9)
    7729                      .dwattr $C$DW$489, DW_AT_name("start")
    7730                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_start")
    7731                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7732                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7733              $C$DW$490       .dwtag  DW_TAG_member
    7734                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$9)
    7735                      .dwattr $C$DW$490, DW_AT_name("stop")
    7736                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_stop")
    7737                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7738                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7739              $C$DW$491       .dwtag  DW_TAG_member
    7740                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$28)
    7741                      .dwattr $C$DW$491, DW_AT_name("symlist")
    7742                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_symlist")
    7743                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7744                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7745                      .dwendtag $C$DW$T$29
    7746              
    7747              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    7748                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$29)
    7749                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    7750              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    7751                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    7752                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    7753              
    7754              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7755                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    7756              $C$DW$492       .dwtag  DW_TAG_member
    7757                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$9)
    7758                      .dwattr $C$DW$492, DW_AT_name("high_pos")
    7759                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_high_pos")
    7760                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7761                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7762              $C$DW$493       .dwtag  DW_TAG_member
    7763                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$9)
    7764                      .dwattr $C$DW$493, DW_AT_name("cur_pos")
    7765                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_cur_pos")
    7766                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7767                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7768                      .dwendtag $C$DW$T$30
    7769              
    7770              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    7771                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    7772                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    7773              
    7774              $C$DW$T$32      .dwtag  DW_TAG_array_type
    7775                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    7776                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    7777                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    7778              $C$DW$494       .dwtag  DW_TAG_subrange_type
    7779                      .dwattr $C$DW$494, DW_AT_upper_bound(0x01)
    7780                      .dwendtag $C$DW$T$32
    7781              
    7782              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  163

    7783              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7784                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
    7785              $C$DW$495       .dwtag  DW_TAG_member
    7786                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$31)
    7787                      .dwattr $C$DW$495, DW_AT_name("state")
    7788                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_state")
    7789                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7790                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    7791              $C$DW$496       .dwtag  DW_TAG_member
    7792                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$32)
    7793                      .dwattr $C$DW$496, DW_AT_name("sym")
    7794                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_sym")
    7795                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7796                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    7797              $C$DW$497       .dwtag  DW_TAG_member
    7798                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$31)
    7799                      .dwattr $C$DW$497, DW_AT_name("beam")
    7800                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_beam")
    7801                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7802                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    7803              $C$DW$498       .dwtag  DW_TAG_member
    7804                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$31)
    7805                      .dwattr $C$DW$498, DW_AT_name("time")
    7806                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_time")
    7807                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7808                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    7809                      .dwendtag $C$DW$T$33
    7810              
    7811              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    7812                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$33)
    7813                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    7814              
    7815              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7816                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x03)
    7817              $C$DW$499       .dwtag  DW_TAG_member
    7818                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$34)
    7819                      .dwattr $C$DW$499, DW_AT_name("cur_sym")
    7820                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_cur_sym")
    7821                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7822                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    7823              $C$DW$500       .dwtag  DW_TAG_member
    7824                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$9)
    7825                      .dwattr $C$DW$500, DW_AT_name("cur_state")
    7826                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_cur_state")
    7827                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7828                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    7829                      .dwendtag $C$DW$T$35
    7830              
    7831              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    7832                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    7833                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    7834              
    7835              $C$DW$T$82      .dwtag  DW_TAG_array_type
    7836                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    7837                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  164

    7838                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x06)
    7839              $C$DW$501       .dwtag  DW_TAG_subrange_type
    7840                      .dwattr $C$DW$501, DW_AT_upper_bound(0x01)
    7841                      .dwendtag $C$DW$T$82
    7842              
    7843              
    7844              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7845                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    7846              $C$DW$502       .dwtag  DW_TAG_member
    7847                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$9)
    7848                      .dwattr $C$DW$502, DW_AT_name("max_nbr_syms")
    7849                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_max_nbr_syms")
    7850                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7851                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    7852              $C$DW$503       .dwtag  DW_TAG_member
    7853                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$8)
    7854                      .dwattr $C$DW$503, DW_AT_name("nbr_syms")
    7855                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_nbr_syms")
    7856                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7857                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    7858              $C$DW$504       .dwtag  DW_TAG_member
    7859                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$22)
    7860                      .dwattr $C$DW$504, DW_AT_name("sym2pos")
    7861                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_sym2pos")
    7862                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7863                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    7864              $C$DW$505       .dwtag  DW_TAG_member
    7865                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$36)
    7866                      .dwattr $C$DW$505, DW_AT_name("syms")
    7867                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_syms")
    7868                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7869                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    7870                      .dwendtag $C$DW$T$37
    7871              
    7872              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    7873                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$37)
    7874                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    7875              
    7876              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7877                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x16)
    7878              $C$DW$506       .dwtag  DW_TAG_member
    7879                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$8)
    7880                      .dwattr $C$DW$506, DW_AT_name("scr")
    7881                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_scr")
    7882                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7883                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    7884              $C$DW$507       .dwtag  DW_TAG_member
    7885                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$8)
    7886                      .dwattr $C$DW$507, DW_AT_name("n_ans")
    7887                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_n_ans")
    7888                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7889                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    7890              $C$DW$508       .dwtag  DW_TAG_member
    7891                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$38)
    7892                      .dwattr $C$DW$508, DW_AT_name("answers")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  165

    7893                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_answers")
    7894                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7895                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    7896                      .dwendtag $C$DW$T$39
    7897              
    7898              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    7899                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$39)
    7900                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    7901              
    7902              $C$DW$T$42      .dwtag  DW_TAG_array_type
    7903                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    7904                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7905                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x294)
    7906              $C$DW$509       .dwtag  DW_TAG_subrange_type
    7907                      .dwattr $C$DW$509, DW_AT_upper_bound(0x1d)
    7908                      .dwendtag $C$DW$T$42
    7909              
    7910              
    7911              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7912                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x2b3)
    7913              $C$DW$510       .dwtag  DW_TAG_member
    7914                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$8)
    7915                      .dwattr $C$DW$510, DW_AT_name("n_bests")
    7916                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_n_bests")
    7917                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7918                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    7919              $C$DW$511       .dwtag  DW_TAG_member
    7920                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$40)
    7921                      .dwattr $C$DW$511, DW_AT_name("best_idx")
    7922                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_best_idx")
    7923                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7924                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    7925              $C$DW$512       .dwtag  DW_TAG_member
    7926                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$42)
    7927                      .dwattr $C$DW$512, DW_AT_name("elem")
    7928                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_elem")
    7929                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7930                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    7931                      .dwendtag $C$DW$T$43
    7932              
    7933              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    7934                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$43)
    7935                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    7936              
    7937              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7938                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x14)
    7939              $C$DW$513       .dwtag  DW_TAG_member
    7940                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$21)
    7941                      .dwattr $C$DW$513, DW_AT_name("alpha_p")
    7942                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_alpha_p")
    7943                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7944                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    7945              $C$DW$514       .dwtag  DW_TAG_member
    7946                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$21)
    7947                      .dwattr $C$DW$514, DW_AT_name("sAlpha")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  166

    7948                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_sAlpha")
    7949                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7950                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    7951              $C$DW$515       .dwtag  DW_TAG_member
    7952                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$8)
    7953                      .dwattr $C$DW$515, DW_AT_name("sBeta")
    7954                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_sBeta")
    7955                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7956                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    7957              $C$DW$516       .dwtag  DW_TAG_member
    7958                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$8)
    7959                      .dwattr $C$DW$516, DW_AT_name("lambdaLTEhigherE")
    7960                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    7961                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7962                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    7963              $C$DW$517       .dwtag  DW_TAG_member
    7964                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$8)
    7965                      .dwattr $C$DW$517, DW_AT_name("frm_count")
    7966                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_frm_count")
    7967                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7968                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    7969              $C$DW$518       .dwtag  DW_TAG_member
    7970                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$21)
    7971                      .dwattr $C$DW$518, DW_AT_name("prob_sp")
    7972                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_prob_sp")
    7973                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7974                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    7975              $C$DW$519       .dwtag  DW_TAG_member
    7976                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$22)
    7977                      .dwattr $C$DW$519, DW_AT_name("s_noise_floor")
    7978                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_s_noise_floor")
    7979                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7980                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    7981              $C$DW$520       .dwtag  DW_TAG_member
    7982                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$22)
    7983                      .dwattr $C$DW$520, DW_AT_name("snr")
    7984                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_snr")
    7985                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7986                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    7987              $C$DW$521       .dwtag  DW_TAG_member
    7988                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$22)
    7989                      .dwattr $C$DW$521, DW_AT_name("ps_long_term_noise")
    7990                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_ps_long_term_noise")
    7991                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7992                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    7993              $C$DW$522       .dwtag  DW_TAG_member
    7994                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$8)
    7995                      .dwattr $C$DW$522, DW_AT_name("frmEn")
    7996                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_frmEn")
    7997                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7998                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    7999              $C$DW$523       .dwtag  DW_TAG_member
    8000                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$8)
    8001                      .dwattr $C$DW$523, DW_AT_name("meanEn")
    8002                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_meanEn")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  167

    8003                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8004                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    8005              $C$DW$524       .dwtag  DW_TAG_member
    8006                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$8)
    8007                      .dwattr $C$DW$524, DW_AT_name("prevMeanEn")
    8008                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_prevMeanEn")
    8009                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8010                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    8011              $C$DW$525       .dwtag  DW_TAG_member
    8012                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$8)
    8013                      .dwattr $C$DW$525, DW_AT_name("noiselvl")
    8014                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_noiselvl")
    8015                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8016                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    8017              $C$DW$526       .dwtag  DW_TAG_member
    8018                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$8)
    8019                      .dwattr $C$DW$526, DW_AT_name("lambdaLTE")
    8020                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_lambdaLTE")
    8021                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8022                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    8023              $C$DW$527       .dwtag  DW_TAG_member
    8024                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$8)
    8025                      .dwattr $C$DW$527, DW_AT_name("nbSpeechFrame")
    8026                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_nbSpeechFrame")
    8027                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8028                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    8029              $C$DW$528       .dwtag  DW_TAG_member
    8030                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$8)
    8031                      .dwattr $C$DW$528, DW_AT_name("hangOver")
    8032                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_hangOver")
    8033                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8034                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    8035                      .dwendtag $C$DW$T$44
    8036              
    8037              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    8038                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
    8039                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    8040              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    8041                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    8042                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    8043              
    8044              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    8045                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x03)
    8046              $C$DW$529       .dwtag  DW_TAG_member
    8047                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$8)
    8048                      .dwattr $C$DW$529, DW_AT_name("mean")
    8049                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_mean")
    8050                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8051                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    8052              $C$DW$530       .dwtag  DW_TAG_member
    8053                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$8)
    8054                      .dwattr $C$DW$530, DW_AT_name("inv")
    8055                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_inv")
    8056                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8057                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  168

    8058              $C$DW$531       .dwtag  DW_TAG_member
    8059                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$8)
    8060                      .dwattr $C$DW$531, DW_AT_name("gconst")
    8061                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_gconst")
    8062                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8063                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    8064                      .dwendtag $C$DW$T$45
    8065              
    8066              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    8067                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$45)
    8068                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    8069              
    8070              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    8071                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x544)
    8072              $C$DW$532       .dwtag  DW_TAG_member
    8073                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$46)
    8074                      .dwattr $C$DW$532, DW_AT_name("base_mem")
    8075                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_base_mem")
    8076                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8077                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    8078              $C$DW$533       .dwtag  DW_TAG_member
    8079                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$21)
    8080                      .dwattr $C$DW$533, DW_AT_name("mem_count")
    8081                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_mem_count")
    8082                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    8083                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    8084              $C$DW$534       .dwtag  DW_TAG_member
    8085                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$23)
    8086                      .dwattr $C$DW$534, DW_AT_name("answers")
    8087                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_answers")
    8088                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    8089                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    8090              $C$DW$535       .dwtag  DW_TAG_member
    8091                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$23)
    8092                      .dwattr $C$DW$535, DW_AT_name("uStp")
    8093                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_uStp")
    8094                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    8095                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    8096              $C$DW$536       .dwtag  DW_TAG_member
    8097                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$21)
    8098                      .dwattr $C$DW$536, DW_AT_name("nWords")
    8099                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_nWords")
    8100                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    8101                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    8102              $C$DW$537       .dwtag  DW_TAG_member
    8103                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$8)
    8104                      .dwattr $C$DW$537, DW_AT_name("nS")
    8105                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_nS")
    8106                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    8107                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    8108              $C$DW$538       .dwtag  DW_TAG_member
    8109                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$22)
    8110                      .dwattr $C$DW$538, DW_AT_name("cm_scr")
    8111                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_cm_scr")
    8112                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  169

    8113                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    8114              $C$DW$539       .dwtag  DW_TAG_member
    8115                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$8)
    8116                      .dwattr $C$DW$539, DW_AT_name("bNeedUpdate")
    8117                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_bNeedUpdate")
    8118                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    8119                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    8120              $C$DW$540       .dwtag  DW_TAG_member
    8121                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$22)
    8122                      .dwattr $C$DW$540, DW_AT_name("cm_anti_scr")
    8123                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_cm_anti_scr")
    8124                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    8125                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    8126              $C$DW$541       .dwtag  DW_TAG_member
    8127                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$12)
    8128                      .dwattr $C$DW$541, DW_AT_name("cm_fg_scr")
    8129                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_cm_fg_scr")
    8130                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    8131                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    8132              $C$DW$542       .dwtag  DW_TAG_member
    8133                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$12)
    8134                      .dwattr $C$DW$542, DW_AT_name("cm_bk_scr")
    8135                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_cm_bk_scr")
    8136                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    8137                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    8138              $C$DW$543       .dwtag  DW_TAG_member
    8139                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$8)
    8140                      .dwattr $C$DW$543, DW_AT_name("th_nbest")
    8141                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_th_nbest")
    8142                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    8143                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    8144              $C$DW$544       .dwtag  DW_TAG_member
    8145                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$8)
    8146                      .dwattr $C$DW$544, DW_AT_name("nSpeech")
    8147                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_nSpeech")
    8148                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    8149                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    8150              $C$DW$545       .dwtag  DW_TAG_member
    8151                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$8)
    8152                      .dwattr $C$DW$545, DW_AT_name("nNoise")
    8153                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_nNoise")
    8154                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    8155                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    8156              $C$DW$546       .dwtag  DW_TAG_member
    8157                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$12)
    8158                      .dwattr $C$DW$546, DW_AT_name("speech_power")
    8159                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_speech_power")
    8160                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    8161                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    8162              $C$DW$547       .dwtag  DW_TAG_member
    8163                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$12)
    8164                      .dwattr $C$DW$547, DW_AT_name("noise_power")
    8165                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_noise_power")
    8166                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    8167                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  170

    8168              $C$DW$548       .dwtag  DW_TAG_member
    8169                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$12)
    8170                      .dwattr $C$DW$548, DW_AT_name("noise_power_sqr")
    8171                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_noise_power_sqr")
    8172                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    8173                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    8174              $C$DW$549       .dwtag  DW_TAG_member
    8175                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$8)
    8176                      .dwattr $C$DW$549, DW_AT_name("NSNR")
    8177                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_NSNR")
    8178                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    8179                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    8180              $C$DW$550       .dwtag  DW_TAG_member
    8181                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$47)
    8182                      .dwattr $C$DW$550, DW_AT_name("H0")
    8183                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_H0")
    8184                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    8185                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    8186              $C$DW$551       .dwtag  DW_TAG_member
    8187                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$47)
    8188                      .dwattr $C$DW$551, DW_AT_name("H1")
    8189                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_H1")
    8190                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    8191                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    8192              $C$DW$552       .dwtag  DW_TAG_member
    8193                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    8194                      .dwattr $C$DW$552, DW_AT_name("lgBeta")
    8195                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_lgBeta")
    8196                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    8197                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    8198              $C$DW$553       .dwtag  DW_TAG_member
    8199                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$48)
    8200                      .dwattr $C$DW$553, DW_AT_name("acc_dif2_beta")
    8201                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_acc_dif2_beta")
    8202                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    8203                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    8204              $C$DW$554       .dwtag  DW_TAG_member
    8205                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$8)
    8206                      .dwattr $C$DW$554, DW_AT_name("bCalced")
    8207                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_bCalced")
    8208                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    8209                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    8210              $C$DW$555       .dwtag  DW_TAG_member
    8211                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
    8212                      .dwattr $C$DW$555, DW_AT_name("sCH")
    8213                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_sCH")
    8214                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    8215                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    8216              $C$DW$556       .dwtag  DW_TAG_member
    8217                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$48)
    8218                      .dwattr $C$DW$556, DW_AT_name("lAccum")
    8219                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_lAccum")
    8220                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    8221                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    8222              $C$DW$557       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  171

    8223                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$8)
    8224                      .dwattr $C$DW$557, DW_AT_name("adp_th")
    8225                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_adp_th")
    8226                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    8227                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    8228                      .dwendtag $C$DW$T$49
    8229              
    8230              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    8231                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$49)
    8232                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    8233              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    8234                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    8235                      .dwattr $C$DW$T$90, DW_AT_address_class(0x17)
    8236              $C$DW$T$4       .dwtag  DW_TAG_base_type
    8237                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    8238                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    8239                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    8240              $C$DW$T$5       .dwtag  DW_TAG_base_type
    8241                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    8242                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    8243                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    8244              $C$DW$T$6       .dwtag  DW_TAG_base_type
    8245                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    8246                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    8247                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    8248              $C$DW$T$7       .dwtag  DW_TAG_base_type
    8249                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    8250                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    8251                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    8252              $C$DW$T$8       .dwtag  DW_TAG_base_type
    8253                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    8254                      .dwattr $C$DW$T$8, DW_AT_name("short")
    8255                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    8256              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    8257                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$8)
    8258                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    8259              
    8260              $C$DW$T$40      .dwtag  DW_TAG_array_type
    8261                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$8)
    8262                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    8263                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x1e)
    8264              $C$DW$558       .dwtag  DW_TAG_subrange_type
    8265                      .dwattr $C$DW$558, DW_AT_upper_bound(0x1d)
    8266                      .dwendtag $C$DW$T$40
    8267              
    8268              
    8269              $C$DW$T$46      .dwtag  DW_TAG_array_type
    8270                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$8)
    8271                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    8272                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x514)
    8273              $C$DW$559       .dwtag  DW_TAG_subrange_type
    8274                      .dwattr $C$DW$559, DW_AT_upper_bound(0x513)
    8275                      .dwendtag $C$DW$T$46
    8276              
    8277              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  172

    8278              $C$DW$T$51      .dwtag  DW_TAG_array_type
    8279                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    8280                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    8281                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    8282              $C$DW$560       .dwtag  DW_TAG_subrange_type
    8283                      .dwattr $C$DW$560, DW_AT_upper_bound(0xff)
    8284                      .dwendtag $C$DW$T$51
    8285              
    8286              
    8287              $C$DW$T$52      .dwtag  DW_TAG_array_type
    8288                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    8289                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    8290                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x10)
    8291              $C$DW$561       .dwtag  DW_TAG_subrange_type
    8292                      .dwattr $C$DW$561, DW_AT_upper_bound(0x0f)
    8293                      .dwendtag $C$DW$T$52
    8294              
    8295              
    8296              $C$DW$T$53      .dwtag  DW_TAG_array_type
    8297                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
    8298                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    8299                      .dwattr $C$DW$T$53, DW_AT_byte_size(0xe0)
    8300              $C$DW$562       .dwtag  DW_TAG_subrange_type
    8301                      .dwattr $C$DW$562, DW_AT_upper_bound(0x0d)
    8302              $C$DW$563       .dwtag  DW_TAG_subrange_type
    8303                      .dwattr $C$DW$563, DW_AT_upper_bound(0x0f)
    8304                      .dwendtag $C$DW$T$53
    8305              
    8306              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    8307                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$52)
    8308                      .dwattr $C$DW$T$95, DW_AT_address_class(0x17)
    8309              $C$DW$564       .dwtag  DW_TAG_TI_far_type
    8310                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$8)
    8311              $C$DW$T$54      .dwtag  DW_TAG_const_type
    8312                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$564)
    8313              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    8314                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    8315                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    8316              
    8317              $C$DW$T$56      .dwtag  DW_TAG_array_type
    8318                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    8319                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    8320                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x20)
    8321              $C$DW$565       .dwtag  DW_TAG_subrange_type
    8322                      .dwattr $C$DW$565, DW_AT_upper_bound(0x0f)
    8323                      .dwendtag $C$DW$T$56
    8324              
    8325              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    8326                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$55)
    8327                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    8328              
    8329              $C$DW$T$122     .dwtag  DW_TAG_array_type
    8330                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$54)
    8331                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    8332                      .dwattr $C$DW$T$122, DW_AT_byte_size(0x0a)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  173

    8333              $C$DW$566       .dwtag  DW_TAG_subrange_type
    8334                      .dwattr $C$DW$566, DW_AT_upper_bound(0x09)
    8335                      .dwendtag $C$DW$T$122
    8336              
    8337              
    8338              $C$DW$T$123     .dwtag  DW_TAG_array_type
    8339                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$54)
    8340                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    8341                      .dwattr $C$DW$T$123, DW_AT_byte_size(0x06)
    8342              $C$DW$567       .dwtag  DW_TAG_subrange_type
    8343                      .dwattr $C$DW$567, DW_AT_upper_bound(0x05)
    8344                      .dwendtag $C$DW$T$123
    8345              
    8346              
    8347              $C$DW$T$124     .dwtag  DW_TAG_array_type
    8348                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$54)
    8349                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    8350                      .dwattr $C$DW$T$124, DW_AT_byte_size(0x14)
    8351              $C$DW$568       .dwtag  DW_TAG_subrange_type
    8352                      .dwattr $C$DW$568, DW_AT_upper_bound(0x13)
    8353                      .dwendtag $C$DW$T$124
    8354              
    8355              
    8356              $C$DW$T$125     .dwtag  DW_TAG_array_type
    8357                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$54)
    8358                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8359                      .dwattr $C$DW$T$125, DW_AT_byte_size(0xc8)
    8360              $C$DW$569       .dwtag  DW_TAG_subrange_type
    8361                      .dwattr $C$DW$569, DW_AT_upper_bound(0x09)
    8362              $C$DW$570       .dwtag  DW_TAG_subrange_type
    8363                      .dwattr $C$DW$570, DW_AT_upper_bound(0x13)
    8364                      .dwendtag $C$DW$T$125
    8365              
    8366              
    8367              $C$DW$T$127     .dwtag  DW_TAG_array_type
    8368                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$54)
    8369                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    8370                      .dwattr $C$DW$T$127, DW_AT_byte_size(0x1a)
    8371              $C$DW$571       .dwtag  DW_TAG_subrange_type
    8372                      .dwattr $C$DW$571, DW_AT_upper_bound(0x19)
    8373                      .dwendtag $C$DW$T$127
    8374              
    8375              
    8376              $C$DW$T$128     .dwtag  DW_TAG_array_type
    8377                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$54)
    8378                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    8379                      .dwattr $C$DW$T$128, DW_AT_byte_size(0x1a0)
    8380              $C$DW$572       .dwtag  DW_TAG_subrange_type
    8381                      .dwattr $C$DW$572, DW_AT_upper_bound(0x0f)
    8382              $C$DW$573       .dwtag  DW_TAG_subrange_type
    8383                      .dwattr $C$DW$573, DW_AT_upper_bound(0x19)
    8384                      .dwendtag $C$DW$T$128
    8385              
    8386              
    8387              $C$DW$T$130     .dwtag  DW_TAG_array_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  174

    8388                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$54)
    8389                      .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    8390                      .dwattr $C$DW$T$130, DW_AT_byte_size(0x80)
    8391              $C$DW$574       .dwtag  DW_TAG_subrange_type
    8392                      .dwattr $C$DW$574, DW_AT_upper_bound(0x7f)
    8393                      .dwendtag $C$DW$T$130
    8394              
    8395              
    8396              $C$DW$T$131     .dwtag  DW_TAG_array_type
    8397                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$54)
    8398                      .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    8399                      .dwattr $C$DW$T$131, DW_AT_byte_size(0x100)
    8400              $C$DW$575       .dwtag  DW_TAG_subrange_type
    8401                      .dwattr $C$DW$575, DW_AT_upper_bound(0xff)
    8402                      .dwendtag $C$DW$T$131
    8403              
    8404              
    8405              $C$DW$T$60      .dwtag  DW_TAG_array_type
    8406                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    8407                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    8408                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x80)
    8409              $C$DW$576       .dwtag  DW_TAG_subrange_type
    8410                      .dwattr $C$DW$576, DW_AT_upper_bound(0x7f)
    8411                      .dwendtag $C$DW$T$60
    8412              
    8413              
    8414              $C$DW$T$61      .dwtag  DW_TAG_array_type
    8415                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$8)
    8416                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    8417                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x1a)
    8418              $C$DW$577       .dwtag  DW_TAG_subrange_type
    8419                      .dwattr $C$DW$577, DW_AT_upper_bound(0x19)
    8420                      .dwendtag $C$DW$T$61
    8421              
    8422              
    8423              $C$DW$T$79      .dwtag  DW_TAG_array_type
    8424                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$8)
    8425                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    8426                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x20)
    8427              $C$DW$578       .dwtag  DW_TAG_subrange_type
    8428                      .dwattr $C$DW$578, DW_AT_upper_bound(0x1f)
    8429                      .dwendtag $C$DW$T$79
    8430              
    8431              
    8432              $C$DW$T$85      .dwtag  DW_TAG_array_type
    8433                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$8)
    8434                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    8435                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x14)
    8436              $C$DW$579       .dwtag  DW_TAG_subrange_type
    8437                      .dwattr $C$DW$579, DW_AT_upper_bound(0x13)
    8438                      .dwendtag $C$DW$T$85
    8439              
    8440              $C$DW$T$9       .dwtag  DW_TAG_base_type
    8441                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    8442                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  175

    8443                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    8444              
    8445              $C$DW$T$28      .dwtag  DW_TAG_array_type
    8446                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$9)
    8447                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    8448                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    8449              $C$DW$580       .dwtag  DW_TAG_subrange_type
    8450                      .dwattr $C$DW$580, DW_AT_upper_bound(0x00)
    8451                      .dwendtag $C$DW$T$28
    8452              
    8453              
    8454              $C$DW$T$34      .dwtag  DW_TAG_array_type
    8455                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    8456                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    8457                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    8458              $C$DW$581       .dwtag  DW_TAG_subrange_type
    8459                      .dwattr $C$DW$581, DW_AT_upper_bound(0x01)
    8460                      .dwendtag $C$DW$T$34
    8461              
    8462              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    8463                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$9)
    8464                      .dwattr $C$DW$T$36, DW_AT_address_class(0x17)
    8465              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    8466                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    8467                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    8468              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    8469                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
    8470                      .dwattr $C$DW$T$23, DW_AT_address_class(0x17)
    8471              
    8472              $C$DW$T$38      .dwtag  DW_TAG_array_type
    8473                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$21)
    8474                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    8475                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    8476              $C$DW$582       .dwtag  DW_TAG_subrange_type
    8477                      .dwattr $C$DW$582, DW_AT_upper_bound(0x13)
    8478                      .dwendtag $C$DW$T$38
    8479              
    8480              
    8481              $C$DW$T$86      .dwtag  DW_TAG_array_type
    8482                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$21)
    8483                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    8484                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x02)
    8485              $C$DW$583       .dwtag  DW_TAG_subrange_type
    8486                      .dwattr $C$DW$583, DW_AT_upper_bound(0x01)
    8487                      .dwendtag $C$DW$T$86
    8488              
    8489              $C$DW$T$10      .dwtag  DW_TAG_base_type
    8490                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    8491                      .dwattr $C$DW$T$10, DW_AT_name("int")
    8492                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    8493              $C$DW$T$11      .dwtag  DW_TAG_base_type
    8494                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    8495                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    8496                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    8497              $C$DW$T$12      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  176

    8498                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    8499                      .dwattr $C$DW$T$12, DW_AT_name("long")
    8500                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    8501              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    8502                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$12)
    8503                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
    8504              
    8505              $C$DW$T$62      .dwtag  DW_TAG_array_type
    8506                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$12)
    8507                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    8508                      .dwattr $C$DW$T$62, DW_AT_byte_size(0xd0)
    8509              $C$DW$584       .dwtag  DW_TAG_subrange_type
    8510                      .dwattr $C$DW$584, DW_AT_upper_bound(0x67)
    8511                      .dwendtag $C$DW$T$62
    8512              
    8513              
    8514              $C$DW$T$65      .dwtag  DW_TAG_array_type
    8515                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$12)
    8516                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    8517                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x20)
    8518              $C$DW$585       .dwtag  DW_TAG_subrange_type
    8519                      .dwattr $C$DW$585, DW_AT_upper_bound(0x0f)
    8520                      .dwendtag $C$DW$T$65
    8521              
    8522              
    8523              $C$DW$T$146     .dwtag  DW_TAG_array_type
    8524                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$12)
    8525                      .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    8526                      .dwattr $C$DW$T$146, DW_AT_byte_size(0x34)
    8527              $C$DW$586       .dwtag  DW_TAG_subrange_type
    8528                      .dwattr $C$DW$586, DW_AT_upper_bound(0x19)
    8529                      .dwendtag $C$DW$T$146
    8530              
    8531              $C$DW$T$13      .dwtag  DW_TAG_base_type
    8532                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    8533                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    8534                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    8535              $C$DW$T$14      .dwtag  DW_TAG_base_type
    8536                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    8537                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    8538                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    8539                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    8540                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    8541              $C$DW$T$15      .dwtag  DW_TAG_base_type
    8542                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    8543                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    8544                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    8545                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    8546                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    8547              $C$DW$T$16      .dwtag  DW_TAG_base_type
    8548                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    8549                      .dwattr $C$DW$T$16, DW_AT_name("float")
    8550                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    8551              $C$DW$T$17      .dwtag  DW_TAG_base_type
    8552                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  177

    8553                      .dwattr $C$DW$T$17, DW_AT_name("double")
    8554                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    8555              $C$DW$T$18      .dwtag  DW_TAG_base_type
    8556                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    8557                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    8558                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    8559              $C$DW$T$74      .dwtag  DW_TAG_base_type
    8560                      .dwattr $C$DW$T$74, DW_AT_encoding(DW_ATE_signed_char)
    8561                      .dwattr $C$DW$T$74, DW_AT_name("signed char")
    8562                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    8563              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    8564                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    8565                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    8566              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    8567                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$75)
    8568                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    8569              
    8570              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    8571                      .dwattr $C$DW$T$50, DW_AT_name("ele")
    8572                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x03)
    8573              $C$DW$587       .dwtag  DW_TAG_member
    8574                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$9)
    8575                      .dwattr $C$DW$587, DW_AT_name("sym")
    8576                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_sym")
    8577                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8578                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    8579              $C$DW$588       .dwtag  DW_TAG_member
    8580                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$9)
    8581                      .dwattr $C$DW$588, DW_AT_name("idx_flag")
    8582                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_idx_flag")
    8583                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8584                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    8585              $C$DW$589       .dwtag  DW_TAG_member
    8586                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$9)
    8587                      .dwattr $C$DW$589, DW_AT_name("next")
    8588                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_next")
    8589                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8590                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    8591                      .dwendtag $C$DW$T$50
    8592              
    8593              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    8594                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$50)
    8595                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    8596              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    8597                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    8598                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    8599              
    8600              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    8601                      .dwattr $C$DW$T$91, DW_AT_name("gmhmm_type")
    8602                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x7fe)
    8603              $C$DW$590       .dwtag  DW_TAG_member
    8604                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$21)
    8605                      .dwattr $C$DW$590, DW_AT_name("avedepth")
    8606                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_avedepth")
    8607                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  178

    8608                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    8609              $C$DW$591       .dwtag  DW_TAG_member
    8610                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$21)
    8611                      .dwattr $C$DW$591, DW_AT_name("bestdepth")
    8612                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_bestdepth")
    8613                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8614                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    8615              $C$DW$592       .dwtag  DW_TAG_member
    8616                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$21)
    8617                      .dwattr $C$DW$592, DW_AT_name("index_mean")
    8618                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_index_mean")
    8619                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8620                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    8621              $C$DW$593       .dwtag  DW_TAG_member
    8622                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$21)
    8623                      .dwattr $C$DW$593, DW_AT_name("signal_cnt")
    8624                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_signal_cnt")
    8625                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8626                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    8627              $C$DW$594       .dwtag  DW_TAG_member
    8628                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$8)
    8629                      .dwattr $C$DW$594, DW_AT_name("buf_idx")
    8630                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_buf_idx")
    8631                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8632                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    8633              $C$DW$595       .dwtag  DW_TAG_member
    8634                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$21)
    8635                      .dwattr $C$DW$595, DW_AT_name("speech_detected")
    8636                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_speech_detected")
    8637                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8638                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    8639              $C$DW$596       .dwtag  DW_TAG_member
    8640                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$21)
    8641                      .dwattr $C$DW$596, DW_AT_name("mfcc_cnt")
    8642                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_mfcc_cnt")
    8643                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8644                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    8645              $C$DW$597       .dwtag  DW_TAG_member
    8646                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$21)
    8647                      .dwattr $C$DW$597, DW_AT_name("nbr_cpy")
    8648                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_nbr_cpy")
    8649                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8650                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    8651              $C$DW$598       .dwtag  DW_TAG_member
    8652                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$8)
    8653                      .dwattr $C$DW$598, DW_AT_name("last_sig")
    8654                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_last_sig")
    8655                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8656                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    8657              $C$DW$599       .dwtag  DW_TAG_member
    8658                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$51)
    8659                      .dwattr $C$DW$599, DW_AT_name("sample_signal")
    8660                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_sample_signal")
    8661                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8662                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:35 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2196010                         PAGE  179

    8663              $C$DW$600       .dwtag  DW_TAG_member
    8664                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$8)
    8665                      .dwattr $C$DW$600, DW_AT_name("amplitude_max")
    8666                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_amplitude_max")
    8667                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    8668                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    8669              $C$DW$601       .dwtag  DW_TAG_member
    8670                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$8)
    8671                      .dwattr $C$DW$601, DW_AT_name("amplitude_min")
    8672                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_amplitude_min")
    8673                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    8674                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    8675              $C$DW$602       .dwtag  DW_TAG_member
    8676                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$8)
    8677                      .dwattr $C$DW$602, DW_AT_name("pred_first_frame")
    8678                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_pred_first_frame")
    8679                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    8680                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    8681              $C$DW$603       .dwtag  DW_TAG_member
    8682                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$8)
    8683                      .dwattr $C$DW$603, DW_AT_name("frm_cnt")
    8684                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_frm_cnt")
    8685                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    8686                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    8687              $C$DW$604       .dwtag  DW_TAG_member
    8688                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$8)
    8689                      .dwattr $C$DW$604, DW_AT_name("beam_count")
    8690                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_beam_count")
    8691                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
