TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE    1

    5241              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:38 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2961              $C$DW$310       .dwtag  DW_TAG_subprogram, DW_AT_name("ss_close")
    2962                      .dwattr $C$DW$310, DW_AT_low_pc(_ss_close)
    2963                      .dwattr $C$DW$310, DW_AT_high_pc(0x00)
    2964                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_ss_close")
    2965                      .dwattr $C$DW$310, DW_AT_external
    2966                      .dwattr $C$DW$310, DW_AT_TI_begin_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/
    2967                      .dwattr $C$DW$310, DW_AT_TI_begin_line(0x1fa)
    2968                      .dwattr $C$DW$310, DW_AT_TI_begin_column(0x1d)
    2969                      .dwattr $C$DW$310, DW_AT_TI_max_frame_size(0x04)
    2970                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    2971              
    2972                      .dwfde $C$DW$CIE, _ss_close
    2973              $C$DW$311       .dwtag  DW_TAG_formal_parameter, DW_AT_name("gv")
    2974                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_gv")
    2975                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$110)
    2976                      .dwattr $C$DW$311, DW_AT_location[DW_OP_reg17]
    2977              ;*******************************************************************************
    2978              ;* FUNCTION NAME: ss_close                                                     *
    2979              ;*                                                                             *
    2980              ;*   Function Uses Regs : AR0,XAR0,SP,M40,SATA,SATD,RDM,FRCT,SMUL              *
    2981              ;*   Stack Frame        : Compact (No Frame Pointer, w/ debug)                 *
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   65

    2982              ;*   Total Frame Size   : 4 words                                              *
    2983              ;*                        (2 return address/alignment)                         *
    2984              ;*                        (2 local values)                                     *
    2985              ;*   Min System Stack   : 1 word                                               *
    2986              ;*******************************************************************************
    2987 000000       _ss_close:
    2988                      .dwcfi  cfa_offset, 1
    2989                      .dwcfi  save_reg_to_mem, 91, -1
    2990 000000 4EFD          AADD #-3, SP
    2991                      .dwcfi  cfa_offset, 4
    2992              $C$DW$312       .dwtag  DW_TAG_variable, DW_AT_name("gv")
    2993                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_gv")
    2994                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$110)
    2995                      .dwattr $C$DW$312, DW_AT_location[DW_OP_bregx 0x24 0]
    2996 000002 EB00          MOV XAR0, dbl(*SP(#0))
         000004 85   
    2997                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    2998 000005 4E03          AADD #3, SP
    2999                      .dwcfi  cfa_offset, 1
    3000              $C$DW$313       .dwtag  DW_TAG_TI_branch
    3001                      .dwattr $C$DW$313, DW_AT_low_pc(0x00)
    3002                      .dwattr $C$DW$313, DW_AT_TI_return
    3003 000007 4804          RET
    3004                                                      ; return occurs
    3005                      .dwattr $C$DW$310, DW_AT_TI_end_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CS
    3006                      .dwattr $C$DW$310, DW_AT_TI_end_line(0x202)
    3007                      .dwattr $C$DW$310, DW_AT_TI_end_column(0x01)
    3008                      .dwendentry
    3009                      .dwendtag $C$DW$310
    3010              
    3011              ;******************************************************************************
    3012              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    3013              ;******************************************************************************
    3014                      .global _malloc
    3015                      .global _signal_to_power_spectrum
    3016                      .global _ss_power_spectrum_to_mfcc
    3017                      .global _ss_est_frmEn
    3018                      .global _ss_update_meanEn
    3019                      .global _update_level
    3020                      .global _hlr_expn
    3021                      .global _q15_x
    3022                      .global _div32_32_Q
    3023                      .global _log_polyfit
    3024                      .global _pow_polyfit
    3025                      .global __divli
    3026                      .global __mpyli
    3027              
    3028              ;*******************************************************************************
    3029              ;* TYPE INFORMATION                                                            *
    3030              ;*******************************************************************************
    3031              
    3032              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3033                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
    3034              $C$DW$314       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   66

    3036                      .dwattr $C$DW$314, DW_AT_name("norm0")
    3037                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_norm0")
    3038                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3039                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$315       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$8)
    3042                      .dwattr $C$DW$315, DW_AT_name("norm1")
    3043                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_norm1")
    3044                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3045                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3046              $C$DW$316       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$8)
    3048                      .dwattr $C$DW$316, DW_AT_name("norm2")
    3049                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_norm2")
    3050                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3051                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3052                      .dwendtag $C$DW$T$19
    3053              
    3054              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("NormType")
    3055                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$19)
    3056                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    3057              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    3058                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    3059                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    3060              
    3061              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3062                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x03)
    3063              $C$DW$317       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$8)
    3065                      .dwattr $C$DW$317, DW_AT_name("num")
    3066                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_num")
    3067                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3068                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3069              $C$DW$318       .dwtag  DW_TAG_member
    3070                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$8)
    3071                      .dwattr $C$DW$318, DW_AT_name("x1")
    3072                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_x1")
    3073                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3074                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3075              $C$DW$319       .dwtag  DW_TAG_member
    3076                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$8)
    3077                      .dwattr $C$DW$319, DW_AT_name("x2")
    3078                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_x2")
    3079                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3080                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3081                      .dwendtag $C$DW$T$20
    3082              
    3083              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    3084                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$20)
    3085                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3086              $C$DW$320       .dwtag  DW_TAG_TI_far_type
    3087                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$57)
    3088              $C$DW$T$58      .dwtag  DW_TAG_const_type
    3089                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$320)
    3090              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   67

    3091                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3092                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    3093              
    3094              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3095                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x14)
    3096              $C$DW$321       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    3098                      .dwattr $C$DW$321, DW_AT_name("alpha_p")
    3099                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_alpha_p")
    3100                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3101                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3102              $C$DW$322       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    3104                      .dwattr $C$DW$322, DW_AT_name("sAlpha")
    3105                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_sAlpha")
    3106                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3107                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3108              $C$DW$323       .dwtag  DW_TAG_member
    3109                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$8)
    3110                      .dwattr $C$DW$323, DW_AT_name("sBeta")
    3111                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_sBeta")
    3112                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3113                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3114              $C$DW$324       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$8)
    3116                      .dwattr $C$DW$324, DW_AT_name("lambdaLTEhigherE")
    3117                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    3118                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3119                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3120              $C$DW$325       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$8)
    3122                      .dwattr $C$DW$325, DW_AT_name("frm_count")
    3123                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_frm_count")
    3124                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3125                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3126              $C$DW$326       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
    3128                      .dwattr $C$DW$326, DW_AT_name("prob_sp")
    3129                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_prob_sp")
    3130                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3131                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3132              $C$DW$327       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$22)
    3134                      .dwattr $C$DW$327, DW_AT_name("s_noise_floor")
    3135                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_s_noise_floor")
    3136                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3137                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3138              $C$DW$328       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$22)
    3140                      .dwattr $C$DW$328, DW_AT_name("snr")
    3141                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_snr")
    3142                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3143                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3144              $C$DW$329       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   68

    3146                      .dwattr $C$DW$329, DW_AT_name("ps_long_term_noise")
    3147                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_ps_long_term_noise")
    3148                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3149                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3150              $C$DW$330       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$8)
    3152                      .dwattr $C$DW$330, DW_AT_name("frmEn")
    3153                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_frmEn")
    3154                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3155                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3156              $C$DW$331       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$8)
    3158                      .dwattr $C$DW$331, DW_AT_name("meanEn")
    3159                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_meanEn")
    3160                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3161                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3162              $C$DW$332       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$8)
    3164                      .dwattr $C$DW$332, DW_AT_name("prevMeanEn")
    3165                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_prevMeanEn")
    3166                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3167                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3168              $C$DW$333       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$8)
    3170                      .dwattr $C$DW$333, DW_AT_name("noiselvl")
    3171                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_noiselvl")
    3172                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3173                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3174              $C$DW$334       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$8)
    3176                      .dwattr $C$DW$334, DW_AT_name("lambdaLTE")
    3177                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_lambdaLTE")
    3178                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3179                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3180              $C$DW$335       .dwtag  DW_TAG_member
    3181                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$8)
    3182                      .dwattr $C$DW$335, DW_AT_name("nbSpeechFrame")
    3183                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_nbSpeechFrame")
    3184                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3185                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3186              $C$DW$336       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$8)
    3188                      .dwattr $C$DW$336, DW_AT_name("hangOver")
    3189                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_hangOver")
    3190                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3191                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3192                      .dwendtag $C$DW$T$23
    3193              
    3194              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    3195                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$23)
    3196                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3197              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    3198                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    3199                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    3200              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   69

    3201              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3202                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x18)
    3203              $C$DW$337       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    3205                      .dwattr $C$DW$337, DW_AT_name("max_mem_usage")
    3206                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_max_mem_usage")
    3207                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3208                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3209              $C$DW$338       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$21)
    3211                      .dwattr $C$DW$338, DW_AT_name("n_terminals")
    3212                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_n_terminals")
    3213                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3214                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3215              $C$DW$339       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$21)
    3217                      .dwattr $C$DW$339, DW_AT_name("n_monophones")
    3218                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_n_monophones")
    3219                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3220                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3221              $C$DW$340       .dwtag  DW_TAG_member
    3222                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$22)
    3223                      .dwattr $C$DW$340, DW_AT_name("hlrTreeBase")
    3224                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_hlrTreeBase")
    3225                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3226                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3227              $C$DW$341       .dwtag  DW_TAG_member
    3228                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$24)
    3229                      .dwattr $C$DW$341, DW_AT_name("hlrTerminal")
    3230                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_hlrTerminal")
    3231                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3232                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3233              $C$DW$342       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$22)
    3235                      .dwattr $C$DW$342, DW_AT_name("pHMM2phone")
    3236                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_pHMM2phone")
    3237                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3238                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3239              $C$DW$343       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$24)
    3241                      .dwattr $C$DW$343, DW_AT_name("hlrTransformIndex")
    3242                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_hlrTransformIndex")
    3243                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3244                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3245              $C$DW$344       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$21)
    3247                      .dwattr $C$DW$344, DW_AT_name("hlr_TRANSFORM_SIZE")
    3248                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    3249                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3250                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3251              $C$DW$345       .dwtag  DW_TAG_member
    3252                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
    3253                      .dwattr $C$DW$345, DW_AT_name("hlrTransforms")
    3254                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_hlrTransforms")
    3255                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   70

    3256                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3257              $C$DW$346       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$22)
    3259                      .dwattr $C$DW$346, DW_AT_name("pSegStat_dif1")
    3260                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_pSegStat_dif1")
    3261                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3262                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3263              $C$DW$347       .dwtag  DW_TAG_member
    3264                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
    3265                      .dwattr $C$DW$347, DW_AT_name("pSegStat_dif2")
    3266                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_pSegStat_dif2")
    3267                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3268                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3269              $C$DW$348       .dwtag  DW_TAG_member
    3270                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$22)
    3271                      .dwattr $C$DW$348, DW_AT_name("pEnhanced")
    3272                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_pEnhanced")
    3273                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3274                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3275              $C$DW$349       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$22)
    3277                      .dwattr $C$DW$349, DW_AT_name("bk_node_cnt")
    3278                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_bk_node_cnt")
    3279                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3280                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3281                      .dwendtag $C$DW$T$25
    3282              
    3283              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    3284                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$25)
    3285                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3286              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    3287                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    3288                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    3289              
    3290              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3291                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x03)
    3292              $C$DW$350       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$9)
    3294                      .dwattr $C$DW$350, DW_AT_name("sym_code")
    3295                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_sym_code")
    3296                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3297                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3298              $C$DW$351       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$9)
    3300                      .dwattr $C$DW$351, DW_AT_name("start_cell")
    3301                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_start_cell")
    3302                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3303                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3304              $C$DW$352       .dwtag  DW_TAG_member
    3305                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$9)
    3306                      .dwattr $C$DW$352, DW_AT_name("depth")
    3307                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_depth")
    3308                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3309                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3310                      .dwendtag $C$DW$T$26
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   71

    3311              
    3312              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    3313                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$26)
    3314                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3315              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    3316                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    3317                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
    3318              
    3319              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3320                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x03)
    3321              $C$DW$353       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$8)
    3323                      .dwattr $C$DW$353, DW_AT_name("scr")
    3324                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_scr")
    3325                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3326                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3327              $C$DW$354       .dwtag  DW_TAG_member
    3328                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$9)
    3329                      .dwattr $C$DW$354, DW_AT_name("sym")
    3330                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_sym")
    3331                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3332                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3333              $C$DW$355       .dwtag  DW_TAG_member
    3334                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$9)
    3335                      .dwattr $C$DW$355, DW_AT_name("frm")
    3336                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_frm")
    3337                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3338                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3339                      .dwendtag $C$DW$T$27
    3340              
    3341              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    3342                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$27)
    3343                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3344              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    3345                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    3346                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
    3347              
    3348              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3349                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    3350              $C$DW$356       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$9)
    3352                      .dwattr $C$DW$356, DW_AT_name("frm")
    3353                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_frm")
    3354                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3355                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3356              $C$DW$357       .dwtag  DW_TAG_member
    3357                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$9)
    3358                      .dwattr $C$DW$357, DW_AT_name("beam_idx")
    3359                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_beam_idx")
    3360                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3361                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3362                      .dwendtag $C$DW$T$28
    3363              
    3364              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    3365                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$28)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   72

    3366                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3367              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    3368                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    3369                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    3370              
    3371              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3372                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    3373              $C$DW$358       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$9)
    3375                      .dwattr $C$DW$358, DW_AT_name("n_hmm")
    3376                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_n_hmm")
    3377                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3378                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3379              $C$DW$359       .dwtag  DW_TAG_member
    3380                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$9)
    3381                      .dwattr $C$DW$359, DW_AT_name("n_sym")
    3382                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_n_sym")
    3383                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3384                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3385              $C$DW$360       .dwtag  DW_TAG_member
    3386                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$9)
    3387                      .dwattr $C$DW$360, DW_AT_name("n_word")
    3388                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_n_word")
    3389                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3390                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3391              $C$DW$361       .dwtag  DW_TAG_member
    3392                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$9)
    3393                      .dwattr $C$DW$361, DW_AT_name("n_set")
    3394                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_n_set")
    3395                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3396                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3397              $C$DW$362       .dwtag  DW_TAG_member
    3398                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$9)
    3399                      .dwattr $C$DW$362, DW_AT_name("n_hmm_set")
    3400                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_n_hmm_set")
    3401                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3402                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3403              $C$DW$363       .dwtag  DW_TAG_member
    3404                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$9)
    3405                      .dwattr $C$DW$363, DW_AT_name("start")
    3406                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_start")
    3407                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3408                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3409              $C$DW$364       .dwtag  DW_TAG_member
    3410                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$9)
    3411                      .dwattr $C$DW$364, DW_AT_name("stop")
    3412                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_stop")
    3413                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3414                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3415              $C$DW$365       .dwtag  DW_TAG_member
    3416                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$29)
    3417                      .dwattr $C$DW$365, DW_AT_name("symlist")
    3418                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_symlist")
    3419                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3420                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   73

    3421                      .dwendtag $C$DW$T$30
    3422              
    3423              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    3424                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$30)
    3425                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3426              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    3427                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    3428                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    3429              
    3430              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3431                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    3432              $C$DW$366       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$9)
    3434                      .dwattr $C$DW$366, DW_AT_name("high_pos")
    3435                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_high_pos")
    3436                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3437                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3438              $C$DW$367       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$9)
    3440                      .dwattr $C$DW$367, DW_AT_name("cur_pos")
    3441                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_cur_pos")
    3442                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3443                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3444                      .dwendtag $C$DW$T$31
    3445              
    3446              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    3447                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    3448                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3449              
    3450              $C$DW$T$33      .dwtag  DW_TAG_array_type
    3451                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3452                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3453                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    3454              $C$DW$368       .dwtag  DW_TAG_subrange_type
    3455                      .dwattr $C$DW$368, DW_AT_upper_bound(0x01)
    3456                      .dwendtag $C$DW$T$33
    3457              
    3458              
    3459              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3460                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    3461              $C$DW$369       .dwtag  DW_TAG_member
    3462                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$32)
    3463                      .dwattr $C$DW$369, DW_AT_name("state")
    3464                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_state")
    3465                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3466                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3467              $C$DW$370       .dwtag  DW_TAG_member
    3468                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$33)
    3469                      .dwattr $C$DW$370, DW_AT_name("sym")
    3470                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_sym")
    3471                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3472                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3473              $C$DW$371       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$32)
    3475                      .dwattr $C$DW$371, DW_AT_name("beam")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   74

    3476                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_beam")
    3477                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3478                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3479              $C$DW$372       .dwtag  DW_TAG_member
    3480                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$32)
    3481                      .dwattr $C$DW$372, DW_AT_name("time")
    3482                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_time")
    3483                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3484                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3485                      .dwendtag $C$DW$T$34
    3486              
    3487              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    3488                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
    3489                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    3490              
    3491              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3492                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x03)
    3493              $C$DW$373       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$35)
    3495                      .dwattr $C$DW$373, DW_AT_name("cur_sym")
    3496                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_cur_sym")
    3497                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3498                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3499              $C$DW$374       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$9)
    3501                      .dwattr $C$DW$374, DW_AT_name("cur_state")
    3502                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_cur_state")
    3503                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3504                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3505                      .dwendtag $C$DW$T$36
    3506              
    3507              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    3508                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$36)
    3509                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3510              
    3511              $C$DW$T$82      .dwtag  DW_TAG_array_type
    3512                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    3513                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3514                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x06)
    3515              $C$DW$375       .dwtag  DW_TAG_subrange_type
    3516                      .dwattr $C$DW$375, DW_AT_upper_bound(0x01)
    3517                      .dwendtag $C$DW$T$82
    3518              
    3519              
    3520              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3521                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    3522              $C$DW$376       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$9)
    3524                      .dwattr $C$DW$376, DW_AT_name("max_nbr_syms")
    3525                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_max_nbr_syms")
    3526                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3527                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3528              $C$DW$377       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$8)
    3530                      .dwattr $C$DW$377, DW_AT_name("nbr_syms")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   75

    3531                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_nbr_syms")
    3532                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3533                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3534              $C$DW$378       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$22)
    3536                      .dwattr $C$DW$378, DW_AT_name("sym2pos")
    3537                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_sym2pos")
    3538                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3539                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3540              $C$DW$379       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$37)
    3542                      .dwattr $C$DW$379, DW_AT_name("syms")
    3543                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_syms")
    3544                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3545                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3546                      .dwendtag $C$DW$T$38
    3547              
    3548              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    3549                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$38)
    3550                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3551              
    3552              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3553                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x16)
    3554              $C$DW$380       .dwtag  DW_TAG_member
    3555                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$8)
    3556                      .dwattr $C$DW$380, DW_AT_name("scr")
    3557                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_scr")
    3558                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3559                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3560              $C$DW$381       .dwtag  DW_TAG_member
    3561                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$8)
    3562                      .dwattr $C$DW$381, DW_AT_name("n_ans")
    3563                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_n_ans")
    3564                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3565                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3566              $C$DW$382       .dwtag  DW_TAG_member
    3567                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$39)
    3568                      .dwattr $C$DW$382, DW_AT_name("answers")
    3569                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_answers")
    3570                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3571                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3572                      .dwendtag $C$DW$T$40
    3573              
    3574              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    3575                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    3576                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3577              
    3578              $C$DW$T$43      .dwtag  DW_TAG_array_type
    3579                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3580                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3581                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x294)
    3582              $C$DW$383       .dwtag  DW_TAG_subrange_type
    3583                      .dwattr $C$DW$383, DW_AT_upper_bound(0x1d)
    3584                      .dwendtag $C$DW$T$43
    3585              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   76

    3586              
    3587              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3588                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x2b3)
    3589              $C$DW$384       .dwtag  DW_TAG_member
    3590                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$8)
    3591                      .dwattr $C$DW$384, DW_AT_name("n_bests")
    3592                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_n_bests")
    3593                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3594                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3595              $C$DW$385       .dwtag  DW_TAG_member
    3596                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$41)
    3597                      .dwattr $C$DW$385, DW_AT_name("best_idx")
    3598                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_best_idx")
    3599                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3600                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3601              $C$DW$386       .dwtag  DW_TAG_member
    3602                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$43)
    3603                      .dwattr $C$DW$386, DW_AT_name("elem")
    3604                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_elem")
    3605                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3606                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3607                      .dwendtag $C$DW$T$44
    3608              
    3609              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    3610                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$44)
    3611                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3612              
    3613              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3614                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x03)
    3615              $C$DW$387       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$8)
    3617                      .dwattr $C$DW$387, DW_AT_name("mean")
    3618                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_mean")
    3619                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3620                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3621              $C$DW$388       .dwtag  DW_TAG_member
    3622                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$8)
    3623                      .dwattr $C$DW$388, DW_AT_name("inv")
    3624                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_inv")
    3625                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3626                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3627              $C$DW$389       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$8)
    3629                      .dwattr $C$DW$389, DW_AT_name("gconst")
    3630                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_gconst")
    3631                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3632                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3633                      .dwendtag $C$DW$T$45
    3634              
    3635              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    3636                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$45)
    3637                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3638              
    3639              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3640                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x544)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   77

    3641              $C$DW$390       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$46)
    3643                      .dwattr $C$DW$390, DW_AT_name("base_mem")
    3644                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_base_mem")
    3645                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3646                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3647              $C$DW$391       .dwtag  DW_TAG_member
    3648                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$21)
    3649                      .dwattr $C$DW$391, DW_AT_name("mem_count")
    3650                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_mem_count")
    3651                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    3652                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3653              $C$DW$392       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$24)
    3655                      .dwattr $C$DW$392, DW_AT_name("answers")
    3656                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_answers")
    3657                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    3658                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3659              $C$DW$393       .dwtag  DW_TAG_member
    3660                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$24)
    3661                      .dwattr $C$DW$393, DW_AT_name("uStp")
    3662                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_uStp")
    3663                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    3664                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3665              $C$DW$394       .dwtag  DW_TAG_member
    3666                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$21)
    3667                      .dwattr $C$DW$394, DW_AT_name("nWords")
    3668                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_nWords")
    3669                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    3670                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3671              $C$DW$395       .dwtag  DW_TAG_member
    3672                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$8)
    3673                      .dwattr $C$DW$395, DW_AT_name("nS")
    3674                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_nS")
    3675                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    3676                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3677              $C$DW$396       .dwtag  DW_TAG_member
    3678                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$22)
    3679                      .dwattr $C$DW$396, DW_AT_name("cm_scr")
    3680                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_cm_scr")
    3681                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    3682                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3683              $C$DW$397       .dwtag  DW_TAG_member
    3684                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$8)
    3685                      .dwattr $C$DW$397, DW_AT_name("bNeedUpdate")
    3686                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_bNeedUpdate")
    3687                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    3688                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3689              $C$DW$398       .dwtag  DW_TAG_member
    3690                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$22)
    3691                      .dwattr $C$DW$398, DW_AT_name("cm_anti_scr")
    3692                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_cm_anti_scr")
    3693                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    3694                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3695              $C$DW$399       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   78

    3696                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$12)
    3697                      .dwattr $C$DW$399, DW_AT_name("cm_fg_scr")
    3698                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_cm_fg_scr")
    3699                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    3700                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3701              $C$DW$400       .dwtag  DW_TAG_member
    3702                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$12)
    3703                      .dwattr $C$DW$400, DW_AT_name("cm_bk_scr")
    3704                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_cm_bk_scr")
    3705                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    3706                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3707              $C$DW$401       .dwtag  DW_TAG_member
    3708                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$8)
    3709                      .dwattr $C$DW$401, DW_AT_name("th_nbest")
    3710                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_th_nbest")
    3711                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    3712                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3713              $C$DW$402       .dwtag  DW_TAG_member
    3714                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$8)
    3715                      .dwattr $C$DW$402, DW_AT_name("nSpeech")
    3716                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_nSpeech")
    3717                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    3718                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3719              $C$DW$403       .dwtag  DW_TAG_member
    3720                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$8)
    3721                      .dwattr $C$DW$403, DW_AT_name("nNoise")
    3722                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_nNoise")
    3723                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    3724                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3725              $C$DW$404       .dwtag  DW_TAG_member
    3726                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$12)
    3727                      .dwattr $C$DW$404, DW_AT_name("speech_power")
    3728                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_speech_power")
    3729                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    3730                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3731              $C$DW$405       .dwtag  DW_TAG_member
    3732                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$12)
    3733                      .dwattr $C$DW$405, DW_AT_name("noise_power")
    3734                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_noise_power")
    3735                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    3736                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3737              $C$DW$406       .dwtag  DW_TAG_member
    3738                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$12)
    3739                      .dwattr $C$DW$406, DW_AT_name("noise_power_sqr")
    3740                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_noise_power_sqr")
    3741                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    3742                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3743              $C$DW$407       .dwtag  DW_TAG_member
    3744                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$8)
    3745                      .dwattr $C$DW$407, DW_AT_name("NSNR")
    3746                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_NSNR")
    3747                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    3748                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3749              $C$DW$408       .dwtag  DW_TAG_member
    3750                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$47)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   79

    3751                      .dwattr $C$DW$408, DW_AT_name("H0")
    3752                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_H0")
    3753                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    3754                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3755              $C$DW$409       .dwtag  DW_TAG_member
    3756                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$47)
    3757                      .dwattr $C$DW$409, DW_AT_name("H1")
    3758                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_H1")
    3759                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    3760                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3761              $C$DW$410       .dwtag  DW_TAG_member
    3762                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$22)
    3763                      .dwattr $C$DW$410, DW_AT_name("lgBeta")
    3764                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_lgBeta")
    3765                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    3766                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3767              $C$DW$411       .dwtag  DW_TAG_member
    3768                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$48)
    3769                      .dwattr $C$DW$411, DW_AT_name("acc_dif2_beta")
    3770                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_acc_dif2_beta")
    3771                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    3772                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3773              $C$DW$412       .dwtag  DW_TAG_member
    3774                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$8)
    3775                      .dwattr $C$DW$412, DW_AT_name("bCalced")
    3776                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_bCalced")
    3777                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    3778                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3779              $C$DW$413       .dwtag  DW_TAG_member
    3780                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$22)
    3781                      .dwattr $C$DW$413, DW_AT_name("sCH")
    3782                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_sCH")
    3783                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    3784                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3785              $C$DW$414       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$48)
    3787                      .dwattr $C$DW$414, DW_AT_name("lAccum")
    3788                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_lAccum")
    3789                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    3790                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3791              $C$DW$415       .dwtag  DW_TAG_member
    3792                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$8)
    3793                      .dwattr $C$DW$415, DW_AT_name("adp_th")
    3794                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_adp_th")
    3795                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    3796                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3797                      .dwendtag $C$DW$T$49
    3798              
    3799              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    3800                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$49)
    3801                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3802              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    3803                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    3804                      .dwattr $C$DW$T$90, DW_AT_address_class(0x17)
    3805              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   80

    3806                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    3807              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3808                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3809                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3810                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3811              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3812                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3813                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3814                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3815              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3816                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3817                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3818                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3819              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3820                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3821                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3822                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3823              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3824                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3825                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3826                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3827              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3828                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$8)
    3829                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    3830              
    3831              $C$DW$T$41      .dwtag  DW_TAG_array_type
    3832                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$8)
    3833                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3834                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e)
    3835              $C$DW$416       .dwtag  DW_TAG_subrange_type
    3836                      .dwattr $C$DW$416, DW_AT_upper_bound(0x1d)
    3837                      .dwendtag $C$DW$T$41
    3838              
    3839              
    3840              $C$DW$T$46      .dwtag  DW_TAG_array_type
    3841                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$8)
    3842                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3843                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x514)
    3844              $C$DW$417       .dwtag  DW_TAG_subrange_type
    3845                      .dwattr $C$DW$417, DW_AT_upper_bound(0x513)
    3846                      .dwendtag $C$DW$T$46
    3847              
    3848              
    3849              $C$DW$T$51      .dwtag  DW_TAG_array_type
    3850                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    3851                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3852                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    3853              $C$DW$418       .dwtag  DW_TAG_subrange_type
    3854                      .dwattr $C$DW$418, DW_AT_upper_bound(0xff)
    3855                      .dwendtag $C$DW$T$51
    3856              
    3857              
    3858              $C$DW$T$52      .dwtag  DW_TAG_array_type
    3859                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    3860                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   81

    3861                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x10)
    3862              $C$DW$419       .dwtag  DW_TAG_subrange_type
    3863                      .dwattr $C$DW$419, DW_AT_upper_bound(0x0f)
    3864                      .dwendtag $C$DW$T$52
    3865              
    3866              
    3867              $C$DW$T$53      .dwtag  DW_TAG_array_type
    3868                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
    3869                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3870                      .dwattr $C$DW$T$53, DW_AT_byte_size(0xe0)
    3871              $C$DW$420       .dwtag  DW_TAG_subrange_type
    3872                      .dwattr $C$DW$420, DW_AT_upper_bound(0x0d)
    3873              $C$DW$421       .dwtag  DW_TAG_subrange_type
    3874                      .dwattr $C$DW$421, DW_AT_upper_bound(0x0f)
    3875                      .dwendtag $C$DW$T$53
    3876              
    3877              $C$DW$422       .dwtag  DW_TAG_TI_far_type
    3878                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$8)
    3879              $C$DW$T$54      .dwtag  DW_TAG_const_type
    3880                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$422)
    3881              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    3882                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3883                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    3884              
    3885              $C$DW$T$56      .dwtag  DW_TAG_array_type
    3886                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3887                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3888                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x20)
    3889              $C$DW$423       .dwtag  DW_TAG_subrange_type
    3890                      .dwattr $C$DW$423, DW_AT_upper_bound(0x0f)
    3891                      .dwendtag $C$DW$T$56
    3892              
    3893              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    3894                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$55)
    3895                      .dwattr $C$DW$T$99, DW_AT_address_class(0x17)
    3896              
    3897              $C$DW$T$60      .dwtag  DW_TAG_array_type
    3898                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    3899                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3900                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x80)
    3901              $C$DW$424       .dwtag  DW_TAG_subrange_type
    3902                      .dwattr $C$DW$424, DW_AT_upper_bound(0x7f)
    3903                      .dwendtag $C$DW$T$60
    3904              
    3905              
    3906              $C$DW$T$61      .dwtag  DW_TAG_array_type
    3907                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$8)
    3908                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3909                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x1a)
    3910              $C$DW$425       .dwtag  DW_TAG_subrange_type
    3911                      .dwattr $C$DW$425, DW_AT_upper_bound(0x19)
    3912                      .dwendtag $C$DW$T$61
    3913              
    3914              
    3915              $C$DW$T$79      .dwtag  DW_TAG_array_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   82

    3916                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$8)
    3917                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3918                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x20)
    3919              $C$DW$426       .dwtag  DW_TAG_subrange_type
    3920                      .dwattr $C$DW$426, DW_AT_upper_bound(0x1f)
    3921                      .dwendtag $C$DW$T$79
    3922              
    3923              
    3924              $C$DW$T$85      .dwtag  DW_TAG_array_type
    3925                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$8)
    3926                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3927                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x14)
    3928              $C$DW$427       .dwtag  DW_TAG_subrange_type
    3929                      .dwattr $C$DW$427, DW_AT_upper_bound(0x13)
    3930                      .dwendtag $C$DW$T$85
    3931              
    3932              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3933                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3934                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3935                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3936              
    3937              $C$DW$T$29      .dwtag  DW_TAG_array_type
    3938                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$9)
    3939                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3940                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3941              $C$DW$428       .dwtag  DW_TAG_subrange_type
    3942                      .dwattr $C$DW$428, DW_AT_upper_bound(0x00)
    3943                      .dwendtag $C$DW$T$29
    3944              
    3945              
    3946              $C$DW$T$35      .dwtag  DW_TAG_array_type
    3947                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    3948                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3949                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3950              $C$DW$429       .dwtag  DW_TAG_subrange_type
    3951                      .dwattr $C$DW$429, DW_AT_upper_bound(0x01)
    3952                      .dwendtag $C$DW$T$35
    3953              
    3954              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3955                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$9)
    3956                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    3957              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    3958                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    3959                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    3960              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    3961                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    3962                      .dwattr $C$DW$T$24, DW_AT_address_class(0x17)
    3963              
    3964              $C$DW$T$39      .dwtag  DW_TAG_array_type
    3965                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$21)
    3966                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3967                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    3968              $C$DW$430       .dwtag  DW_TAG_subrange_type
    3969                      .dwattr $C$DW$430, DW_AT_upper_bound(0x13)
    3970                      .dwendtag $C$DW$T$39
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   83

    3971              
    3972              
    3973              $C$DW$T$86      .dwtag  DW_TAG_array_type
    3974                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$21)
    3975                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3976                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x02)
    3977              $C$DW$431       .dwtag  DW_TAG_subrange_type
    3978                      .dwattr $C$DW$431, DW_AT_upper_bound(0x01)
    3979                      .dwendtag $C$DW$T$86
    3980              
    3981              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3982                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3983                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3984                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3985              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3986                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3987                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3988                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    3989              $C$DW$T$12      .dwtag  DW_TAG_base_type
    3990                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3991                      .dwattr $C$DW$T$12, DW_AT_name("long")
    3992                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    3993              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    3994                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$12)
    3995                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
    3996              
    3997              $C$DW$T$62      .dwtag  DW_TAG_array_type
    3998                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$12)
    3999                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4000                      .dwattr $C$DW$T$62, DW_AT_byte_size(0xd0)
    4001              $C$DW$432       .dwtag  DW_TAG_subrange_type
    4002                      .dwattr $C$DW$432, DW_AT_upper_bound(0x67)
    4003                      .dwendtag $C$DW$T$62
    4004              
    4005              
    4006              $C$DW$T$65      .dwtag  DW_TAG_array_type
    4007                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$12)
    4008                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4009                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x20)
    4010              $C$DW$433       .dwtag  DW_TAG_subrange_type
    4011                      .dwattr $C$DW$433, DW_AT_upper_bound(0x0f)
    4012                      .dwendtag $C$DW$T$65
    4013              
    4014              $C$DW$T$13      .dwtag  DW_TAG_base_type
    4015                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4016                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4017                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    4018              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4019                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$13)
    4020                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    4021              $C$DW$T$14      .dwtag  DW_TAG_base_type
    4022                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4023                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    4024                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    4025                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   84

    4026                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    4027              $C$DW$T$15      .dwtag  DW_TAG_base_type
    4028                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4029                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4030                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    4031                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    4032                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    4033              $C$DW$T$16      .dwtag  DW_TAG_base_type
    4034                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4035                      .dwattr $C$DW$T$16, DW_AT_name("float")
    4036                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    4037              $C$DW$T$17      .dwtag  DW_TAG_base_type
    4038                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4039                      .dwattr $C$DW$T$17, DW_AT_name("double")
    4040                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    4041              $C$DW$T$18      .dwtag  DW_TAG_base_type
    4042                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4043                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    4044                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    4045              $C$DW$T$74      .dwtag  DW_TAG_base_type
    4046                      .dwattr $C$DW$T$74, DW_AT_encoding(DW_ATE_signed_char)
    4047                      .dwattr $C$DW$T$74, DW_AT_name("signed char")
    4048                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    4049              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    4050                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    4051                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    4052              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    4053                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$75)
    4054                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    4055              
    4056              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4057                      .dwattr $C$DW$T$50, DW_AT_name("ele")
    4058                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x03)
    4059              $C$DW$434       .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$9)
    4061                      .dwattr $C$DW$434, DW_AT_name("sym")
    4062                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_sym")
    4063                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4064                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4065              $C$DW$435       .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$9)
    4067                      .dwattr $C$DW$435, DW_AT_name("idx_flag")
    4068                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_idx_flag")
    4069                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4070                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4071              $C$DW$436       .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$9)
    4073                      .dwattr $C$DW$436, DW_AT_name("next")
    4074                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_next")
    4075                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4076                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4077                      .dwendtag $C$DW$T$50
    4078              
    4079              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    4080                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$50)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   85

    4081                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4082              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    4083                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    4084                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    4085              
    4086              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    4087                      .dwattr $C$DW$T$91, DW_AT_name("gmhmm_type")
    4088                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x7fe)
    4089              $C$DW$437       .dwtag  DW_TAG_member
    4090                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    4091                      .dwattr $C$DW$437, DW_AT_name("avedepth")
    4092                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_avedepth")
    4093                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4094                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4095              $C$DW$438       .dwtag  DW_TAG_member
    4096                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$21)
    4097                      .dwattr $C$DW$438, DW_AT_name("bestdepth")
    4098                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_bestdepth")
    4099                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4100                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4101              $C$DW$439       .dwtag  DW_TAG_member
    4102                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$21)
    4103                      .dwattr $C$DW$439, DW_AT_name("index_mean")
    4104                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_index_mean")
    4105                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4106                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4107              $C$DW$440       .dwtag  DW_TAG_member
    4108                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$21)
    4109                      .dwattr $C$DW$440, DW_AT_name("signal_cnt")
    4110                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_signal_cnt")
    4111                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4112                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4113              $C$DW$441       .dwtag  DW_TAG_member
    4114                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$8)
    4115                      .dwattr $C$DW$441, DW_AT_name("buf_idx")
    4116                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_buf_idx")
    4117                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4118                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4119              $C$DW$442       .dwtag  DW_TAG_member
    4120                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$21)
    4121                      .dwattr $C$DW$442, DW_AT_name("speech_detected")
    4122                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_speech_detected")
    4123                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4124                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4125              $C$DW$443       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$21)
    4127                      .dwattr $C$DW$443, DW_AT_name("mfcc_cnt")
    4128                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_mfcc_cnt")
    4129                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4130                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4131              $C$DW$444       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$21)
    4133                      .dwattr $C$DW$444, DW_AT_name("nbr_cpy")
    4134                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_nbr_cpy")
    4135                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   86

    4136                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4137              $C$DW$445       .dwtag  DW_TAG_member
    4138                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$8)
    4139                      .dwattr $C$DW$445, DW_AT_name("last_sig")
    4140                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_last_sig")
    4141                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4142                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4143              $C$DW$446       .dwtag  DW_TAG_member
    4144                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$51)
    4145                      .dwattr $C$DW$446, DW_AT_name("sample_signal")
    4146                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_sample_signal")
    4147                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4148                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4149              $C$DW$447       .dwtag  DW_TAG_member
    4150                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$8)
    4151                      .dwattr $C$DW$447, DW_AT_name("amplitude_max")
    4152                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_amplitude_max")
    4153                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    4154                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4155              $C$DW$448       .dwtag  DW_TAG_member
    4156                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$8)
    4157                      .dwattr $C$DW$448, DW_AT_name("amplitude_min")
    4158                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_amplitude_min")
    4159                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    4160                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4161              $C$DW$449       .dwtag  DW_TAG_member
    4162                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$8)
    4163                      .dwattr $C$DW$449, DW_AT_name("pred_first_frame")
    4164                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_pred_first_frame")
    4165                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    4166                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4167              $C$DW$450       .dwtag  DW_TAG_member
    4168                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$8)
    4169                      .dwattr $C$DW$450, DW_AT_name("frm_cnt")
    4170                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_frm_cnt")
    4171                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    4172                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4173              $C$DW$451       .dwtag  DW_TAG_member
    4174                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$8)
    4175                      .dwattr $C$DW$451, DW_AT_name("beam_count")
    4176                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_beam_count")
    4177                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    4178                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4179              $C$DW$452       .dwtag  DW_TAG_member
    4180                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$8)
    4181                      .dwattr $C$DW$452, DW_AT_name("active_beam_cells")
    4182                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_active_beam_cells")
    4183                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    4184                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4185              $C$DW$453       .dwtag  DW_TAG_member
    4186                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$8)
    4187                      .dwattr $C$DW$453, DW_AT_name("active_time_cells")
    4188                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_active_time_cells")
    4189                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    4190                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2132810                         PAGE   87

    4191              $C$DW$454       .dwtag  DW_TAG_member
    4192                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$9)
    4193                      .dwattr $C$DW$454, DW_AT_name("ending_sym_count")
    4194                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_ending_sym_count")
    4195                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    4196                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4197              $C$DW$455       .dwtag  DW_TAG_member
    4198                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$8)
    4199                      .dwattr $C$DW$455, DW_AT_name("comp_type")
    4200                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_comp_type")
    4201                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    4202                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4203              $C$DW$456       .dwtag  DW_TAG_member
    4204                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$9)
    4205                      .dwattr $C$DW$456, DW_AT_name("low_vol_limit")
    4206                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_low_vol_limit")
    4207                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    4208                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4209              $C$DW$457       .dwtag  DW_TAG_member
    4210                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$9)
    4211                      .dwattr $C$DW$457, DW_AT_name("high_vol_limit")
    4212                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_high_vol_limit")
    4213                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
    4214                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4215              $C$DW$458       .dwtag  DW_TAG_member
    4216                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$8)
    4217                      .dwattr $C$DW$458, DW_AT_name("vol")
    4218                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_vol")
    4219                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    4220                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4221              $C$DW$459       .dwtag  DW_TAG_member
    4222                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$21)
    4223                      .dwattr $C$DW$459, DW_AT_name("n_mfcc")
    4224                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_n_mfcc")
    4225                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    4226                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4227              $C$DW$460       .dwtag  DW_TAG_member
    4228                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$8)
    4229                      .dwattr $C$DW$460, DW_AT_name("nbr_dim")
    4230                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_nbr_dim")
    4231                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    4232                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4233              $C$DW$461       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$21)
    4235                      .dwattr $C$DW$461, DW_AT_name("n_filter")
    4236                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_n_filter")
    4237                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    4238                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4239              $C$DW$462       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$53)
    4241                      .dwattr $C$DW$462, DW_AT_name("mfcc_buf")
    4242                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_mfcc_buf")
    4243                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    4244                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$463       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:40 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
