TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE    1

    2567              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:41 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         0000a3 B590 
     274              ||      AADD AR1, AR3 ; |76| 
     275              
     276                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     277 0000a5 F716          ADD #1, *SP(#11) ; |66| 
         0000a7 0001 
     278 0000a9       $C$DW$L$_observation_likelihood$4$E:
     279 0000a9       $C$L4:    
     280 0000a9       $C$DW$L$_observation_likelihood$5$B:
     281 0000a9 ED04          MOV dbl(*SP(#2)), XAR3
         0000ab BF   
     282 0000ac A461          MOV *AR3, T0 ; |66| 
     283 0000ae ED10          MOV dbl(*SP(#8)), XAR3
         0000b0 BF   
     284 0000b1 ED6D          MOV dbl(*AR3(#1190)), XAR3
         0000b3 BF04 
         0000b5 A6   
     285 0000b6 A96B          MOV *AR3(T0), AR1 ; |66| 
     286              
     287 0000ba 4319          SUB #1, AR1 ; |66| 
     288 0000b8 AA16  ||      MOV *SP(#11), AR2 ; |66| 
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE    7

     289              
     290 0000bc 12A4          CMPU AR2 < AR1, TC1 ; |66| 
         0000be 94   
     291 0000bf 6D64          BCC $C$L1,TC1 ; |66| 
         0000c1 FF5E 
     292                                                      ; branchcc occurs ; |66| 
     293 0000c3       $C$DW$L$_observation_likelihood$5$E:
     294                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     295 0000c3 4E31          AADD #49, SP
     296                      .dwcfi  cfa_offset, 1
     297              $C$DW$36        .dwtag  DW_TAG_TI_branch
     298                      .dwattr $C$DW$36, DW_AT_low_pc(0x00)
     299                      .dwattr $C$DW$36, DW_AT_TI_return
     300 0000c5 4804          RET
     301                                                      ; return occurs
     302              
     303              $C$DW$37        .dwtag  DW_TAG_TI_loop
     304                      .dwattr $C$DW$37, DW_AT_name("C:\\Users\\a0221074\\AppData\\Local\\Temp\\0612010:$C$L4:1:1505334821")
     305                      .dwattr $C$DW$37, DW_AT_TI_begin_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/C
     306                      .dwattr $C$DW$37, DW_AT_TI_begin_line(0x42)
     307                      .dwattr $C$DW$37, DW_AT_TI_end_line(0x4c)
     308              $C$DW$38        .dwtag  DW_TAG_TI_loop_range
     309                      .dwattr $C$DW$38, DW_AT_low_pc($C$DW$L$_observation_likelihood$5$B)
     310                      .dwattr $C$DW$38, DW_AT_high_pc($C$DW$L$_observation_likelihood$5$E)
     311              $C$DW$39        .dwtag  DW_TAG_TI_loop_range
     312                      .dwattr $C$DW$39, DW_AT_low_pc($C$DW$L$_observation_likelihood$2$B)
     313                      .dwattr $C$DW$39, DW_AT_high_pc($C$DW$L$_observation_likelihood$2$E)
     314              $C$DW$40        .dwtag  DW_TAG_TI_loop_range
     315                      .dwattr $C$DW$40, DW_AT_low_pc($C$DW$L$_observation_likelihood$4$B)
     316                      .dwattr $C$DW$40, DW_AT_high_pc($C$DW$L$_observation_likelihood$4$E)
     317              
     318              $C$DW$41        .dwtag  DW_TAG_TI_loop
     319                      .dwattr $C$DW$41, DW_AT_name("C:\\Users\\a0221074\\AppData\\Local\\Temp\\0612010:$C$L2:2:1505334821")
     320                      .dwattr $C$DW$41, DW_AT_TI_begin_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/C
     321                      .dwattr $C$DW$41, DW_AT_TI_begin_line(0x44)
     322                      .dwattr $C$DW$41, DW_AT_TI_end_line(0x4b)
     323              $C$DW$42        .dwtag  DW_TAG_TI_loop_range
     324                      .dwattr $C$DW$42, DW_AT_low_pc($C$DW$L$_observation_likelihood$3$B)
     325                      .dwattr $C$DW$42, DW_AT_high_pc($C$DW$L$_observation_likelihood$3$E)
     326                      .dwendtag $C$DW$41
     327              
     328                      .dwendtag $C$DW$37
     329              
     330                      .dwattr $C$DW$13, DW_AT_TI_end_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL
     331                      .dwattr $C$DW$13, DW_AT_TI_end_line(0x4e)
     332                      .dwattr $C$DW$13, DW_AT_TI_end_column(0x01)
     333                      .dwendentry
     334                      .dwendtag $C$DW$13
     335              
     336              ;******************************************************************************
     337              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     338              ;******************************************************************************
     339                      .global _vector_unpacking
     340                      .global _hlr_gauss_obs_score_f
     341              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE    8

     342              ;*******************************************************************************
     343              ;* TYPE INFORMATION                                                            *
     344              ;*******************************************************************************
     345              
     346              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     347                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
     348              $C$DW$43        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$8)
     350                      .dwattr $C$DW$43, DW_AT_name("num")
     351                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_num")
     352                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     353                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     354              $C$DW$44        .dwtag  DW_TAG_member
     355                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$8)
     356                      .dwattr $C$DW$44, DW_AT_name("x1")
     357                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_x1")
     358                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     359                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     360              $C$DW$45        .dwtag  DW_TAG_member
     361                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$8)
     362                      .dwattr $C$DW$45, DW_AT_name("x2")
     363                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_x2")
     364                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     365                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     366                      .dwendtag $C$DW$T$19
     367              
     368              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
     369                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$19)
     370                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     371              $C$DW$46        .dwtag  DW_TAG_TI_far_type
     372                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$57)
     373              $C$DW$T$58      .dwtag  DW_TAG_const_type
     374                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$46)
     375              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
     376                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
     377                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
     378              
     379              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     380                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     381              $C$DW$47        .dwtag  DW_TAG_member
     382                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
     383                      .dwattr $C$DW$47, DW_AT_name("max_mem_usage")
     384                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_max_mem_usage")
     385                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     386                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     387              $C$DW$48        .dwtag  DW_TAG_member
     388                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
     389                      .dwattr $C$DW$48, DW_AT_name("n_terminals")
     390                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_n_terminals")
     391                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     392                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     393              $C$DW$49        .dwtag  DW_TAG_member
     394                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$20)
     395                      .dwattr $C$DW$49, DW_AT_name("n_monophones")
     396                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_n_monophones")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE    9

     397                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     398                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     399              $C$DW$50        .dwtag  DW_TAG_member
     400                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     401                      .dwattr $C$DW$50, DW_AT_name("hlrTreeBase")
     402                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_hlrTreeBase")
     403                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     404                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     405              $C$DW$51        .dwtag  DW_TAG_member
     406                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$22)
     407                      .dwattr $C$DW$51, DW_AT_name("hlrTerminal")
     408                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_hlrTerminal")
     409                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     410                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     411              $C$DW$52        .dwtag  DW_TAG_member
     412                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     413                      .dwattr $C$DW$52, DW_AT_name("pHMM2phone")
     414                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_pHMM2phone")
     415                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     416                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     417              $C$DW$53        .dwtag  DW_TAG_member
     418                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$22)
     419                      .dwattr $C$DW$53, DW_AT_name("hlrTransformIndex")
     420                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_hlrTransformIndex")
     421                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     422                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     423              $C$DW$54        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
     425                      .dwattr $C$DW$54, DW_AT_name("hlr_TRANSFORM_SIZE")
     426                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
     427                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     428                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     429              $C$DW$55        .dwtag  DW_TAG_member
     430                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     431                      .dwattr $C$DW$55, DW_AT_name("hlrTransforms")
     432                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_hlrTransforms")
     433                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     434                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     435              $C$DW$56        .dwtag  DW_TAG_member
     436                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     437                      .dwattr $C$DW$56, DW_AT_name("pSegStat_dif1")
     438                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_pSegStat_dif1")
     439                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     440                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     441              $C$DW$57        .dwtag  DW_TAG_member
     442                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     443                      .dwattr $C$DW$57, DW_AT_name("pSegStat_dif2")
     444                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_pSegStat_dif2")
     445                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     446                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     447              $C$DW$58        .dwtag  DW_TAG_member
     448                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     449                      .dwattr $C$DW$58, DW_AT_name("pEnhanced")
     450                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_pEnhanced")
     451                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   10

     452                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     453              $C$DW$59        .dwtag  DW_TAG_member
     454                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     455                      .dwattr $C$DW$59, DW_AT_name("bk_node_cnt")
     456                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bk_node_cnt")
     457                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     458                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     459                      .dwendtag $C$DW$T$23
     460              
     461              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
     462                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$23)
     463                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     464              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
     465                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
     466                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
     467              
     468              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     469                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
     470              $C$DW$60        .dwtag  DW_TAG_member
     471                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$9)
     472                      .dwattr $C$DW$60, DW_AT_name("sym_code")
     473                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_sym_code")
     474                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     475                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     476              $C$DW$61        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$9)
     478                      .dwattr $C$DW$61, DW_AT_name("start_cell")
     479                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_start_cell")
     480                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     481                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     482              $C$DW$62        .dwtag  DW_TAG_member
     483                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$9)
     484                      .dwattr $C$DW$62, DW_AT_name("depth")
     485                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_depth")
     486                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     487                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     488                      .dwendtag $C$DW$T$24
     489              
     490              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
     491                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$24)
     492                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     493              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
     494                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
     495                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
     496              
     497              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     498                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
     499              $C$DW$63        .dwtag  DW_TAG_member
     500                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$8)
     501                      .dwattr $C$DW$63, DW_AT_name("scr")
     502                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_scr")
     503                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     504                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     505              $C$DW$64        .dwtag  DW_TAG_member
     506                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   11

     507                      .dwattr $C$DW$64, DW_AT_name("sym")
     508                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_sym")
     509                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     510                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     511              $C$DW$65        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$9)
     513                      .dwattr $C$DW$65, DW_AT_name("frm")
     514                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_frm")
     515                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     516                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     517                      .dwendtag $C$DW$T$25
     518              
     519              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
     520                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$25)
     521                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     522              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
     523                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
     524                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
     525              
     526              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     527                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     528              $C$DW$66        .dwtag  DW_TAG_member
     529                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$9)
     530                      .dwattr $C$DW$66, DW_AT_name("frm")
     531                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_frm")
     532                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     533                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     534              $C$DW$67        .dwtag  DW_TAG_member
     535                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$9)
     536                      .dwattr $C$DW$67, DW_AT_name("beam_idx")
     537                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_beam_idx")
     538                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     539                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     540                      .dwendtag $C$DW$T$26
     541              
     542              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
     543                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$26)
     544                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
     545              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
     546                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
     547                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
     548              
     549              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     550                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
     551              $C$DW$68        .dwtag  DW_TAG_member
     552                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$9)
     553                      .dwattr $C$DW$68, DW_AT_name("n_hmm")
     554                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_n_hmm")
     555                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     556                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     557              $C$DW$69        .dwtag  DW_TAG_member
     558                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$9)
     559                      .dwattr $C$DW$69, DW_AT_name("n_sym")
     560                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_n_sym")
     561                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   12

     562                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     563              $C$DW$70        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$9)
     565                      .dwattr $C$DW$70, DW_AT_name("n_word")
     566                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_n_word")
     567                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     568                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     569              $C$DW$71        .dwtag  DW_TAG_member
     570                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$9)
     571                      .dwattr $C$DW$71, DW_AT_name("n_set")
     572                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_n_set")
     573                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     574                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     575              $C$DW$72        .dwtag  DW_TAG_member
     576                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$9)
     577                      .dwattr $C$DW$72, DW_AT_name("n_hmm_set")
     578                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_n_hmm_set")
     579                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     580                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     581              $C$DW$73        .dwtag  DW_TAG_member
     582                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$9)
     583                      .dwattr $C$DW$73, DW_AT_name("start")
     584                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_start")
     585                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     586                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     587              $C$DW$74        .dwtag  DW_TAG_member
     588                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$9)
     589                      .dwattr $C$DW$74, DW_AT_name("stop")
     590                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_stop")
     591                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     592                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     593              $C$DW$75        .dwtag  DW_TAG_member
     594                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$27)
     595                      .dwattr $C$DW$75, DW_AT_name("symlist")
     596                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_symlist")
     597                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     598                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     599                      .dwendtag $C$DW$T$28
     600              
     601              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
     602                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$28)
     603                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
     604              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
     605                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
     606                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
     607              
     608              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     609                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     610              $C$DW$76        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$9)
     612                      .dwattr $C$DW$76, DW_AT_name("high_pos")
     613                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_high_pos")
     614                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     616              $C$DW$77        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   13

     617                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$9)
     618                      .dwattr $C$DW$77, DW_AT_name("cur_pos")
     619                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_cur_pos")
     620                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     621                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     622                      .dwendtag $C$DW$T$29
     623              
     624              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
     625                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     626                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     627              
     628              $C$DW$T$31      .dwtag  DW_TAG_array_type
     629                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     630                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     631                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
     632              $C$DW$78        .dwtag  DW_TAG_subrange_type
     633                      .dwattr $C$DW$78, DW_AT_upper_bound(0x01)
     634                      .dwendtag $C$DW$T$31
     635              
     636              
     637              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     638                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
     639              $C$DW$79        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$30)
     641                      .dwattr $C$DW$79, DW_AT_name("state")
     642                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_state")
     643                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     645              $C$DW$80        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$31)
     647                      .dwattr $C$DW$80, DW_AT_name("sym")
     648                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_sym")
     649                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     650                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     651              $C$DW$81        .dwtag  DW_TAG_member
     652                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$30)
     653                      .dwattr $C$DW$81, DW_AT_name("beam")
     654                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_beam")
     655                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     656                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     657              $C$DW$82        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$30)
     659                      .dwattr $C$DW$82, DW_AT_name("time")
     660                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_time")
     661                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     662                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     663                      .dwendtag $C$DW$T$32
     664              
     665              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
     666                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$32)
     667                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     668              
     669              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     670                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
     671              $C$DW$83        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   14

     672                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$33)
     673                      .dwattr $C$DW$83, DW_AT_name("cur_sym")
     674                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_cur_sym")
     675                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     676                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     677              $C$DW$84        .dwtag  DW_TAG_member
     678                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$9)
     679                      .dwattr $C$DW$84, DW_AT_name("cur_state")
     680                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_cur_state")
     681                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     682                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     683                      .dwendtag $C$DW$T$34
     684              
     685              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
     686                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$34)
     687                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
     688              
     689              $C$DW$T$82      .dwtag  DW_TAG_array_type
     690                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
     691                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
     692                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x06)
     693              $C$DW$85        .dwtag  DW_TAG_subrange_type
     694                      .dwattr $C$DW$85, DW_AT_upper_bound(0x01)
     695                      .dwendtag $C$DW$T$82
     696              
     697              
     698              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     699                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
     700              $C$DW$86        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$9)
     702                      .dwattr $C$DW$86, DW_AT_name("max_nbr_syms")
     703                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_max_nbr_syms")
     704                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     706              $C$DW$87        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$8)
     708                      .dwattr $C$DW$87, DW_AT_name("nbr_syms")
     709                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_nbr_syms")
     710                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     711                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     712              $C$DW$88        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
     714                      .dwattr $C$DW$88, DW_AT_name("sym2pos")
     715                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_sym2pos")
     716                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     717                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     718              $C$DW$89        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$35)
     720                      .dwattr $C$DW$89, DW_AT_name("syms")
     721                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_syms")
     722                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     723                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     724                      .dwendtag $C$DW$T$36
     725              
     726              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   15

     727                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$36)
     728                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
     729              
     730              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     731                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
     732              $C$DW$90        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$8)
     734                      .dwattr $C$DW$90, DW_AT_name("scr")
     735                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_scr")
     736                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     738              $C$DW$91        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$8)
     740                      .dwattr $C$DW$91, DW_AT_name("n_ans")
     741                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_n_ans")
     742                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     743                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     744              $C$DW$92        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$37)
     746                      .dwattr $C$DW$92, DW_AT_name("answers")
     747                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_answers")
     748                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     749                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     750                      .dwendtag $C$DW$T$38
     751              
     752              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
     753                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
     754                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     755              
     756              $C$DW$T$41      .dwtag  DW_TAG_array_type
     757                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
     758                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     759                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
     760              $C$DW$93        .dwtag  DW_TAG_subrange_type
     761                      .dwattr $C$DW$93, DW_AT_upper_bound(0x1d)
     762                      .dwendtag $C$DW$T$41
     763              
     764              
     765              $C$DW$T$42      .dwtag  DW_TAG_structure_type
     766                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
     767              $C$DW$94        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$8)
     769                      .dwattr $C$DW$94, DW_AT_name("n_bests")
     770                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_n_bests")
     771                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     773              $C$DW$95        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$39)
     775                      .dwattr $C$DW$95, DW_AT_name("best_idx")
     776                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_best_idx")
     777                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     778                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     779              $C$DW$96        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$41)
     781                      .dwattr $C$DW$96, DW_AT_name("elem")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   16

     782                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_elem")
     783                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     784                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     785                      .dwendtag $C$DW$T$42
     786              
     787              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
     788                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$42)
     789                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
     790              
     791              $C$DW$T$43      .dwtag  DW_TAG_structure_type
     792                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
     793              $C$DW$97        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
     795                      .dwattr $C$DW$97, DW_AT_name("alpha_p")
     796                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_alpha_p")
     797                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     799              $C$DW$98        .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
     801                      .dwattr $C$DW$98, DW_AT_name("sAlpha")
     802                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_sAlpha")
     803                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     804                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$99        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$8)
     807                      .dwattr $C$DW$99, DW_AT_name("sBeta")
     808                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_sBeta")
     809                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     810                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$100       .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$8)
     813                      .dwattr $C$DW$100, DW_AT_name("lambdaLTEhigherE")
     814                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
     815                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     816                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     817              $C$DW$101       .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$8)
     819                      .dwattr $C$DW$101, DW_AT_name("frm_count")
     820                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_frm_count")
     821                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     822                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     823              $C$DW$102       .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
     825                      .dwattr $C$DW$102, DW_AT_name("prob_sp")
     826                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_prob_sp")
     827                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     828                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$103       .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
     831                      .dwattr $C$DW$103, DW_AT_name("s_noise_floor")
     832                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_s_noise_floor")
     833                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     834                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     835              $C$DW$104       .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   17

     837                      .dwattr $C$DW$104, DW_AT_name("snr")
     838                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_snr")
     839                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     840                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     841              $C$DW$105       .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$21)
     843                      .dwattr $C$DW$105, DW_AT_name("ps_long_term_noise")
     844                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ps_long_term_noise")
     845                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     846                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     847              $C$DW$106       .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$8)
     849                      .dwattr $C$DW$106, DW_AT_name("frmEn")
     850                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_frmEn")
     851                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     852                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$107       .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$8)
     855                      .dwattr $C$DW$107, DW_AT_name("meanEn")
     856                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_meanEn")
     857                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     858                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$108       .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$8)
     861                      .dwattr $C$DW$108, DW_AT_name("prevMeanEn")
     862                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_prevMeanEn")
     863                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     864                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     865              $C$DW$109       .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$8)
     867                      .dwattr $C$DW$109, DW_AT_name("noiselvl")
     868                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_noiselvl")
     869                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     870                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     871              $C$DW$110       .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$8)
     873                      .dwattr $C$DW$110, DW_AT_name("lambdaLTE")
     874                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_lambdaLTE")
     875                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     876                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$111       .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$8)
     879                      .dwattr $C$DW$111, DW_AT_name("nbSpeechFrame")
     880                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_nbSpeechFrame")
     881                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     882                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$112       .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$8)
     885                      .dwattr $C$DW$112, DW_AT_name("hangOver")
     886                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_hangOver")
     887                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     888                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     889                      .dwendtag $C$DW$T$43
     890              
     891              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   18

     892                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$43)
     893                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
     894              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
     895                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
     896                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
     897              
     898              $C$DW$T$44      .dwtag  DW_TAG_structure_type
     899                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
     900              $C$DW$113       .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$8)
     902                      .dwattr $C$DW$113, DW_AT_name("mean")
     903                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_mean")
     904                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     906              $C$DW$114       .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$8)
     908                      .dwattr $C$DW$114, DW_AT_name("inv")
     909                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_inv")
     910                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     911                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     912              $C$DW$115       .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$8)
     914                      .dwattr $C$DW$115, DW_AT_name("gconst")
     915                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_gconst")
     916                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     917                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     918                      .dwendtag $C$DW$T$44
     919              
     920              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
     921                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
     922                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     923              
     924              $C$DW$T$48      .dwtag  DW_TAG_structure_type
     925                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
     926              $C$DW$116       .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$45)
     928                      .dwattr $C$DW$116, DW_AT_name("base_mem")
     929                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_base_mem")
     930                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     932              $C$DW$117       .dwtag  DW_TAG_member
     933                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
     934                      .dwattr $C$DW$117, DW_AT_name("mem_count")
     935                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_mem_count")
     936                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
     937                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     938              $C$DW$118       .dwtag  DW_TAG_member
     939                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$22)
     940                      .dwattr $C$DW$118, DW_AT_name("answers")
     941                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_answers")
     942                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
     943                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     944              $C$DW$119       .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$22)
     946                      .dwattr $C$DW$119, DW_AT_name("uStp")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   19

     947                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_uStp")
     948                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
     949                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     950              $C$DW$120       .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
     952                      .dwattr $C$DW$120, DW_AT_name("nWords")
     953                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_nWords")
     954                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
     955                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     956              $C$DW$121       .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$8)
     958                      .dwattr $C$DW$121, DW_AT_name("nS")
     959                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_nS")
     960                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
     961                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     962              $C$DW$122       .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
     964                      .dwattr $C$DW$122, DW_AT_name("cm_scr")
     965                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_cm_scr")
     966                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
     967                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$123       .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$8)
     970                      .dwattr $C$DW$123, DW_AT_name("bNeedUpdate")
     971                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bNeedUpdate")
     972                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
     973                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     974              $C$DW$124       .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
     976                      .dwattr $C$DW$124, DW_AT_name("cm_anti_scr")
     977                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_cm_anti_scr")
     978                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
     979                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     980              $C$DW$125       .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$12)
     982                      .dwattr $C$DW$125, DW_AT_name("cm_fg_scr")
     983                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_cm_fg_scr")
     984                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
     985                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     986              $C$DW$126       .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$12)
     988                      .dwattr $C$DW$126, DW_AT_name("cm_bk_scr")
     989                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_cm_bk_scr")
     990                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
     991                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     992              $C$DW$127       .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$8)
     994                      .dwattr $C$DW$127, DW_AT_name("th_nbest")
     995                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_th_nbest")
     996                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
     997                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     998              $C$DW$128       .dwtag  DW_TAG_member
     999                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$8)
    1000                      .dwattr $C$DW$128, DW_AT_name("nSpeech")
    1001                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_nSpeech")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   20

    1002                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    1003                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1004              $C$DW$129       .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$8)
    1006                      .dwattr $C$DW$129, DW_AT_name("nNoise")
    1007                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_nNoise")
    1008                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    1009                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$130       .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$12)
    1012                      .dwattr $C$DW$130, DW_AT_name("speech_power")
    1013                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_speech_power")
    1014                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    1015                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1016              $C$DW$131       .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$12)
    1018                      .dwattr $C$DW$131, DW_AT_name("noise_power")
    1019                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_noise_power")
    1020                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    1021                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1022              $C$DW$132       .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$12)
    1024                      .dwattr $C$DW$132, DW_AT_name("noise_power_sqr")
    1025                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_noise_power_sqr")
    1026                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    1027                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1028              $C$DW$133       .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$8)
    1030                      .dwattr $C$DW$133, DW_AT_name("NSNR")
    1031                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_NSNR")
    1032                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    1033                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1034              $C$DW$134       .dwtag  DW_TAG_member
    1035                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$46)
    1036                      .dwattr $C$DW$134, DW_AT_name("H0")
    1037                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_H0")
    1038                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    1039                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1040              $C$DW$135       .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$46)
    1042                      .dwattr $C$DW$135, DW_AT_name("H1")
    1043                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_H1")
    1044                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    1045                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1046              $C$DW$136       .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    1048                      .dwattr $C$DW$136, DW_AT_name("lgBeta")
    1049                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_lgBeta")
    1050                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    1051                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1052              $C$DW$137       .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$47)
    1054                      .dwattr $C$DW$137, DW_AT_name("acc_dif2_beta")
    1055                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_acc_dif2_beta")
    1056                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   21

    1057                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1058              $C$DW$138       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$8)
    1060                      .dwattr $C$DW$138, DW_AT_name("bCalced")
    1061                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bCalced")
    1062                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    1063                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1064              $C$DW$139       .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    1066                      .dwattr $C$DW$139, DW_AT_name("sCH")
    1067                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_sCH")
    1068                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    1069                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1070              $C$DW$140       .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$47)
    1072                      .dwattr $C$DW$140, DW_AT_name("lAccum")
    1073                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_lAccum")
    1074                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    1075                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1076              $C$DW$141       .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$8)
    1078                      .dwattr $C$DW$141, DW_AT_name("adp_th")
    1079                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_adp_th")
    1080                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    1081                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1082                      .dwendtag $C$DW$T$48
    1083              
    1084              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    1085                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$48)
    1086                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1087              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    1088                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1089                      .dwattr $C$DW$T$90, DW_AT_address_class(0x17)
    1090              
    1091              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1092                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1093              $C$DW$142       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$8)
    1095                      .dwattr $C$DW$142, DW_AT_name("tran")
    1096                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_tran")
    1097                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$143       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    1101                      .dwattr $C$DW$143, DW_AT_name("pdf_idx")
    1102                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_pdf_idx")
    1103                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1104                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1105                      .dwendtag $C$DW$T$49
    1106              
    1107              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("HmmType")
    1108                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$49)
    1109                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1110              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    1111                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   22

    1112                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    1113              
    1114              $C$DW$T$94      .dwtag  DW_TAG_enumeration_type
    1115                      .dwattr $C$DW$T$94, DW_AT_name("ObsType")
    1116                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x01)
    1117              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("VITERBI"), DW_AT_const_value(0x00)
    1118              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("FULL"), DW_AT_const_value(0x01)
    1119              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("COMPONENT"), DW_AT_const_value(0x02)
    1120                      .dwendtag $C$DW$T$94
    1121              
    1122              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("ObsType")
    1123                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    1124                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1125              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1126                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1127                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1128                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1129              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1130                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1131                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1132                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1133              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1134                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1135                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1136                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1137              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1138                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1139                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1140                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1141              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1142                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1143                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1144                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1145              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    1146                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$8)
    1147                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    1148              
    1149              $C$DW$T$39      .dwtag  DW_TAG_array_type
    1150                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
    1151                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1152                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    1153              $C$DW$147       .dwtag  DW_TAG_subrange_type
    1154                      .dwattr $C$DW$147, DW_AT_upper_bound(0x1d)
    1155                      .dwendtag $C$DW$T$39
    1156              
    1157              
    1158              $C$DW$T$45      .dwtag  DW_TAG_array_type
    1159                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$8)
    1160                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1161                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x514)
    1162              $C$DW$148       .dwtag  DW_TAG_subrange_type
    1163                      .dwattr $C$DW$148, DW_AT_upper_bound(0x513)
    1164                      .dwendtag $C$DW$T$45
    1165              
    1166              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   23

    1167              $C$DW$T$51      .dwtag  DW_TAG_array_type
    1168                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    1169                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1170                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    1171              $C$DW$149       .dwtag  DW_TAG_subrange_type
    1172                      .dwattr $C$DW$149, DW_AT_upper_bound(0xff)
    1173                      .dwendtag $C$DW$T$51
    1174              
    1175              
    1176              $C$DW$T$52      .dwtag  DW_TAG_array_type
    1177                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    1178                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1179                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x10)
    1180              $C$DW$150       .dwtag  DW_TAG_subrange_type
    1181                      .dwattr $C$DW$150, DW_AT_upper_bound(0x0f)
    1182                      .dwendtag $C$DW$T$52
    1183              
    1184              
    1185              $C$DW$T$53      .dwtag  DW_TAG_array_type
    1186                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
    1187                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1188                      .dwattr $C$DW$T$53, DW_AT_byte_size(0xe0)
    1189              $C$DW$151       .dwtag  DW_TAG_subrange_type
    1190                      .dwattr $C$DW$151, DW_AT_upper_bound(0x0d)
    1191              $C$DW$152       .dwtag  DW_TAG_subrange_type
    1192                      .dwattr $C$DW$152, DW_AT_upper_bound(0x0f)
    1193                      .dwendtag $C$DW$T$53
    1194              
    1195              $C$DW$153       .dwtag  DW_TAG_TI_far_type
    1196                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$8)
    1197              $C$DW$T$54      .dwtag  DW_TAG_const_type
    1198                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$153)
    1199              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1200                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1201                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    1202              
    1203              $C$DW$T$56      .dwtag  DW_TAG_array_type
    1204                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1205                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1206                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x20)
    1207              $C$DW$154       .dwtag  DW_TAG_subrange_type
    1208                      .dwattr $C$DW$154, DW_AT_upper_bound(0x0f)
    1209                      .dwendtag $C$DW$T$56
    1210              
    1211              
    1212              $C$DW$T$60      .dwtag  DW_TAG_array_type
    1213                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    1214                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1215                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x80)
    1216              $C$DW$155       .dwtag  DW_TAG_subrange_type
    1217                      .dwattr $C$DW$155, DW_AT_upper_bound(0x7f)
    1218                      .dwendtag $C$DW$T$60
    1219              
    1220              
    1221              $C$DW$T$61      .dwtag  DW_TAG_array_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   24

    1222                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$8)
    1223                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1224                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x1a)
    1225              $C$DW$156       .dwtag  DW_TAG_subrange_type
    1226                      .dwattr $C$DW$156, DW_AT_upper_bound(0x19)
    1227                      .dwendtag $C$DW$T$61
    1228              
    1229              
    1230              $C$DW$T$79      .dwtag  DW_TAG_array_type
    1231                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$8)
    1232                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1233                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x20)
    1234              $C$DW$157       .dwtag  DW_TAG_subrange_type
    1235                      .dwattr $C$DW$157, DW_AT_upper_bound(0x1f)
    1236                      .dwendtag $C$DW$T$79
    1237              
    1238              
    1239              $C$DW$T$85      .dwtag  DW_TAG_array_type
    1240                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$8)
    1241                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1242                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x14)
    1243              $C$DW$158       .dwtag  DW_TAG_subrange_type
    1244                      .dwattr $C$DW$158, DW_AT_upper_bound(0x13)
    1245                      .dwendtag $C$DW$T$85
    1246              
    1247              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1248                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1249                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1250                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1251              
    1252              $C$DW$T$27      .dwtag  DW_TAG_array_type
    1253                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    1254                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1255                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1256              $C$DW$159       .dwtag  DW_TAG_subrange_type
    1257                      .dwattr $C$DW$159, DW_AT_upper_bound(0x00)
    1258                      .dwendtag $C$DW$T$27
    1259              
    1260              
    1261              $C$DW$T$33      .dwtag  DW_TAG_array_type
    1262                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    1263                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1264                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1265              $C$DW$160       .dwtag  DW_TAG_subrange_type
    1266                      .dwattr $C$DW$160, DW_AT_upper_bound(0x01)
    1267                      .dwendtag $C$DW$T$33
    1268              
    1269              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1270                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    1271                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1272              $C$DW$161       .dwtag  DW_TAG_TI_far_type
    1273                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$9)
    1274              $C$DW$T$96      .dwtag  DW_TAG_const_type
    1275                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$161)
    1276              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   25

    1277                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    1278                      .dwattr $C$DW$T$97, DW_AT_address_class(0x17)
    1279              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    1280                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    1281                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1282              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    1283                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    1284                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    1285              
    1286              $C$DW$T$37      .dwtag  DW_TAG_array_type
    1287                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
    1288                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1289                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    1290              $C$DW$162       .dwtag  DW_TAG_subrange_type
    1291                      .dwattr $C$DW$162, DW_AT_upper_bound(0x13)
    1292                      .dwendtag $C$DW$T$37
    1293              
    1294              
    1295              $C$DW$T$86      .dwtag  DW_TAG_array_type
    1296                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$20)
    1297                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1298                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x02)
    1299              $C$DW$163       .dwtag  DW_TAG_subrange_type
    1300                      .dwattr $C$DW$163, DW_AT_upper_bound(0x01)
    1301                      .dwendtag $C$DW$T$86
    1302              
    1303              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1304                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1305                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1306                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1307              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1308                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1309                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1310                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1311              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1312                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1313                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1314                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1315              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1316                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
    1317                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    1318              
    1319              $C$DW$T$62      .dwtag  DW_TAG_array_type
    1320                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$12)
    1321                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1322                      .dwattr $C$DW$T$62, DW_AT_byte_size(0xd0)
    1323              $C$DW$164       .dwtag  DW_TAG_subrange_type
    1324                      .dwattr $C$DW$164, DW_AT_upper_bound(0x67)
    1325                      .dwendtag $C$DW$T$62
    1326              
    1327              
    1328              $C$DW$T$65      .dwtag  DW_TAG_array_type
    1329                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$12)
    1330                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1331                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x20)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   26

    1332              $C$DW$165       .dwtag  DW_TAG_subrange_type
    1333                      .dwattr $C$DW$165, DW_AT_upper_bound(0x0f)
    1334                      .dwendtag $C$DW$T$65
    1335              
    1336              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1337                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1338                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1339                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1340              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1341                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1342                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1343                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1344                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1345                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1346              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1347                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1348                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1349                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1350                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1351                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1352              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1353                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1354                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1355                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1356              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1357                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1358                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1359                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1360              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1361                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1362                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1363                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1364              $C$DW$T$74      .dwtag  DW_TAG_base_type
    1365                      .dwattr $C$DW$T$74, DW_AT_encoding(DW_ATE_signed_char)
    1366                      .dwattr $C$DW$T$74, DW_AT_name("signed char")
    1367                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    1368              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    1369                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    1370                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    1371              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    1372                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$75)
    1373                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    1374              
    1375              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1376                      .dwattr $C$DW$T$50, DW_AT_name("ele")
    1377                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x03)
    1378              $C$DW$166       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$9)
    1380                      .dwattr $C$DW$166, DW_AT_name("sym")
    1381                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_sym")
    1382                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$167       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$9)
    1386                      .dwattr $C$DW$167, DW_AT_name("idx_flag")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   27

    1387                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_idx_flag")
    1388                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1389                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$168       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$9)
    1392                      .dwattr $C$DW$168, DW_AT_name("next")
    1393                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_next")
    1394                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1395                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1396                      .dwendtag $C$DW$T$50
    1397              
    1398              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    1399                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$50)
    1400                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1401              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    1402                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    1403                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    1404              
    1405              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    1406                      .dwattr $C$DW$T$91, DW_AT_name("gmhmm_type")
    1407                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x7fe)
    1408              $C$DW$169       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1410                      .dwattr $C$DW$169, DW_AT_name("avedepth")
    1411                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_avedepth")
    1412                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$170       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1416                      .dwattr $C$DW$170, DW_AT_name("bestdepth")
    1417                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_bestdepth")
    1418                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1419                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1420              $C$DW$171       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    1422                      .dwattr $C$DW$171, DW_AT_name("index_mean")
    1423                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_index_mean")
    1424                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1425                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1426              $C$DW$172       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1428                      .dwattr $C$DW$172, DW_AT_name("signal_cnt")
    1429                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_signal_cnt")
    1430                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1431                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1432              $C$DW$173       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$8)
    1434                      .dwattr $C$DW$173, DW_AT_name("buf_idx")
    1435                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_buf_idx")
    1436                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1437                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1438              $C$DW$174       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1440                      .dwattr $C$DW$174, DW_AT_name("speech_detected")
    1441                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_speech_detected")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   28

    1442                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1443                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1444              $C$DW$175       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    1446                      .dwattr $C$DW$175, DW_AT_name("mfcc_cnt")
    1447                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_mfcc_cnt")
    1448                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1449                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1450              $C$DW$176       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    1452                      .dwattr $C$DW$176, DW_AT_name("nbr_cpy")
    1453                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_nbr_cpy")
    1454                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1455                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1456              $C$DW$177       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$8)
    1458                      .dwattr $C$DW$177, DW_AT_name("last_sig")
    1459                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_last_sig")
    1460                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1461                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$178       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$51)
    1464                      .dwattr $C$DW$178, DW_AT_name("sample_signal")
    1465                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_sample_signal")
    1466                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1467                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$179       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$8)
    1470                      .dwattr $C$DW$179, DW_AT_name("amplitude_max")
    1471                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_amplitude_max")
    1472                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    1473                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1474              $C$DW$180       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$8)
    1476                      .dwattr $C$DW$180, DW_AT_name("amplitude_min")
    1477                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_amplitude_min")
    1478                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    1479                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1480              $C$DW$181       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$8)
    1482                      .dwattr $C$DW$181, DW_AT_name("pred_first_frame")
    1483                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_pred_first_frame")
    1484                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    1485                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1486              $C$DW$182       .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$8)
    1488                      .dwattr $C$DW$182, DW_AT_name("frm_cnt")
    1489                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_frm_cnt")
    1490                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    1491                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1492              $C$DW$183       .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$8)
    1494                      .dwattr $C$DW$183, DW_AT_name("beam_count")
    1495                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_beam_count")
    1496                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   29

    1497                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1498              $C$DW$184       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$8)
    1500                      .dwattr $C$DW$184, DW_AT_name("active_beam_cells")
    1501                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_active_beam_cells")
    1502                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    1503                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1504              $C$DW$185       .dwtag  DW_TAG_member
    1505                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$8)
    1506                      .dwattr $C$DW$185, DW_AT_name("active_time_cells")
    1507                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_active_time_cells")
    1508                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    1509                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$186       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$9)
    1512                      .dwattr $C$DW$186, DW_AT_name("ending_sym_count")
    1513                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ending_sym_count")
    1514                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1515                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1516              $C$DW$187       .dwtag  DW_TAG_member
    1517                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$8)
    1518                      .dwattr $C$DW$187, DW_AT_name("comp_type")
    1519                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_comp_type")
    1520                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    1521                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1522              $C$DW$188       .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$9)
    1524                      .dwattr $C$DW$188, DW_AT_name("low_vol_limit")
    1525                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_low_vol_limit")
    1526                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    1527                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1528              $C$DW$189       .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$9)
    1530                      .dwattr $C$DW$189, DW_AT_name("high_vol_limit")
    1531                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_high_vol_limit")
    1532                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
    1533                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1534              $C$DW$190       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$8)
    1536                      .dwattr $C$DW$190, DW_AT_name("vol")
    1537                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_vol")
    1538                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1539                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1540              $C$DW$191       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    1542                      .dwattr $C$DW$191, DW_AT_name("n_mfcc")
    1543                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_n_mfcc")
    1544                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    1545                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$192       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$8)
    1548                      .dwattr $C$DW$192, DW_AT_name("nbr_dim")
    1549                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_nbr_dim")
    1550                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    1551                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:42 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0612010                         PAGE   30

    1552              $C$DW$193       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    1554                      .dwattr $C$DW$193, DW_AT_name("n_filter")
    1555                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_n_filter")
    1556                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    1557                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1558              $C$DW$194       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$53)
    1560                      .dwattr $C$DW$194, DW_AT_name("mfcc_buf")
    1561                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_mfcc_buf")
    1562                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
