TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE    1

    6131              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:46 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3827              $C$DW$312       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureDimensionFail"), DW_AT_const_value(
    3828              $C$DW$313       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSegmentSizeCheckFail"), DW_AT_const_value(
    3829              $C$DW$314       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelFileFail"), DW_AT_const_value(0x1c4)
    3830              $C$DW$315       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSaveFail"), DW_AT_const_value(0x1c5)
    3831              $C$DW$316       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineEnrollLoadFail"), DW_AT_const_value(0x1c6)
    3832              $C$DW$317       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackgoundCreationFail"), DW_AT_const_value
    3833              $C$DW$318       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineStateMemoryOut"), DW_AT_const_value(0x1f4)
    3834              $C$DW$319       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSearchMemoryOut"), DW_AT_const_value(0x1f5
    3835              $C$DW$320       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelMemorySize"), DW_AT_const_value(0x258
    3836              $C$DW$321       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureMemorySize"), DW_AT_const_value(0x2
    3837              $C$DW$322       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineNetworkMemorySize"), DW_AT_const_value(0x2
    3838              $C$DW$323       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelSize"), DW_AT_const_value(0x25b)
    3839              $C$DW$324       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackTrackMemorySize"), DW_AT_const_value(0
    3840              $C$DW$325       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineCMMemorySize"), DW_AT_const_value(0x25d)
    3841              $C$DW$326       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineVALTreeMemorySize"), DW_AT_const_value(0x2
    3842              $C$DW$327       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSym2PosMapSize"), DW_AT_const_value(0x25f)
    3843              $C$DW$328       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineShortUtterance"), DW_AT_const_value(0x2bc)
    3844              $C$DW$329       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadHMM2Phone"), DW_AT_const_value(0x320)
    3845              $C$DW$330       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNoSilencePhone"), DW_AT_const_value(0x321)
    3846              $C$DW$331       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhone2Voicing"), DW_AT_const_value(0x322)
    3847              $C$DW$332       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhoneDuration"), DW_AT_const_value(0x323)
    3848              $C$DW$333       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMismatch"), DW_AT_const_value(0x324)
    3849              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMissWord"), DW_AT_const_value(0x325)
    3850              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneDuration"), DW_AT_const_value(0x326)
    3851              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneWord"), DW_AT_const_value(0x327)
    3852              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveTTSMean"), DW_AT_const_value(0x328)
    3853              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveVoicing"), DW_AT_const_value(0x329)
    3854              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveDuration"), DW_AT_const_value(0x32a)
    3855              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSTTS"), DW_AT_const_value(0x32b)
    3856              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneList"), DW_AT_const_value(0x32c)
    3857              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumPhones"), DW_AT_const_value(0x32d)
    3858              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumWords"), DW_AT_const_value(0x32e)
    3859              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputFile"), DW_AT_const_value(0x32f)
    3860              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputMFCC"), DW_AT_const_value(0x330)
    3861              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputDuration"), DW_AT_const_value(0x331)
    3862              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputVoicing"), DW_AT_const_value(0x332)
    3863              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNotFound"), DW_AT_const_value(0x333)
    3864              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputMeanSize"), DW_AT_const_value(0x334)
    3865              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutput"), DW_AT_const_value(0x335)
    3866                      .dwendtag $C$DW$T$93
    3867              
    3868              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineStatusType")
    3869                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    3870                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3871              
    3872              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3873                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
    3874              $C$DW$351       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$10)
    3876                      .dwattr $C$DW$351, DW_AT_name("fd")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   86

    3877                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_fd")
    3878                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3879                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3880              $C$DW$352       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    3882                      .dwattr $C$DW$352, DW_AT_name("buf")
    3883                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_buf")
    3884                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3885                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3886              $C$DW$353       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    3888                      .dwattr $C$DW$353, DW_AT_name("pos")
    3889                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_pos")
    3890                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3891                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3892              $C$DW$354       .dwtag  DW_TAG_member
    3893                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    3894                      .dwattr $C$DW$354, DW_AT_name("bufend")
    3895                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_bufend")
    3896                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3897                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3898              $C$DW$355       .dwtag  DW_TAG_member
    3899                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    3900                      .dwattr $C$DW$355, DW_AT_name("buff_stop")
    3901                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_buff_stop")
    3902                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3903                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3904              $C$DW$356       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$11)
    3906                      .dwattr $C$DW$356, DW_AT_name("flags")
    3907                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_flags")
    3908                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3909                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3910                      .dwendtag $C$DW$T$20
    3911              
    3912              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3913                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$20)
    3914                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    3915              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    3916                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    3917                      .dwattr $C$DW$T$99, DW_AT_address_class(0x17)
    3918              
    3919              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3920                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x03)
    3921              $C$DW$357       .dwtag  DW_TAG_member
    3922                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$8)
    3923                      .dwattr $C$DW$357, DW_AT_name("num")
    3924                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_num")
    3925                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3926                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3927              $C$DW$358       .dwtag  DW_TAG_member
    3928                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$8)
    3929                      .dwattr $C$DW$358, DW_AT_name("x1")
    3930                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_x1")
    3931                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   87

    3932                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3933              $C$DW$359       .dwtag  DW_TAG_member
    3934                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$8)
    3935                      .dwattr $C$DW$359, DW_AT_name("x2")
    3936                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_x2")
    3937                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3938                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3939                      .dwendtag $C$DW$T$21
    3940              
    3941              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    3942                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$21)
    3943                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3944              $C$DW$360       .dwtag  DW_TAG_TI_far_type
    3945                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$58)
    3946              $C$DW$T$59      .dwtag  DW_TAG_const_type
    3947                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$360)
    3948              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    3949                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3950                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
    3951              
    3952              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3953                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x18)
    3954              $C$DW$361       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$22)
    3956                      .dwattr $C$DW$361, DW_AT_name("max_mem_usage")
    3957                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_max_mem_usage")
    3958                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3959                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3960              $C$DW$362       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$22)
    3962                      .dwattr $C$DW$362, DW_AT_name("n_terminals")
    3963                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_n_terminals")
    3964                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3965                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3966              $C$DW$363       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$22)
    3968                      .dwattr $C$DW$363, DW_AT_name("n_monophones")
    3969                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_n_monophones")
    3970                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3971                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3972              $C$DW$364       .dwtag  DW_TAG_member
    3973                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    3974                      .dwattr $C$DW$364, DW_AT_name("hlrTreeBase")
    3975                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_hlrTreeBase")
    3976                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3977                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3978              $C$DW$365       .dwtag  DW_TAG_member
    3979                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$24)
    3980                      .dwattr $C$DW$365, DW_AT_name("hlrTerminal")
    3981                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_hlrTerminal")
    3982                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3983                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3984              $C$DW$366       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$23)
    3986                      .dwattr $C$DW$366, DW_AT_name("pHMM2phone")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   88

    3987                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_pHMM2phone")
    3988                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3989                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3990              $C$DW$367       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$24)
    3992                      .dwattr $C$DW$367, DW_AT_name("hlrTransformIndex")
    3993                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_hlrTransformIndex")
    3994                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3995                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3996              $C$DW$368       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$22)
    3998                      .dwattr $C$DW$368, DW_AT_name("hlr_TRANSFORM_SIZE")
    3999                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    4000                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4001                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4002              $C$DW$369       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    4004                      .dwattr $C$DW$369, DW_AT_name("hlrTransforms")
    4005                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_hlrTransforms")
    4006                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4007                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4008              $C$DW$370       .dwtag  DW_TAG_member
    4009                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$23)
    4010                      .dwattr $C$DW$370, DW_AT_name("pSegStat_dif1")
    4011                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_pSegStat_dif1")
    4012                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4013                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4014              $C$DW$371       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    4016                      .dwattr $C$DW$371, DW_AT_name("pSegStat_dif2")
    4017                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_pSegStat_dif2")
    4018                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4019                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4020              $C$DW$372       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    4022                      .dwattr $C$DW$372, DW_AT_name("pEnhanced")
    4023                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_pEnhanced")
    4024                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4025                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4026              $C$DW$373       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    4028                      .dwattr $C$DW$373, DW_AT_name("bk_node_cnt")
    4029                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_bk_node_cnt")
    4030                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4031                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4032                      .dwendtag $C$DW$T$25
    4033              
    4034              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    4035                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$25)
    4036                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4037              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    4038                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    4039                      .dwattr $C$DW$T$65, DW_AT_address_class(0x17)
    4040              
    4041              $C$DW$T$26      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   89

    4042                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x03)
    4043              $C$DW$374       .dwtag  DW_TAG_member
    4044                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$9)
    4045                      .dwattr $C$DW$374, DW_AT_name("sym_code")
    4046                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_sym_code")
    4047                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4048                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4049              $C$DW$375       .dwtag  DW_TAG_member
    4050                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$9)
    4051                      .dwattr $C$DW$375, DW_AT_name("start_cell")
    4052                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_start_cell")
    4053                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4054                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4055              $C$DW$376       .dwtag  DW_TAG_member
    4056                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$9)
    4057                      .dwattr $C$DW$376, DW_AT_name("depth")
    4058                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_depth")
    4059                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4060                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4061                      .dwendtag $C$DW$T$26
    4062              
    4063              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    4064                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$26)
    4065                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4066              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    4067                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    4068                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    4069              
    4070              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4071                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x03)
    4072              $C$DW$377       .dwtag  DW_TAG_member
    4073                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$8)
    4074                      .dwattr $C$DW$377, DW_AT_name("scr")
    4075                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_scr")
    4076                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4077                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4078              $C$DW$378       .dwtag  DW_TAG_member
    4079                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$9)
    4080                      .dwattr $C$DW$378, DW_AT_name("sym")
    4081                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_sym")
    4082                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4083                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4084              $C$DW$379       .dwtag  DW_TAG_member
    4085                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$9)
    4086                      .dwattr $C$DW$379, DW_AT_name("frm")
    4087                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_frm")
    4088                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4089                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4090                      .dwendtag $C$DW$T$27
    4091              
    4092              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    4093                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$27)
    4094                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4095              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    4096                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   90

    4097                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    4098              
    4099              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4100                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    4101              $C$DW$380       .dwtag  DW_TAG_member
    4102                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$9)
    4103                      .dwattr $C$DW$380, DW_AT_name("frm")
    4104                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_frm")
    4105                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4106                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4107              $C$DW$381       .dwtag  DW_TAG_member
    4108                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$9)
    4109                      .dwattr $C$DW$381, DW_AT_name("beam_idx")
    4110                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_beam_idx")
    4111                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4112                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4113                      .dwendtag $C$DW$T$28
    4114              
    4115              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    4116                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$28)
    4117                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4118              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    4119                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    4120                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    4121              
    4122              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4123                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    4124              $C$DW$382       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$9)
    4126                      .dwattr $C$DW$382, DW_AT_name("n_hmm")
    4127                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_n_hmm")
    4128                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4129                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4130              $C$DW$383       .dwtag  DW_TAG_member
    4131                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$9)
    4132                      .dwattr $C$DW$383, DW_AT_name("n_sym")
    4133                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_n_sym")
    4134                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4135                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4136              $C$DW$384       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$9)
    4138                      .dwattr $C$DW$384, DW_AT_name("n_word")
    4139                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_n_word")
    4140                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4141                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4142              $C$DW$385       .dwtag  DW_TAG_member
    4143                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$9)
    4144                      .dwattr $C$DW$385, DW_AT_name("n_set")
    4145                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_n_set")
    4146                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4147                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4148              $C$DW$386       .dwtag  DW_TAG_member
    4149                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$9)
    4150                      .dwattr $C$DW$386, DW_AT_name("n_hmm_set")
    4151                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_n_hmm_set")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   91

    4152                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4153                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4154              $C$DW$387       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$9)
    4156                      .dwattr $C$DW$387, DW_AT_name("start")
    4157                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_start")
    4158                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4159                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4160              $C$DW$388       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$9)
    4162                      .dwattr $C$DW$388, DW_AT_name("stop")
    4163                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_stop")
    4164                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4165                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4166              $C$DW$389       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
    4168                      .dwattr $C$DW$389, DW_AT_name("symlist")
    4169                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_symlist")
    4170                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4171                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4172                      .dwendtag $C$DW$T$30
    4173              
    4174              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    4175                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$30)
    4176                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    4177              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    4178                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    4179                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    4180              
    4181              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4182                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    4183              $C$DW$390       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$9)
    4185                      .dwattr $C$DW$390, DW_AT_name("high_pos")
    4186                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_high_pos")
    4187                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4188                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4189              $C$DW$391       .dwtag  DW_TAG_member
    4190                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$9)
    4191                      .dwattr $C$DW$391, DW_AT_name("cur_pos")
    4192                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_cur_pos")
    4193                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4194                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4195                      .dwendtag $C$DW$T$31
    4196              
    4197              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    4198                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    4199                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4200              
    4201              $C$DW$T$33      .dwtag  DW_TAG_array_type
    4202                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4203                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4204                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    4205              $C$DW$392       .dwtag  DW_TAG_subrange_type
    4206                      .dwattr $C$DW$392, DW_AT_upper_bound(0x01)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   92

    4207                      .dwendtag $C$DW$T$33
    4208              
    4209              
    4210              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4211                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    4212              $C$DW$393       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$32)
    4214                      .dwattr $C$DW$393, DW_AT_name("state")
    4215                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_state")
    4216                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4217                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4218              $C$DW$394       .dwtag  DW_TAG_member
    4219                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$33)
    4220                      .dwattr $C$DW$394, DW_AT_name("sym")
    4221                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_sym")
    4222                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4223                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4224              $C$DW$395       .dwtag  DW_TAG_member
    4225                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$32)
    4226                      .dwattr $C$DW$395, DW_AT_name("beam")
    4227                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_beam")
    4228                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4229                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4230              $C$DW$396       .dwtag  DW_TAG_member
    4231                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$32)
    4232                      .dwattr $C$DW$396, DW_AT_name("time")
    4233                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_time")
    4234                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4235                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4236                      .dwendtag $C$DW$T$34
    4237              
    4238              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    4239                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$34)
    4240                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4241              
    4242              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4243                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x03)
    4244              $C$DW$397       .dwtag  DW_TAG_member
    4245                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$35)
    4246                      .dwattr $C$DW$397, DW_AT_name("cur_sym")
    4247                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_cur_sym")
    4248                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4249                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4250              $C$DW$398       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$9)
    4252                      .dwattr $C$DW$398, DW_AT_name("cur_state")
    4253                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_cur_state")
    4254                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4255                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4256                      .dwendtag $C$DW$T$36
    4257              
    4258              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    4259                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
    4260                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    4261              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   93

    4262              $C$DW$T$83      .dwtag  DW_TAG_array_type
    4263                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    4264                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4265                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x06)
    4266              $C$DW$399       .dwtag  DW_TAG_subrange_type
    4267                      .dwattr $C$DW$399, DW_AT_upper_bound(0x01)
    4268                      .dwendtag $C$DW$T$83
    4269              
    4270              
    4271              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4272                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    4273              $C$DW$400       .dwtag  DW_TAG_member
    4274                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$9)
    4275                      .dwattr $C$DW$400, DW_AT_name("max_nbr_syms")
    4276                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_max_nbr_syms")
    4277                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4278                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4279              $C$DW$401       .dwtag  DW_TAG_member
    4280                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$8)
    4281                      .dwattr $C$DW$401, DW_AT_name("nbr_syms")
    4282                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_nbr_syms")
    4283                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4284                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4285              $C$DW$402       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
    4287                      .dwattr $C$DW$402, DW_AT_name("sym2pos")
    4288                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_sym2pos")
    4289                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4290                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4291              $C$DW$403       .dwtag  DW_TAG_member
    4292                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$37)
    4293                      .dwattr $C$DW$403, DW_AT_name("syms")
    4294                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_syms")
    4295                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4296                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4297                      .dwendtag $C$DW$T$38
    4298              
    4299              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    4300                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$38)
    4301                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4302              
    4303              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4304                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x16)
    4305              $C$DW$404       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$8)
    4307                      .dwattr $C$DW$404, DW_AT_name("scr")
    4308                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_scr")
    4309                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4310                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4311              $C$DW$405       .dwtag  DW_TAG_member
    4312                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$8)
    4313                      .dwattr $C$DW$405, DW_AT_name("n_ans")
    4314                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_n_ans")
    4315                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4316                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   94

    4317              $C$DW$406       .dwtag  DW_TAG_member
    4318                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$39)
    4319                      .dwattr $C$DW$406, DW_AT_name("answers")
    4320                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_answers")
    4321                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4322                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4323                      .dwendtag $C$DW$T$40
    4324              
    4325              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    4326                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    4327                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4328              
    4329              $C$DW$T$43      .dwtag  DW_TAG_array_type
    4330                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4331                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4332                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x294)
    4333              $C$DW$407       .dwtag  DW_TAG_subrange_type
    4334                      .dwattr $C$DW$407, DW_AT_upper_bound(0x1d)
    4335                      .dwendtag $C$DW$T$43
    4336              
    4337              
    4338              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4339                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x2b3)
    4340              $C$DW$408       .dwtag  DW_TAG_member
    4341                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$8)
    4342                      .dwattr $C$DW$408, DW_AT_name("n_bests")
    4343                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_n_bests")
    4344                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4345                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4346              $C$DW$409       .dwtag  DW_TAG_member
    4347                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$41)
    4348                      .dwattr $C$DW$409, DW_AT_name("best_idx")
    4349                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_best_idx")
    4350                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4351                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4352              $C$DW$410       .dwtag  DW_TAG_member
    4353                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$43)
    4354                      .dwattr $C$DW$410, DW_AT_name("elem")
    4355                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_elem")
    4356                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4357                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4358                      .dwendtag $C$DW$T$44
    4359              
    4360              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    4361                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$44)
    4362                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4363              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    4364                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$85)
    4365                      .dwattr $C$DW$T$100, DW_AT_address_class(0x17)
    4366              
    4367              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4368                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
    4369              $C$DW$411       .dwtag  DW_TAG_member
    4370                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$22)
    4371                      .dwattr $C$DW$411, DW_AT_name("alpha_p")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   95

    4372                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_alpha_p")
    4373                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4374                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4375              $C$DW$412       .dwtag  DW_TAG_member
    4376                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$22)
    4377                      .dwattr $C$DW$412, DW_AT_name("sAlpha")
    4378                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_sAlpha")
    4379                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4380                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4381              $C$DW$413       .dwtag  DW_TAG_member
    4382                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$8)
    4383                      .dwattr $C$DW$413, DW_AT_name("sBeta")
    4384                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_sBeta")
    4385                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4386                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4387              $C$DW$414       .dwtag  DW_TAG_member
    4388                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$8)
    4389                      .dwattr $C$DW$414, DW_AT_name("lambdaLTEhigherE")
    4390                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    4391                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4392                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4393              $C$DW$415       .dwtag  DW_TAG_member
    4394                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$8)
    4395                      .dwattr $C$DW$415, DW_AT_name("frm_count")
    4396                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_frm_count")
    4397                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4398                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4399              $C$DW$416       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$22)
    4401                      .dwattr $C$DW$416, DW_AT_name("prob_sp")
    4402                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_prob_sp")
    4403                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4404                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4405              $C$DW$417       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$23)
    4407                      .dwattr $C$DW$417, DW_AT_name("s_noise_floor")
    4408                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_s_noise_floor")
    4409                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4410                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4411              $C$DW$418       .dwtag  DW_TAG_member
    4412                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$23)
    4413                      .dwattr $C$DW$418, DW_AT_name("snr")
    4414                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_snr")
    4415                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4416                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4417              $C$DW$419       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$23)
    4419                      .dwattr $C$DW$419, DW_AT_name("ps_long_term_noise")
    4420                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_ps_long_term_noise")
    4421                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4422                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4423              $C$DW$420       .dwtag  DW_TAG_member
    4424                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$8)
    4425                      .dwattr $C$DW$420, DW_AT_name("frmEn")
    4426                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_frmEn")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   96

    4427                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4428                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4429              $C$DW$421       .dwtag  DW_TAG_member
    4430                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$8)
    4431                      .dwattr $C$DW$421, DW_AT_name("meanEn")
    4432                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_meanEn")
    4433                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4434                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4435              $C$DW$422       .dwtag  DW_TAG_member
    4436                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$8)
    4437                      .dwattr $C$DW$422, DW_AT_name("prevMeanEn")
    4438                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_prevMeanEn")
    4439                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4440                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4441              $C$DW$423       .dwtag  DW_TAG_member
    4442                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$8)
    4443                      .dwattr $C$DW$423, DW_AT_name("noiselvl")
    4444                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_noiselvl")
    4445                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4446                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4447              $C$DW$424       .dwtag  DW_TAG_member
    4448                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$8)
    4449                      .dwattr $C$DW$424, DW_AT_name("lambdaLTE")
    4450                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_lambdaLTE")
    4451                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4452                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4453              $C$DW$425       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$8)
    4455                      .dwattr $C$DW$425, DW_AT_name("nbSpeechFrame")
    4456                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_nbSpeechFrame")
    4457                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4458                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4459              $C$DW$426       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$8)
    4461                      .dwattr $C$DW$426, DW_AT_name("hangOver")
    4462                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_hangOver")
    4463                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4464                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4465                      .dwendtag $C$DW$T$45
    4466              
    4467              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    4468                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$45)
    4469                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    4470              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    4471                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    4472                      .dwattr $C$DW$T$89, DW_AT_address_class(0x17)
    4473              
    4474              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4475                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x03)
    4476              $C$DW$427       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$8)
    4478                      .dwattr $C$DW$427, DW_AT_name("mean")
    4479                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_mean")
    4480                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4481                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   97

    4482              $C$DW$428       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$8)
    4484                      .dwattr $C$DW$428, DW_AT_name("inv")
    4485                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_inv")
    4486                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4487                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4488              $C$DW$429       .dwtag  DW_TAG_member
    4489                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$8)
    4490                      .dwattr $C$DW$429, DW_AT_name("gconst")
    4491                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_gconst")
    4492                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4493                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4494                      .dwendtag $C$DW$T$46
    4495              
    4496              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    4497                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$46)
    4498                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4499              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    4500                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$48)
    4501                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    4502              
    4503              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4504                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x544)
    4505              $C$DW$430       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$47)
    4507                      .dwattr $C$DW$430, DW_AT_name("base_mem")
    4508                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_base_mem")
    4509                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4510                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4511              $C$DW$431       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$22)
    4513                      .dwattr $C$DW$431, DW_AT_name("mem_count")
    4514                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_mem_count")
    4515                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    4516                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4517              $C$DW$432       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$24)
    4519                      .dwattr $C$DW$432, DW_AT_name("answers")
    4520                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_answers")
    4521                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    4522                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4523              $C$DW$433       .dwtag  DW_TAG_member
    4524                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$24)
    4525                      .dwattr $C$DW$433, DW_AT_name("uStp")
    4526                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_uStp")
    4527                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    4528                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4529              $C$DW$434       .dwtag  DW_TAG_member
    4530                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$22)
    4531                      .dwattr $C$DW$434, DW_AT_name("nWords")
    4532                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_nWords")
    4533                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    4534                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4535              $C$DW$435       .dwtag  DW_TAG_member
    4536                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   98

    4537                      .dwattr $C$DW$435, DW_AT_name("nS")
    4538                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_nS")
    4539                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    4540                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4541              $C$DW$436       .dwtag  DW_TAG_member
    4542                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$23)
    4543                      .dwattr $C$DW$436, DW_AT_name("cm_scr")
    4544                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_cm_scr")
    4545                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    4546                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4547              $C$DW$437       .dwtag  DW_TAG_member
    4548                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$8)
    4549                      .dwattr $C$DW$437, DW_AT_name("bNeedUpdate")
    4550                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_bNeedUpdate")
    4551                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    4552                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4553              $C$DW$438       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$23)
    4555                      .dwattr $C$DW$438, DW_AT_name("cm_anti_scr")
    4556                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_cm_anti_scr")
    4557                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    4558                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4559              $C$DW$439       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$12)
    4561                      .dwattr $C$DW$439, DW_AT_name("cm_fg_scr")
    4562                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_cm_fg_scr")
    4563                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    4564                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4565              $C$DW$440       .dwtag  DW_TAG_member
    4566                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$12)
    4567                      .dwattr $C$DW$440, DW_AT_name("cm_bk_scr")
    4568                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_cm_bk_scr")
    4569                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    4570                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4571              $C$DW$441       .dwtag  DW_TAG_member
    4572                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$8)
    4573                      .dwattr $C$DW$441, DW_AT_name("th_nbest")
    4574                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_th_nbest")
    4575                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    4576                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4577              $C$DW$442       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$8)
    4579                      .dwattr $C$DW$442, DW_AT_name("nSpeech")
    4580                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_nSpeech")
    4581                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    4582                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4583              $C$DW$443       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$8)
    4585                      .dwattr $C$DW$443, DW_AT_name("nNoise")
    4586                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_nNoise")
    4587                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    4588                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4589              $C$DW$444       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$12)
    4591                      .dwattr $C$DW$444, DW_AT_name("speech_power")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE   99

    4592                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_speech_power")
    4593                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    4594                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4595              $C$DW$445       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$12)
    4597                      .dwattr $C$DW$445, DW_AT_name("noise_power")
    4598                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_noise_power")
    4599                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    4600                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4601              $C$DW$446       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$12)
    4603                      .dwattr $C$DW$446, DW_AT_name("noise_power_sqr")
    4604                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_noise_power_sqr")
    4605                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    4606                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4607              $C$DW$447       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$8)
    4609                      .dwattr $C$DW$447, DW_AT_name("NSNR")
    4610                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_NSNR")
    4611                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    4612                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4613              $C$DW$448       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$48)
    4615                      .dwattr $C$DW$448, DW_AT_name("H0")
    4616                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_H0")
    4617                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    4618                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$449       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$48)
    4621                      .dwattr $C$DW$449, DW_AT_name("H1")
    4622                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_H1")
    4623                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    4624                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4625              $C$DW$450       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$23)
    4627                      .dwattr $C$DW$450, DW_AT_name("lgBeta")
    4628                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_lgBeta")
    4629                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    4630                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4631              $C$DW$451       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$49)
    4633                      .dwattr $C$DW$451, DW_AT_name("acc_dif2_beta")
    4634                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_acc_dif2_beta")
    4635                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    4636                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4637              $C$DW$452       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$8)
    4639                      .dwattr $C$DW$452, DW_AT_name("bCalced")
    4640                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_bCalced")
    4641                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    4642                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4643              $C$DW$453       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$23)
    4645                      .dwattr $C$DW$453, DW_AT_name("sCH")
    4646                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_sCH")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE  100

    4647                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    4648                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4649              $C$DW$454       .dwtag  DW_TAG_member
    4650                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$49)
    4651                      .dwattr $C$DW$454, DW_AT_name("lAccum")
    4652                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_lAccum")
    4653                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    4654                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4655              $C$DW$455       .dwtag  DW_TAG_member
    4656                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$8)
    4657                      .dwattr $C$DW$455, DW_AT_name("adp_th")
    4658                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_adp_th")
    4659                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    4660                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4661                      .dwendtag $C$DW$T$50
    4662              
    4663              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    4664                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$50)
    4665                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4666              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    4667                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    4668                      .dwattr $C$DW$T$91, DW_AT_address_class(0x17)
    4669              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4670                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4671              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("Ptr")
    4672                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$3)
    4673                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    4674              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4675                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4676                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4677                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4678              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4679                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4680                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4681                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4682              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4683                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4684                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4685                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4686              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4687                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    4688                      .dwattr $C$DW$T$19, DW_AT_address_class(0x17)
    4689              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4690                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4691                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4692                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4693              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4694                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4695                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4696                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4697              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    4698                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$8)
    4699                      .dwattr $C$DW$T$23, DW_AT_address_class(0x17)
    4700              
    4701              $C$DW$T$41      .dwtag  DW_TAG_array_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE  101

    4702                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$8)
    4703                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4704                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e)
    4705              $C$DW$456       .dwtag  DW_TAG_subrange_type
    4706                      .dwattr $C$DW$456, DW_AT_upper_bound(0x1d)
    4707                      .dwendtag $C$DW$T$41
    4708              
    4709              
    4710              $C$DW$T$47      .dwtag  DW_TAG_array_type
    4711                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$8)
    4712                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4713                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x514)
    4714              $C$DW$457       .dwtag  DW_TAG_subrange_type
    4715                      .dwattr $C$DW$457, DW_AT_upper_bound(0x513)
    4716                      .dwendtag $C$DW$T$47
    4717              
    4718              
    4719              $C$DW$T$52      .dwtag  DW_TAG_array_type
    4720                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    4721                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4722                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x100)
    4723              $C$DW$458       .dwtag  DW_TAG_subrange_type
    4724                      .dwattr $C$DW$458, DW_AT_upper_bound(0xff)
    4725                      .dwendtag $C$DW$T$52
    4726              
    4727              
    4728              $C$DW$T$53      .dwtag  DW_TAG_array_type
    4729                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
    4730                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4731                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x10)
    4732              $C$DW$459       .dwtag  DW_TAG_subrange_type
    4733                      .dwattr $C$DW$459, DW_AT_upper_bound(0x0f)
    4734                      .dwendtag $C$DW$T$53
    4735              
    4736              
    4737              $C$DW$T$54      .dwtag  DW_TAG_array_type
    4738                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$8)
    4739                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    4740                      .dwattr $C$DW$T$54, DW_AT_byte_size(0xe0)
    4741              $C$DW$460       .dwtag  DW_TAG_subrange_type
    4742                      .dwattr $C$DW$460, DW_AT_upper_bound(0x0d)
    4743              $C$DW$461       .dwtag  DW_TAG_subrange_type
    4744                      .dwattr $C$DW$461, DW_AT_upper_bound(0x0f)
    4745                      .dwendtag $C$DW$T$54
    4746              
    4747              $C$DW$462       .dwtag  DW_TAG_TI_far_type
    4748                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$8)
    4749              $C$DW$T$55      .dwtag  DW_TAG_const_type
    4750                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$462)
    4751              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    4752                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    4753                      .dwattr $C$DW$T$56, DW_AT_address_class(0x17)
    4754              
    4755              $C$DW$T$57      .dwtag  DW_TAG_array_type
    4756                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE  102

    4757                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4758                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x20)
    4759              $C$DW$463       .dwtag  DW_TAG_subrange_type
    4760                      .dwattr $C$DW$463, DW_AT_upper_bound(0x0f)
    4761                      .dwendtag $C$DW$T$57
    4762              
    4763              
    4764              $C$DW$T$122     .dwtag  DW_TAG_array_type
    4765                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$55)
    4766                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    4767                      .dwattr $C$DW$T$122, DW_AT_byte_size(0x03)
    4768              $C$DW$464       .dwtag  DW_TAG_subrange_type
    4769                      .dwattr $C$DW$464, DW_AT_upper_bound(0x02)
    4770                      .dwendtag $C$DW$T$122
    4771              
    4772              
    4773              $C$DW$T$61      .dwtag  DW_TAG_array_type
    4774                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$8)
    4775                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4776                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x80)
    4777              $C$DW$465       .dwtag  DW_TAG_subrange_type
    4778                      .dwattr $C$DW$465, DW_AT_upper_bound(0x7f)
    4779                      .dwendtag $C$DW$T$61
    4780              
    4781              
    4782              $C$DW$T$62      .dwtag  DW_TAG_array_type
    4783                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$8)
    4784                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4785                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x1a)
    4786              $C$DW$466       .dwtag  DW_TAG_subrange_type
    4787                      .dwattr $C$DW$466, DW_AT_upper_bound(0x19)
    4788                      .dwendtag $C$DW$T$62
    4789              
    4790              
    4791              $C$DW$T$80      .dwtag  DW_TAG_array_type
    4792                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$8)
    4793                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4794                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x20)
    4795              $C$DW$467       .dwtag  DW_TAG_subrange_type
    4796                      .dwattr $C$DW$467, DW_AT_upper_bound(0x1f)
    4797                      .dwendtag $C$DW$T$80
    4798              
    4799              
    4800              $C$DW$T$86      .dwtag  DW_TAG_array_type
    4801                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$8)
    4802                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    4803                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x14)
    4804              $C$DW$468       .dwtag  DW_TAG_subrange_type
    4805                      .dwattr $C$DW$468, DW_AT_upper_bound(0x13)
    4806                      .dwendtag $C$DW$T$86
    4807              
    4808              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4809                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4810                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4811                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE  103

    4812              
    4813              $C$DW$T$29      .dwtag  DW_TAG_array_type
    4814                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$9)
    4815                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4816                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    4817              $C$DW$469       .dwtag  DW_TAG_subrange_type
    4818                      .dwattr $C$DW$469, DW_AT_upper_bound(0x00)
    4819                      .dwendtag $C$DW$T$29
    4820              
    4821              
    4822              $C$DW$T$35      .dwtag  DW_TAG_array_type
    4823                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    4824                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4825                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    4826              $C$DW$470       .dwtag  DW_TAG_subrange_type
    4827                      .dwattr $C$DW$470, DW_AT_upper_bound(0x01)
    4828                      .dwendtag $C$DW$T$35
    4829              
    4830              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4831                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$9)
    4832                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    4833              $C$DW$471       .dwtag  DW_TAG_TI_far_type
    4834                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$9)
    4835              $C$DW$T$108     .dwtag  DW_TAG_const_type
    4836                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$471)
    4837              $C$DW$T$109     .dwtag  DW_TAG_pointer_type
    4838                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    4839                      .dwattr $C$DW$T$109, DW_AT_address_class(0x17)
    4840              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    4841                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$9)
    4842                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4843              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    4844                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
    4845                      .dwattr $C$DW$T$24, DW_AT_address_class(0x17)
    4846              
    4847              $C$DW$T$39      .dwtag  DW_TAG_array_type
    4848                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$22)
    4849                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4850                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    4851              $C$DW$472       .dwtag  DW_TAG_subrange_type
    4852                      .dwattr $C$DW$472, DW_AT_upper_bound(0x13)
    4853                      .dwendtag $C$DW$T$39
    4854              
    4855              
    4856              $C$DW$T$87      .dwtag  DW_TAG_array_type
    4857                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$22)
    4858                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4859                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x02)
    4860              $C$DW$473       .dwtag  DW_TAG_subrange_type
    4861                      .dwattr $C$DW$473, DW_AT_upper_bound(0x01)
    4862                      .dwendtag $C$DW$T$87
    4863              
    4864              $C$DW$474       .dwtag  DW_TAG_TI_far_type
    4865                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    4866              $C$DW$T$138     .dwtag  DW_TAG_const_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE  104

    4867                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$474)
    4868              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4869                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4870                      .dwattr $C$DW$T$10, DW_AT_name("int")
    4871                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    4872              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("Int")
    4873                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$10)
    4874                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    4875              $C$DW$T$11      .dwtag  DW_TAG_base_type
    4876                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4877                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4878                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    4879              $C$DW$T$12      .dwtag  DW_TAG_base_type
    4880                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4881                      .dwattr $C$DW$T$12, DW_AT_name("long")
    4882                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    4883              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    4884                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$12)
    4885                      .dwattr $C$DW$T$49, DW_AT_address_class(0x17)
    4886              
    4887              $C$DW$T$63      .dwtag  DW_TAG_array_type
    4888                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$12)
    4889                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    4890                      .dwattr $C$DW$T$63, DW_AT_byte_size(0xd0)
    4891              $C$DW$475       .dwtag  DW_TAG_subrange_type
    4892                      .dwattr $C$DW$475, DW_AT_upper_bound(0x67)
    4893                      .dwendtag $C$DW$T$63
    4894              
    4895              
    4896              $C$DW$T$66      .dwtag  DW_TAG_array_type
    4897                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$12)
    4898                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4899                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x20)
    4900              $C$DW$476       .dwtag  DW_TAG_subrange_type
    4901                      .dwattr $C$DW$476, DW_AT_upper_bound(0x0f)
    4902                      .dwendtag $C$DW$T$66
    4903              
    4904              $C$DW$T$13      .dwtag  DW_TAG_base_type
    4905                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4906                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4907                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    4908              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4909                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$13)
    4910                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    4911              $C$DW$T$14      .dwtag  DW_TAG_base_type
    4912                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4913                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    4914                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    4915                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    4916                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    4917              $C$DW$T$15      .dwtag  DW_TAG_base_type
    4918                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4919                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4920                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    4921                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE  105

    4922                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    4923              $C$DW$T$16      .dwtag  DW_TAG_base_type
    4924                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4925                      .dwattr $C$DW$T$16, DW_AT_name("float")
    4926                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    4927              $C$DW$T$17      .dwtag  DW_TAG_base_type
    4928                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4929                      .dwattr $C$DW$T$17, DW_AT_name("double")
    4930                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    4931              $C$DW$T$18      .dwtag  DW_TAG_base_type
    4932                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4933                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    4934                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    4935              $C$DW$T$75      .dwtag  DW_TAG_base_type
    4936                      .dwattr $C$DW$T$75, DW_AT_encoding(DW_ATE_signed_char)
    4937                      .dwattr $C$DW$T$75, DW_AT_name("signed char")
    4938                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x01)
    4939              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    4940                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    4941                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    4942              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    4943                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$76)
    4944                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    4945              
    4946              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4947                      .dwattr $C$DW$T$51, DW_AT_name("ele")
    4948                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x03)
    4949              $C$DW$477       .dwtag  DW_TAG_member
    4950                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$9)
    4951                      .dwattr $C$DW$477, DW_AT_name("sym")
    4952                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_sym")
    4953                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4954                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4955              $C$DW$478       .dwtag  DW_TAG_member
    4956                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$9)
    4957                      .dwattr $C$DW$478, DW_AT_name("idx_flag")
    4958                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_idx_flag")
    4959                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4960                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4961              $C$DW$479       .dwtag  DW_TAG_member
    4962                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$9)
    4963                      .dwattr $C$DW$479, DW_AT_name("next")
    4964                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_next")
    4965                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4966                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4967                      .dwendtag $C$DW$T$51
    4968              
    4969              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    4970                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$51)
    4971                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4972              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    4973                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    4974                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    4975              
    4976              $C$DW$T$92      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE  106

    4977                      .dwattr $C$DW$T$92, DW_AT_name("gmhmm_type")
    4978                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x7fe)
    4979              $C$DW$480       .dwtag  DW_TAG_member
    4980                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
    4981                      .dwattr $C$DW$480, DW_AT_name("avedepth")
    4982                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_avedepth")
    4983                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4984                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4985              $C$DW$481       .dwtag  DW_TAG_member
    4986                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$22)
    4987                      .dwattr $C$DW$481, DW_AT_name("bestdepth")
    4988                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_bestdepth")
    4989                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4990                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4991              $C$DW$482       .dwtag  DW_TAG_member
    4992                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$22)
    4993                      .dwattr $C$DW$482, DW_AT_name("index_mean")
    4994                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_index_mean")
    4995                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4996                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4997              $C$DW$483       .dwtag  DW_TAG_member
    4998                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$22)
    4999                      .dwattr $C$DW$483, DW_AT_name("signal_cnt")
    5000                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_signal_cnt")
    5001                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5002                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5003              $C$DW$484       .dwtag  DW_TAG_member
    5004                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$8)
    5005                      .dwattr $C$DW$484, DW_AT_name("buf_idx")
    5006                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_buf_idx")
    5007                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5008                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5009              $C$DW$485       .dwtag  DW_TAG_member
    5010                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$22)
    5011                      .dwattr $C$DW$485, DW_AT_name("speech_detected")
    5012                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_speech_detected")
    5013                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5014                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5015              $C$DW$486       .dwtag  DW_TAG_member
    5016                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$22)
    5017                      .dwattr $C$DW$486, DW_AT_name("mfcc_cnt")
    5018                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_mfcc_cnt")
    5019                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5020                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5021              $C$DW$487       .dwtag  DW_TAG_member
    5022                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$22)
    5023                      .dwattr $C$DW$487, DW_AT_name("nbr_cpy")
    5024                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_nbr_cpy")
    5025                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5026                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5027              $C$DW$488       .dwtag  DW_TAG_member
    5028                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$8)
    5029                      .dwattr $C$DW$488, DW_AT_name("last_sig")
    5030                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_last_sig")
    5031                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE  107

    5032                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5033              $C$DW$489       .dwtag  DW_TAG_member
    5034                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$52)
    5035                      .dwattr $C$DW$489, DW_AT_name("sample_signal")
    5036                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_sample_signal")
    5037                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5038                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5039              $C$DW$490       .dwtag  DW_TAG_member
    5040                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$8)
    5041                      .dwattr $C$DW$490, DW_AT_name("amplitude_max")
    5042                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_amplitude_max")
    5043                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    5044                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5045              $C$DW$491       .dwtag  DW_TAG_member
    5046                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$8)
    5047                      .dwattr $C$DW$491, DW_AT_name("amplitude_min")
    5048                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_amplitude_min")
    5049                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    5050                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5051              $C$DW$492       .dwtag  DW_TAG_member
    5052                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$8)
    5053                      .dwattr $C$DW$492, DW_AT_name("pred_first_frame")
    5054                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_pred_first_frame")
    5055                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    5056                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5057              $C$DW$493       .dwtag  DW_TAG_member
    5058                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$8)
    5059                      .dwattr $C$DW$493, DW_AT_name("frm_cnt")
    5060                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_frm_cnt")
    5061                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    5062                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5063              $C$DW$494       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$8)
    5065                      .dwattr $C$DW$494, DW_AT_name("beam_count")
    5066                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_beam_count")
    5067                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    5068                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5069              $C$DW$495       .dwtag  DW_TAG_member
    5070                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$8)
    5071                      .dwattr $C$DW$495, DW_AT_name("active_beam_cells")
    5072                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_active_beam_cells")
    5073                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    5074                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5075              $C$DW$496       .dwtag  DW_TAG_member
    5076                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$8)
    5077                      .dwattr $C$DW$496, DW_AT_name("active_time_cells")
    5078                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_active_time_cells")
    5079                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    5080                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5081              $C$DW$497       .dwtag  DW_TAG_member
    5082                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$9)
    5083                      .dwattr $C$DW$497, DW_AT_name("ending_sym_count")
    5084                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_ending_sym_count")
    5085                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    5086                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:33:48 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1193610                         PAGE  108

    5087              $C$DW$498       .dwtag  DW_TAG_member
    5088                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$8)
    5089                      .dwattr $C$DW$498, DW_AT_name("comp_type")
