TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE    1

   17221              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:33:51 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

   14898              $C$DW$1236      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureDimensionFail"), DW_AT_const_value(
   14899              $C$DW$1237      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSegmentSizeCheckFail"), DW_AT_const_value(
   14900              $C$DW$1238      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelFileFail"), DW_AT_const_value(0x1c4)
   14901              $C$DW$1239      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSaveFail"), DW_AT_const_value(0x1c5)
   14902              $C$DW$1240      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineEnrollLoadFail"), DW_AT_const_value(0x1c6)
   14903              $C$DW$1241      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackgoundCreationFail"), DW_AT_const_value
   14904              $C$DW$1242      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineStateMemoryOut"), DW_AT_const_value(0x1f4)
   14905              $C$DW$1243      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSearchMemoryOut"), DW_AT_const_value(0x1f5
   14906              $C$DW$1244      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelMemorySize"), DW_AT_const_value(0x258
   14907              $C$DW$1245      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureMemorySize"), DW_AT_const_value(0x2
   14908              $C$DW$1246      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineNetworkMemorySize"), DW_AT_const_value(0x2
   14909              $C$DW$1247      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelSize"), DW_AT_const_value(0x25b)
   14910              $C$DW$1248      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackTrackMemorySize"), DW_AT_const_value(0
   14911              $C$DW$1249      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineCMMemorySize"), DW_AT_const_value(0x25d)
   14912              $C$DW$1250      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineVALTreeMemorySize"), DW_AT_const_value(0x2
   14913              $C$DW$1251      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSym2PosMapSize"), DW_AT_const_value(0x25f)
   14914              $C$DW$1252      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineShortUtterance"), DW_AT_const_value(0x2bc)
   14915              $C$DW$1253      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadHMM2Phone"), DW_AT_const_value(0x320)
   14916              $C$DW$1254      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNoSilencePhone"), DW_AT_const_value(0x321)
   14917              $C$DW$1255      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhone2Voicing"), DW_AT_const_value(0x322)
   14918              $C$DW$1256      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhoneDuration"), DW_AT_const_value(0x323)
   14919              $C$DW$1257      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMismatch"), DW_AT_const_value(0x324)
   14920              $C$DW$1258      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMissWord"), DW_AT_const_value(0x325)
   14921              $C$DW$1259      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneDuration"), DW_AT_const_value(0x326)
   14922              $C$DW$1260      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneWord"), DW_AT_const_value(0x327)
   14923              $C$DW$1261      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveTTSMean"), DW_AT_const_value(0x328)
   14924              $C$DW$1262      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveVoicing"), DW_AT_const_value(0x329)
   14925              $C$DW$1263      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveDuration"), DW_AT_const_value(0x32a)
   14926              $C$DW$1264      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSTTS"), DW_AT_const_value(0x32b)
   14927              $C$DW$1265      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneList"), DW_AT_const_value(0x32c)
   14928              $C$DW$1266      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumPhones"), DW_AT_const_value(0x32d)
   14929              $C$DW$1267      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumWords"), DW_AT_const_value(0x32e)
   14930              $C$DW$1268      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputFile"), DW_AT_const_value(0x32f)
   14931              $C$DW$1269      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputMFCC"), DW_AT_const_value(0x330)
   14932              $C$DW$1270      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputDuration"), DW_AT_const_value(0x331)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  342

   14933              $C$DW$1271      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputVoicing"), DW_AT_const_value(0x332)
   14934              $C$DW$1272      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNotFound"), DW_AT_const_value(0x333)
   14935              $C$DW$1273      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputMeanSize"), DW_AT_const_value(0x334)
   14936              $C$DW$1274      .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutput"), DW_AT_const_value(0x335)
   14937                      .dwendtag $C$DW$T$94
   14938              
   14939              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineStatusType")
   14940                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   14941                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   14942              
   14943              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   14944                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
   14945              $C$DW$1275      .dwtag  DW_TAG_member
   14946                      .dwattr $C$DW$1275, DW_AT_type(*$C$DW$T$8)
   14947                      .dwattr $C$DW$1275, DW_AT_name("mean")
   14948                      .dwattr $C$DW$1275, DW_AT_TI_symbol_name("_mean")
   14949                      .dwattr $C$DW$1275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14950                      .dwattr $C$DW$1275, DW_AT_accessibility(DW_ACCESS_public)
   14951              $C$DW$1276      .dwtag  DW_TAG_member
   14952                      .dwattr $C$DW$1276, DW_AT_type(*$C$DW$T$8)
   14953                      .dwattr $C$DW$1276, DW_AT_name("inv")
   14954                      .dwattr $C$DW$1276, DW_AT_TI_symbol_name("_inv")
   14955                      .dwattr $C$DW$1276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14956                      .dwattr $C$DW$1276, DW_AT_accessibility(DW_ACCESS_public)
   14957              $C$DW$1277      .dwtag  DW_TAG_member
   14958                      .dwattr $C$DW$1277, DW_AT_type(*$C$DW$T$8)
   14959                      .dwattr $C$DW$1277, DW_AT_name("gconst")
   14960                      .dwattr $C$DW$1277, DW_AT_TI_symbol_name("_gconst")
   14961                      .dwattr $C$DW$1277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14962                      .dwattr $C$DW$1277, DW_AT_accessibility(DW_ACCESS_public)
   14963                      .dwendtag $C$DW$T$19
   14964              
   14965              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
   14966                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$19)
   14967                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
   14968              
   14969              $C$DW$T$26      .dwtag  DW_TAG_structure_type
   14970                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x544)
   14971              $C$DW$1278      .dwtag  DW_TAG_member
   14972                      .dwattr $C$DW$1278, DW_AT_type(*$C$DW$T$20)
   14973                      .dwattr $C$DW$1278, DW_AT_name("base_mem")
   14974                      .dwattr $C$DW$1278, DW_AT_TI_symbol_name("_base_mem")
   14975                      .dwattr $C$DW$1278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14976                      .dwattr $C$DW$1278, DW_AT_accessibility(DW_ACCESS_public)
   14977              $C$DW$1279      .dwtag  DW_TAG_member
   14978                      .dwattr $C$DW$1279, DW_AT_type(*$C$DW$T$21)
   14979                      .dwattr $C$DW$1279, DW_AT_name("mem_count")
   14980                      .dwattr $C$DW$1279, DW_AT_TI_symbol_name("_mem_count")
   14981                      .dwattr $C$DW$1279, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
   14982                      .dwattr $C$DW$1279, DW_AT_accessibility(DW_ACCESS_public)
   14983              $C$DW$1280      .dwtag  DW_TAG_member
   14984                      .dwattr $C$DW$1280, DW_AT_type(*$C$DW$T$22)
   14985                      .dwattr $C$DW$1280, DW_AT_name("answers")
   14986                      .dwattr $C$DW$1280, DW_AT_TI_symbol_name("_answers")
   14987                      .dwattr $C$DW$1280, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  343

   14988                      .dwattr $C$DW$1280, DW_AT_accessibility(DW_ACCESS_public)
   14989              $C$DW$1281      .dwtag  DW_TAG_member
   14990                      .dwattr $C$DW$1281, DW_AT_type(*$C$DW$T$22)
   14991                      .dwattr $C$DW$1281, DW_AT_name("uStp")
   14992                      .dwattr $C$DW$1281, DW_AT_TI_symbol_name("_uStp")
   14993                      .dwattr $C$DW$1281, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
   14994                      .dwattr $C$DW$1281, DW_AT_accessibility(DW_ACCESS_public)
   14995              $C$DW$1282      .dwtag  DW_TAG_member
   14996                      .dwattr $C$DW$1282, DW_AT_type(*$C$DW$T$21)
   14997                      .dwattr $C$DW$1282, DW_AT_name("nWords")
   14998                      .dwattr $C$DW$1282, DW_AT_TI_symbol_name("_nWords")
   14999                      .dwattr $C$DW$1282, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
   15000                      .dwattr $C$DW$1282, DW_AT_accessibility(DW_ACCESS_public)
   15001              $C$DW$1283      .dwtag  DW_TAG_member
   15002                      .dwattr $C$DW$1283, DW_AT_type(*$C$DW$T$8)
   15003                      .dwattr $C$DW$1283, DW_AT_name("nS")
   15004                      .dwattr $C$DW$1283, DW_AT_TI_symbol_name("_nS")
   15005                      .dwattr $C$DW$1283, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
   15006                      .dwattr $C$DW$1283, DW_AT_accessibility(DW_ACCESS_public)
   15007              $C$DW$1284      .dwtag  DW_TAG_member
   15008                      .dwattr $C$DW$1284, DW_AT_type(*$C$DW$T$23)
   15009                      .dwattr $C$DW$1284, DW_AT_name("cm_scr")
   15010                      .dwattr $C$DW$1284, DW_AT_TI_symbol_name("_cm_scr")
   15011                      .dwattr $C$DW$1284, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
   15012                      .dwattr $C$DW$1284, DW_AT_accessibility(DW_ACCESS_public)
   15013              $C$DW$1285      .dwtag  DW_TAG_member
   15014                      .dwattr $C$DW$1285, DW_AT_type(*$C$DW$T$8)
   15015                      .dwattr $C$DW$1285, DW_AT_name("bNeedUpdate")
   15016                      .dwattr $C$DW$1285, DW_AT_TI_symbol_name("_bNeedUpdate")
   15017                      .dwattr $C$DW$1285, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
   15018                      .dwattr $C$DW$1285, DW_AT_accessibility(DW_ACCESS_public)
   15019              $C$DW$1286      .dwtag  DW_TAG_member
   15020                      .dwattr $C$DW$1286, DW_AT_type(*$C$DW$T$23)
   15021                      .dwattr $C$DW$1286, DW_AT_name("cm_anti_scr")
   15022                      .dwattr $C$DW$1286, DW_AT_TI_symbol_name("_cm_anti_scr")
   15023                      .dwattr $C$DW$1286, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
   15024                      .dwattr $C$DW$1286, DW_AT_accessibility(DW_ACCESS_public)
   15025              $C$DW$1287      .dwtag  DW_TAG_member
   15026                      .dwattr $C$DW$1287, DW_AT_type(*$C$DW$T$12)
   15027                      .dwattr $C$DW$1287, DW_AT_name("cm_fg_scr")
   15028                      .dwattr $C$DW$1287, DW_AT_TI_symbol_name("_cm_fg_scr")
   15029                      .dwattr $C$DW$1287, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
   15030                      .dwattr $C$DW$1287, DW_AT_accessibility(DW_ACCESS_public)
   15031              $C$DW$1288      .dwtag  DW_TAG_member
   15032                      .dwattr $C$DW$1288, DW_AT_type(*$C$DW$T$12)
   15033                      .dwattr $C$DW$1288, DW_AT_name("cm_bk_scr")
   15034                      .dwattr $C$DW$1288, DW_AT_TI_symbol_name("_cm_bk_scr")
   15035                      .dwattr $C$DW$1288, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
   15036                      .dwattr $C$DW$1288, DW_AT_accessibility(DW_ACCESS_public)
   15037              $C$DW$1289      .dwtag  DW_TAG_member
   15038                      .dwattr $C$DW$1289, DW_AT_type(*$C$DW$T$8)
   15039                      .dwattr $C$DW$1289, DW_AT_name("th_nbest")
   15040                      .dwattr $C$DW$1289, DW_AT_TI_symbol_name("_th_nbest")
   15041                      .dwattr $C$DW$1289, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
   15042                      .dwattr $C$DW$1289, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  344

   15043              $C$DW$1290      .dwtag  DW_TAG_member
   15044                      .dwattr $C$DW$1290, DW_AT_type(*$C$DW$T$8)
   15045                      .dwattr $C$DW$1290, DW_AT_name("nSpeech")
   15046                      .dwattr $C$DW$1290, DW_AT_TI_symbol_name("_nSpeech")
   15047                      .dwattr $C$DW$1290, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
   15048                      .dwattr $C$DW$1290, DW_AT_accessibility(DW_ACCESS_public)
   15049              $C$DW$1291      .dwtag  DW_TAG_member
   15050                      .dwattr $C$DW$1291, DW_AT_type(*$C$DW$T$8)
   15051                      .dwattr $C$DW$1291, DW_AT_name("nNoise")
   15052                      .dwattr $C$DW$1291, DW_AT_TI_symbol_name("_nNoise")
   15053                      .dwattr $C$DW$1291, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
   15054                      .dwattr $C$DW$1291, DW_AT_accessibility(DW_ACCESS_public)
   15055              $C$DW$1292      .dwtag  DW_TAG_member
   15056                      .dwattr $C$DW$1292, DW_AT_type(*$C$DW$T$12)
   15057                      .dwattr $C$DW$1292, DW_AT_name("speech_power")
   15058                      .dwattr $C$DW$1292, DW_AT_TI_symbol_name("_speech_power")
   15059                      .dwattr $C$DW$1292, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
   15060                      .dwattr $C$DW$1292, DW_AT_accessibility(DW_ACCESS_public)
   15061              $C$DW$1293      .dwtag  DW_TAG_member
   15062                      .dwattr $C$DW$1293, DW_AT_type(*$C$DW$T$12)
   15063                      .dwattr $C$DW$1293, DW_AT_name("noise_power")
   15064                      .dwattr $C$DW$1293, DW_AT_TI_symbol_name("_noise_power")
   15065                      .dwattr $C$DW$1293, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
   15066                      .dwattr $C$DW$1293, DW_AT_accessibility(DW_ACCESS_public)
   15067              $C$DW$1294      .dwtag  DW_TAG_member
   15068                      .dwattr $C$DW$1294, DW_AT_type(*$C$DW$T$12)
   15069                      .dwattr $C$DW$1294, DW_AT_name("noise_power_sqr")
   15070                      .dwattr $C$DW$1294, DW_AT_TI_symbol_name("_noise_power_sqr")
   15071                      .dwattr $C$DW$1294, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
   15072                      .dwattr $C$DW$1294, DW_AT_accessibility(DW_ACCESS_public)
   15073              $C$DW$1295      .dwtag  DW_TAG_member
   15074                      .dwattr $C$DW$1295, DW_AT_type(*$C$DW$T$8)
   15075                      .dwattr $C$DW$1295, DW_AT_name("NSNR")
   15076                      .dwattr $C$DW$1295, DW_AT_TI_symbol_name("_NSNR")
   15077                      .dwattr $C$DW$1295, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
   15078                      .dwattr $C$DW$1295, DW_AT_accessibility(DW_ACCESS_public)
   15079              $C$DW$1296      .dwtag  DW_TAG_member
   15080                      .dwattr $C$DW$1296, DW_AT_type(*$C$DW$T$24)
   15081                      .dwattr $C$DW$1296, DW_AT_name("H0")
   15082                      .dwattr $C$DW$1296, DW_AT_TI_symbol_name("_H0")
   15083                      .dwattr $C$DW$1296, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
   15084                      .dwattr $C$DW$1296, DW_AT_accessibility(DW_ACCESS_public)
   15085              $C$DW$1297      .dwtag  DW_TAG_member
   15086                      .dwattr $C$DW$1297, DW_AT_type(*$C$DW$T$24)
   15087                      .dwattr $C$DW$1297, DW_AT_name("H1")
   15088                      .dwattr $C$DW$1297, DW_AT_TI_symbol_name("_H1")
   15089                      .dwattr $C$DW$1297, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
   15090                      .dwattr $C$DW$1297, DW_AT_accessibility(DW_ACCESS_public)
   15091              $C$DW$1298      .dwtag  DW_TAG_member
   15092                      .dwattr $C$DW$1298, DW_AT_type(*$C$DW$T$23)
   15093                      .dwattr $C$DW$1298, DW_AT_name("lgBeta")
   15094                      .dwattr $C$DW$1298, DW_AT_TI_symbol_name("_lgBeta")
   15095                      .dwattr $C$DW$1298, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
   15096                      .dwattr $C$DW$1298, DW_AT_accessibility(DW_ACCESS_public)
   15097              $C$DW$1299      .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  345

   15098                      .dwattr $C$DW$1299, DW_AT_type(*$C$DW$T$25)
   15099                      .dwattr $C$DW$1299, DW_AT_name("acc_dif2_beta")
   15100                      .dwattr $C$DW$1299, DW_AT_TI_symbol_name("_acc_dif2_beta")
   15101                      .dwattr $C$DW$1299, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
   15102                      .dwattr $C$DW$1299, DW_AT_accessibility(DW_ACCESS_public)
   15103              $C$DW$1300      .dwtag  DW_TAG_member
   15104                      .dwattr $C$DW$1300, DW_AT_type(*$C$DW$T$8)
   15105                      .dwattr $C$DW$1300, DW_AT_name("bCalced")
   15106                      .dwattr $C$DW$1300, DW_AT_TI_symbol_name("_bCalced")
   15107                      .dwattr $C$DW$1300, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
   15108                      .dwattr $C$DW$1300, DW_AT_accessibility(DW_ACCESS_public)
   15109              $C$DW$1301      .dwtag  DW_TAG_member
   15110                      .dwattr $C$DW$1301, DW_AT_type(*$C$DW$T$23)
   15111                      .dwattr $C$DW$1301, DW_AT_name("sCH")
   15112                      .dwattr $C$DW$1301, DW_AT_TI_symbol_name("_sCH")
   15113                      .dwattr $C$DW$1301, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
   15114                      .dwattr $C$DW$1301, DW_AT_accessibility(DW_ACCESS_public)
   15115              $C$DW$1302      .dwtag  DW_TAG_member
   15116                      .dwattr $C$DW$1302, DW_AT_type(*$C$DW$T$25)
   15117                      .dwattr $C$DW$1302, DW_AT_name("lAccum")
   15118                      .dwattr $C$DW$1302, DW_AT_TI_symbol_name("_lAccum")
   15119                      .dwattr $C$DW$1302, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
   15120                      .dwattr $C$DW$1302, DW_AT_accessibility(DW_ACCESS_public)
   15121              $C$DW$1303      .dwtag  DW_TAG_member
   15122                      .dwattr $C$DW$1303, DW_AT_type(*$C$DW$T$8)
   15123                      .dwattr $C$DW$1303, DW_AT_name("adp_th")
   15124                      .dwattr $C$DW$1303, DW_AT_TI_symbol_name("_adp_th")
   15125                      .dwattr $C$DW$1303, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
   15126                      .dwattr $C$DW$1303, DW_AT_accessibility(DW_ACCESS_public)
   15127                      .dwendtag $C$DW$T$26
   15128              
   15129              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
   15130                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$26)
   15131                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   15132              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   15133                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
   15134                      .dwattr $C$DW$T$92, DW_AT_address_class(0x17)
   15135              
   15136              $C$DW$T$27      .dwtag  DW_TAG_structure_type
   15137                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x03)
   15138              $C$DW$1304      .dwtag  DW_TAG_member
   15139                      .dwattr $C$DW$1304, DW_AT_type(*$C$DW$T$8)
   15140                      .dwattr $C$DW$1304, DW_AT_name("num")
   15141                      .dwattr $C$DW$1304, DW_AT_TI_symbol_name("_num")
   15142                      .dwattr $C$DW$1304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15143                      .dwattr $C$DW$1304, DW_AT_accessibility(DW_ACCESS_public)
   15144              $C$DW$1305      .dwtag  DW_TAG_member
   15145                      .dwattr $C$DW$1305, DW_AT_type(*$C$DW$T$8)
   15146                      .dwattr $C$DW$1305, DW_AT_name("x1")
   15147                      .dwattr $C$DW$1305, DW_AT_TI_symbol_name("_x1")
   15148                      .dwattr $C$DW$1305, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15149                      .dwattr $C$DW$1305, DW_AT_accessibility(DW_ACCESS_public)
   15150              $C$DW$1306      .dwtag  DW_TAG_member
   15151                      .dwattr $C$DW$1306, DW_AT_type(*$C$DW$T$8)
   15152                      .dwattr $C$DW$1306, DW_AT_name("x2")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  346

   15153                      .dwattr $C$DW$1306, DW_AT_TI_symbol_name("_x2")
   15154                      .dwattr $C$DW$1306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15155                      .dwattr $C$DW$1306, DW_AT_accessibility(DW_ACCESS_public)
   15156                      .dwendtag $C$DW$T$27
   15157              
   15158              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
   15159                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$27)
   15160                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   15161              $C$DW$1307      .dwtag  DW_TAG_TI_far_type
   15162                      .dwattr $C$DW$1307, DW_AT_type(*$C$DW$T$59)
   15163              $C$DW$T$60      .dwtag  DW_TAG_const_type
   15164                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$1307)
   15165              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
   15166                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   15167                      .dwattr $C$DW$T$61, DW_AT_address_class(0x17)
   15168              
   15169              $C$DW$T$28      .dwtag  DW_TAG_structure_type
   15170                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x18)
   15171              $C$DW$1308      .dwtag  DW_TAG_member
   15172                      .dwattr $C$DW$1308, DW_AT_type(*$C$DW$T$21)
   15173                      .dwattr $C$DW$1308, DW_AT_name("max_mem_usage")
   15174                      .dwattr $C$DW$1308, DW_AT_TI_symbol_name("_max_mem_usage")
   15175                      .dwattr $C$DW$1308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15176                      .dwattr $C$DW$1308, DW_AT_accessibility(DW_ACCESS_public)
   15177              $C$DW$1309      .dwtag  DW_TAG_member
   15178                      .dwattr $C$DW$1309, DW_AT_type(*$C$DW$T$21)
   15179                      .dwattr $C$DW$1309, DW_AT_name("n_terminals")
   15180                      .dwattr $C$DW$1309, DW_AT_TI_symbol_name("_n_terminals")
   15181                      .dwattr $C$DW$1309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15182                      .dwattr $C$DW$1309, DW_AT_accessibility(DW_ACCESS_public)
   15183              $C$DW$1310      .dwtag  DW_TAG_member
   15184                      .dwattr $C$DW$1310, DW_AT_type(*$C$DW$T$21)
   15185                      .dwattr $C$DW$1310, DW_AT_name("n_monophones")
   15186                      .dwattr $C$DW$1310, DW_AT_TI_symbol_name("_n_monophones")
   15187                      .dwattr $C$DW$1310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15188                      .dwattr $C$DW$1310, DW_AT_accessibility(DW_ACCESS_public)
   15189              $C$DW$1311      .dwtag  DW_TAG_member
   15190                      .dwattr $C$DW$1311, DW_AT_type(*$C$DW$T$23)
   15191                      .dwattr $C$DW$1311, DW_AT_name("hlrTreeBase")
   15192                      .dwattr $C$DW$1311, DW_AT_TI_symbol_name("_hlrTreeBase")
   15193                      .dwattr $C$DW$1311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15194                      .dwattr $C$DW$1311, DW_AT_accessibility(DW_ACCESS_public)
   15195              $C$DW$1312      .dwtag  DW_TAG_member
   15196                      .dwattr $C$DW$1312, DW_AT_type(*$C$DW$T$22)
   15197                      .dwattr $C$DW$1312, DW_AT_name("hlrTerminal")
   15198                      .dwattr $C$DW$1312, DW_AT_TI_symbol_name("_hlrTerminal")
   15199                      .dwattr $C$DW$1312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15200                      .dwattr $C$DW$1312, DW_AT_accessibility(DW_ACCESS_public)
   15201              $C$DW$1313      .dwtag  DW_TAG_member
   15202                      .dwattr $C$DW$1313, DW_AT_type(*$C$DW$T$23)
   15203                      .dwattr $C$DW$1313, DW_AT_name("pHMM2phone")
   15204                      .dwattr $C$DW$1313, DW_AT_TI_symbol_name("_pHMM2phone")
   15205                      .dwattr $C$DW$1313, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15206                      .dwattr $C$DW$1313, DW_AT_accessibility(DW_ACCESS_public)
   15207              $C$DW$1314      .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  347

   15208                      .dwattr $C$DW$1314, DW_AT_type(*$C$DW$T$22)
   15209                      .dwattr $C$DW$1314, DW_AT_name("hlrTransformIndex")
   15210                      .dwattr $C$DW$1314, DW_AT_TI_symbol_name("_hlrTransformIndex")
   15211                      .dwattr $C$DW$1314, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15212                      .dwattr $C$DW$1314, DW_AT_accessibility(DW_ACCESS_public)
   15213              $C$DW$1315      .dwtag  DW_TAG_member
   15214                      .dwattr $C$DW$1315, DW_AT_type(*$C$DW$T$21)
   15215                      .dwattr $C$DW$1315, DW_AT_name("hlr_TRANSFORM_SIZE")
   15216                      .dwattr $C$DW$1315, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
   15217                      .dwattr $C$DW$1315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15218                      .dwattr $C$DW$1315, DW_AT_accessibility(DW_ACCESS_public)
   15219              $C$DW$1316      .dwtag  DW_TAG_member
   15220                      .dwattr $C$DW$1316, DW_AT_type(*$C$DW$T$23)
   15221                      .dwattr $C$DW$1316, DW_AT_name("hlrTransforms")
   15222                      .dwattr $C$DW$1316, DW_AT_TI_symbol_name("_hlrTransforms")
   15223                      .dwattr $C$DW$1316, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15224                      .dwattr $C$DW$1316, DW_AT_accessibility(DW_ACCESS_public)
   15225              $C$DW$1317      .dwtag  DW_TAG_member
   15226                      .dwattr $C$DW$1317, DW_AT_type(*$C$DW$T$23)
   15227                      .dwattr $C$DW$1317, DW_AT_name("pSegStat_dif1")
   15228                      .dwattr $C$DW$1317, DW_AT_TI_symbol_name("_pSegStat_dif1")
   15229                      .dwattr $C$DW$1317, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15230                      .dwattr $C$DW$1317, DW_AT_accessibility(DW_ACCESS_public)
   15231              $C$DW$1318      .dwtag  DW_TAG_member
   15232                      .dwattr $C$DW$1318, DW_AT_type(*$C$DW$T$23)
   15233                      .dwattr $C$DW$1318, DW_AT_name("pSegStat_dif2")
   15234                      .dwattr $C$DW$1318, DW_AT_TI_symbol_name("_pSegStat_dif2")
   15235                      .dwattr $C$DW$1318, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15236                      .dwattr $C$DW$1318, DW_AT_accessibility(DW_ACCESS_public)
   15237              $C$DW$1319      .dwtag  DW_TAG_member
   15238                      .dwattr $C$DW$1319, DW_AT_type(*$C$DW$T$23)
   15239                      .dwattr $C$DW$1319, DW_AT_name("pEnhanced")
   15240                      .dwattr $C$DW$1319, DW_AT_TI_symbol_name("_pEnhanced")
   15241                      .dwattr $C$DW$1319, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   15242                      .dwattr $C$DW$1319, DW_AT_accessibility(DW_ACCESS_public)
   15243              $C$DW$1320      .dwtag  DW_TAG_member
   15244                      .dwattr $C$DW$1320, DW_AT_type(*$C$DW$T$23)
   15245                      .dwattr $C$DW$1320, DW_AT_name("bk_node_cnt")
   15246                      .dwattr $C$DW$1320, DW_AT_TI_symbol_name("_bk_node_cnt")
   15247                      .dwattr $C$DW$1320, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15248                      .dwattr $C$DW$1320, DW_AT_accessibility(DW_ACCESS_public)
   15249                      .dwendtag $C$DW$T$28
   15250              
   15251              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
   15252                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$28)
   15253                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   15254              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
   15255                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   15256                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
   15257              
   15258              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   15259                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x03)
   15260              $C$DW$1321      .dwtag  DW_TAG_member
   15261                      .dwattr $C$DW$1321, DW_AT_type(*$C$DW$T$9)
   15262                      .dwattr $C$DW$1321, DW_AT_name("sym_code")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  348

   15263                      .dwattr $C$DW$1321, DW_AT_TI_symbol_name("_sym_code")
   15264                      .dwattr $C$DW$1321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15265                      .dwattr $C$DW$1321, DW_AT_accessibility(DW_ACCESS_public)
   15266              $C$DW$1322      .dwtag  DW_TAG_member
   15267                      .dwattr $C$DW$1322, DW_AT_type(*$C$DW$T$9)
   15268                      .dwattr $C$DW$1322, DW_AT_name("start_cell")
   15269                      .dwattr $C$DW$1322, DW_AT_TI_symbol_name("_start_cell")
   15270                      .dwattr $C$DW$1322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15271                      .dwattr $C$DW$1322, DW_AT_accessibility(DW_ACCESS_public)
   15272              $C$DW$1323      .dwtag  DW_TAG_member
   15273                      .dwattr $C$DW$1323, DW_AT_type(*$C$DW$T$9)
   15274                      .dwattr $C$DW$1323, DW_AT_name("depth")
   15275                      .dwattr $C$DW$1323, DW_AT_TI_symbol_name("_depth")
   15276                      .dwattr $C$DW$1323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15277                      .dwattr $C$DW$1323, DW_AT_accessibility(DW_ACCESS_public)
   15278                      .dwendtag $C$DW$T$29
   15279              
   15280              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
   15281                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$29)
   15282                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   15283              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
   15284                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
   15285                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
   15286              
   15287              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   15288                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x03)
   15289              $C$DW$1324      .dwtag  DW_TAG_member
   15290                      .dwattr $C$DW$1324, DW_AT_type(*$C$DW$T$8)
   15291                      .dwattr $C$DW$1324, DW_AT_name("scr")
   15292                      .dwattr $C$DW$1324, DW_AT_TI_symbol_name("_scr")
   15293                      .dwattr $C$DW$1324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15294                      .dwattr $C$DW$1324, DW_AT_accessibility(DW_ACCESS_public)
   15295              $C$DW$1325      .dwtag  DW_TAG_member
   15296                      .dwattr $C$DW$1325, DW_AT_type(*$C$DW$T$9)
   15297                      .dwattr $C$DW$1325, DW_AT_name("sym")
   15298                      .dwattr $C$DW$1325, DW_AT_TI_symbol_name("_sym")
   15299                      .dwattr $C$DW$1325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15300                      .dwattr $C$DW$1325, DW_AT_accessibility(DW_ACCESS_public)
   15301              $C$DW$1326      .dwtag  DW_TAG_member
   15302                      .dwattr $C$DW$1326, DW_AT_type(*$C$DW$T$9)
   15303                      .dwattr $C$DW$1326, DW_AT_name("frm")
   15304                      .dwattr $C$DW$1326, DW_AT_TI_symbol_name("_frm")
   15305                      .dwattr $C$DW$1326, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15306                      .dwattr $C$DW$1326, DW_AT_accessibility(DW_ACCESS_public)
   15307                      .dwendtag $C$DW$T$30
   15308              
   15309              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
   15310                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$30)
   15311                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
   15312              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
   15313                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
   15314                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
   15315              
   15316              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   15317                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  349

   15318              $C$DW$1327      .dwtag  DW_TAG_member
   15319                      .dwattr $C$DW$1327, DW_AT_type(*$C$DW$T$9)
   15320                      .dwattr $C$DW$1327, DW_AT_name("frm")
   15321                      .dwattr $C$DW$1327, DW_AT_TI_symbol_name("_frm")
   15322                      .dwattr $C$DW$1327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15323                      .dwattr $C$DW$1327, DW_AT_accessibility(DW_ACCESS_public)
   15324              $C$DW$1328      .dwtag  DW_TAG_member
   15325                      .dwattr $C$DW$1328, DW_AT_type(*$C$DW$T$9)
   15326                      .dwattr $C$DW$1328, DW_AT_name("beam_idx")
   15327                      .dwattr $C$DW$1328, DW_AT_TI_symbol_name("_beam_idx")
   15328                      .dwattr $C$DW$1328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15329                      .dwattr $C$DW$1328, DW_AT_accessibility(DW_ACCESS_public)
   15330                      .dwendtag $C$DW$T$31
   15331              
   15332              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
   15333                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$31)
   15334                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
   15335              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
   15336                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
   15337                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
   15338              
   15339              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   15340                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
   15341              $C$DW$1329      .dwtag  DW_TAG_member
   15342                      .dwattr $C$DW$1329, DW_AT_type(*$C$DW$T$9)
   15343                      .dwattr $C$DW$1329, DW_AT_name("n_hmm")
   15344                      .dwattr $C$DW$1329, DW_AT_TI_symbol_name("_n_hmm")
   15345                      .dwattr $C$DW$1329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15346                      .dwattr $C$DW$1329, DW_AT_accessibility(DW_ACCESS_public)
   15347              $C$DW$1330      .dwtag  DW_TAG_member
   15348                      .dwattr $C$DW$1330, DW_AT_type(*$C$DW$T$9)
   15349                      .dwattr $C$DW$1330, DW_AT_name("n_sym")
   15350                      .dwattr $C$DW$1330, DW_AT_TI_symbol_name("_n_sym")
   15351                      .dwattr $C$DW$1330, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15352                      .dwattr $C$DW$1330, DW_AT_accessibility(DW_ACCESS_public)
   15353              $C$DW$1331      .dwtag  DW_TAG_member
   15354                      .dwattr $C$DW$1331, DW_AT_type(*$C$DW$T$9)
   15355                      .dwattr $C$DW$1331, DW_AT_name("n_word")
   15356                      .dwattr $C$DW$1331, DW_AT_TI_symbol_name("_n_word")
   15357                      .dwattr $C$DW$1331, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15358                      .dwattr $C$DW$1331, DW_AT_accessibility(DW_ACCESS_public)
   15359              $C$DW$1332      .dwtag  DW_TAG_member
   15360                      .dwattr $C$DW$1332, DW_AT_type(*$C$DW$T$9)
   15361                      .dwattr $C$DW$1332, DW_AT_name("n_set")
   15362                      .dwattr $C$DW$1332, DW_AT_TI_symbol_name("_n_set")
   15363                      .dwattr $C$DW$1332, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15364                      .dwattr $C$DW$1332, DW_AT_accessibility(DW_ACCESS_public)
   15365              $C$DW$1333      .dwtag  DW_TAG_member
   15366                      .dwattr $C$DW$1333, DW_AT_type(*$C$DW$T$9)
   15367                      .dwattr $C$DW$1333, DW_AT_name("n_hmm_set")
   15368                      .dwattr $C$DW$1333, DW_AT_TI_symbol_name("_n_hmm_set")
   15369                      .dwattr $C$DW$1333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15370                      .dwattr $C$DW$1333, DW_AT_accessibility(DW_ACCESS_public)
   15371              $C$DW$1334      .dwtag  DW_TAG_member
   15372                      .dwattr $C$DW$1334, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  350

   15373                      .dwattr $C$DW$1334, DW_AT_name("start")
   15374                      .dwattr $C$DW$1334, DW_AT_TI_symbol_name("_start")
   15375                      .dwattr $C$DW$1334, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15376                      .dwattr $C$DW$1334, DW_AT_accessibility(DW_ACCESS_public)
   15377              $C$DW$1335      .dwtag  DW_TAG_member
   15378                      .dwattr $C$DW$1335, DW_AT_type(*$C$DW$T$9)
   15379                      .dwattr $C$DW$1335, DW_AT_name("stop")
   15380                      .dwattr $C$DW$1335, DW_AT_TI_symbol_name("_stop")
   15381                      .dwattr $C$DW$1335, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15382                      .dwattr $C$DW$1335, DW_AT_accessibility(DW_ACCESS_public)
   15383              $C$DW$1336      .dwtag  DW_TAG_member
   15384                      .dwattr $C$DW$1336, DW_AT_type(*$C$DW$T$32)
   15385                      .dwattr $C$DW$1336, DW_AT_name("symlist")
   15386                      .dwattr $C$DW$1336, DW_AT_TI_symbol_name("_symlist")
   15387                      .dwattr $C$DW$1336, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15388                      .dwattr $C$DW$1336, DW_AT_accessibility(DW_ACCESS_public)
   15389                      .dwendtag $C$DW$T$33
   15390              
   15391              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
   15392                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$33)
   15393                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
   15394              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   15395                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
   15396                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
   15397              
   15398              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   15399                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
   15400              $C$DW$1337      .dwtag  DW_TAG_member
   15401                      .dwattr $C$DW$1337, DW_AT_type(*$C$DW$T$9)
   15402                      .dwattr $C$DW$1337, DW_AT_name("high_pos")
   15403                      .dwattr $C$DW$1337, DW_AT_TI_symbol_name("_high_pos")
   15404                      .dwattr $C$DW$1337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15405                      .dwattr $C$DW$1337, DW_AT_accessibility(DW_ACCESS_public)
   15406              $C$DW$1338      .dwtag  DW_TAG_member
   15407                      .dwattr $C$DW$1338, DW_AT_type(*$C$DW$T$9)
   15408                      .dwattr $C$DW$1338, DW_AT_name("cur_pos")
   15409                      .dwattr $C$DW$1338, DW_AT_TI_symbol_name("_cur_pos")
   15410                      .dwattr $C$DW$1338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15411                      .dwattr $C$DW$1338, DW_AT_accessibility(DW_ACCESS_public)
   15412                      .dwendtag $C$DW$T$34
   15413              
   15414              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
   15415                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
   15416                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
   15417              
   15418              $C$DW$T$36      .dwtag  DW_TAG_array_type
   15419                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
   15420                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
   15421                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
   15422              $C$DW$1339      .dwtag  DW_TAG_subrange_type
   15423                      .dwattr $C$DW$1339, DW_AT_upper_bound(0x01)
   15424                      .dwendtag $C$DW$T$36
   15425              
   15426              $C$DW$T$113     .dwtag  DW_TAG_pointer_type
   15427                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$35)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  351

   15428                      .dwattr $C$DW$T$113, DW_AT_address_class(0x17)
   15429              
   15430              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   15431                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
   15432              $C$DW$1340      .dwtag  DW_TAG_member
   15433                      .dwattr $C$DW$1340, DW_AT_type(*$C$DW$T$35)
   15434                      .dwattr $C$DW$1340, DW_AT_name("state")
   15435                      .dwattr $C$DW$1340, DW_AT_TI_symbol_name("_state")
   15436                      .dwattr $C$DW$1340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15437                      .dwattr $C$DW$1340, DW_AT_accessibility(DW_ACCESS_public)
   15438              $C$DW$1341      .dwtag  DW_TAG_member
   15439                      .dwattr $C$DW$1341, DW_AT_type(*$C$DW$T$36)
   15440                      .dwattr $C$DW$1341, DW_AT_name("sym")
   15441                      .dwattr $C$DW$1341, DW_AT_TI_symbol_name("_sym")
   15442                      .dwattr $C$DW$1341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15443                      .dwattr $C$DW$1341, DW_AT_accessibility(DW_ACCESS_public)
   15444              $C$DW$1342      .dwtag  DW_TAG_member
   15445                      .dwattr $C$DW$1342, DW_AT_type(*$C$DW$T$35)
   15446                      .dwattr $C$DW$1342, DW_AT_name("beam")
   15447                      .dwattr $C$DW$1342, DW_AT_TI_symbol_name("_beam")
   15448                      .dwattr $C$DW$1342, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15449                      .dwattr $C$DW$1342, DW_AT_accessibility(DW_ACCESS_public)
   15450              $C$DW$1343      .dwtag  DW_TAG_member
   15451                      .dwattr $C$DW$1343, DW_AT_type(*$C$DW$T$35)
   15452                      .dwattr $C$DW$1343, DW_AT_name("time")
   15453                      .dwattr $C$DW$1343, DW_AT_TI_symbol_name("_time")
   15454                      .dwattr $C$DW$1343, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15455                      .dwattr $C$DW$1343, DW_AT_accessibility(DW_ACCESS_public)
   15456                      .dwendtag $C$DW$T$37
   15457              
   15458              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
   15459                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$37)
   15460                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   15461              
   15462              $C$DW$T$39      .dwtag  DW_TAG_structure_type
   15463                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x03)
   15464              $C$DW$1344      .dwtag  DW_TAG_member
   15465                      .dwattr $C$DW$1344, DW_AT_type(*$C$DW$T$38)
   15466                      .dwattr $C$DW$1344, DW_AT_name("cur_sym")
   15467                      .dwattr $C$DW$1344, DW_AT_TI_symbol_name("_cur_sym")
   15468                      .dwattr $C$DW$1344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15469                      .dwattr $C$DW$1344, DW_AT_accessibility(DW_ACCESS_public)
   15470              $C$DW$1345      .dwtag  DW_TAG_member
   15471                      .dwattr $C$DW$1345, DW_AT_type(*$C$DW$T$9)
   15472                      .dwattr $C$DW$1345, DW_AT_name("cur_state")
   15473                      .dwattr $C$DW$1345, DW_AT_TI_symbol_name("_cur_state")
   15474                      .dwattr $C$DW$1345, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15475                      .dwattr $C$DW$1345, DW_AT_accessibility(DW_ACCESS_public)
   15476                      .dwendtag $C$DW$T$39
   15477              
   15478              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
   15479                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$39)
   15480                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
   15481              
   15482              $C$DW$T$84      .dwtag  DW_TAG_array_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  352

   15483                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   15484                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   15485                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x06)
   15486              $C$DW$1346      .dwtag  DW_TAG_subrange_type
   15487                      .dwattr $C$DW$1346, DW_AT_upper_bound(0x01)
   15488                      .dwendtag $C$DW$T$84
   15489              
   15490              $C$DW$T$106     .dwtag  DW_TAG_pointer_type
   15491                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$83)
   15492                      .dwattr $C$DW$T$106, DW_AT_address_class(0x17)
   15493              
   15494              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   15495                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
   15496              $C$DW$1347      .dwtag  DW_TAG_member
   15497                      .dwattr $C$DW$1347, DW_AT_type(*$C$DW$T$9)
   15498                      .dwattr $C$DW$1347, DW_AT_name("max_nbr_syms")
   15499                      .dwattr $C$DW$1347, DW_AT_TI_symbol_name("_max_nbr_syms")
   15500                      .dwattr $C$DW$1347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15501                      .dwattr $C$DW$1347, DW_AT_accessibility(DW_ACCESS_public)
   15502              $C$DW$1348      .dwtag  DW_TAG_member
   15503                      .dwattr $C$DW$1348, DW_AT_type(*$C$DW$T$8)
   15504                      .dwattr $C$DW$1348, DW_AT_name("nbr_syms")
   15505                      .dwattr $C$DW$1348, DW_AT_TI_symbol_name("_nbr_syms")
   15506                      .dwattr $C$DW$1348, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15507                      .dwattr $C$DW$1348, DW_AT_accessibility(DW_ACCESS_public)
   15508              $C$DW$1349      .dwtag  DW_TAG_member
   15509                      .dwattr $C$DW$1349, DW_AT_type(*$C$DW$T$23)
   15510                      .dwattr $C$DW$1349, DW_AT_name("sym2pos")
   15511                      .dwattr $C$DW$1349, DW_AT_TI_symbol_name("_sym2pos")
   15512                      .dwattr $C$DW$1349, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15513                      .dwattr $C$DW$1349, DW_AT_accessibility(DW_ACCESS_public)
   15514              $C$DW$1350      .dwtag  DW_TAG_member
   15515                      .dwattr $C$DW$1350, DW_AT_type(*$C$DW$T$40)
   15516                      .dwattr $C$DW$1350, DW_AT_name("syms")
   15517                      .dwattr $C$DW$1350, DW_AT_TI_symbol_name("_syms")
   15518                      .dwattr $C$DW$1350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15519                      .dwattr $C$DW$1350, DW_AT_accessibility(DW_ACCESS_public)
   15520                      .dwendtag $C$DW$T$41
   15521              
   15522              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
   15523                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$41)
   15524                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
   15525              
   15526              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   15527                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x16)
   15528              $C$DW$1351      .dwtag  DW_TAG_member
   15529                      .dwattr $C$DW$1351, DW_AT_type(*$C$DW$T$8)
   15530                      .dwattr $C$DW$1351, DW_AT_name("scr")
   15531                      .dwattr $C$DW$1351, DW_AT_TI_symbol_name("_scr")
   15532                      .dwattr $C$DW$1351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15533                      .dwattr $C$DW$1351, DW_AT_accessibility(DW_ACCESS_public)
   15534              $C$DW$1352      .dwtag  DW_TAG_member
   15535                      .dwattr $C$DW$1352, DW_AT_type(*$C$DW$T$8)
   15536                      .dwattr $C$DW$1352, DW_AT_name("n_ans")
   15537                      .dwattr $C$DW$1352, DW_AT_TI_symbol_name("_n_ans")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  353

   15538                      .dwattr $C$DW$1352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15539                      .dwattr $C$DW$1352, DW_AT_accessibility(DW_ACCESS_public)
   15540              $C$DW$1353      .dwtag  DW_TAG_member
   15541                      .dwattr $C$DW$1353, DW_AT_type(*$C$DW$T$42)
   15542                      .dwattr $C$DW$1353, DW_AT_name("answers")
   15543                      .dwattr $C$DW$1353, DW_AT_TI_symbol_name("_answers")
   15544                      .dwattr $C$DW$1353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15545                      .dwattr $C$DW$1353, DW_AT_accessibility(DW_ACCESS_public)
   15546                      .dwendtag $C$DW$T$43
   15547              
   15548              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
   15549                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$43)
   15550                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
   15551              
   15552              $C$DW$T$46      .dwtag  DW_TAG_array_type
   15553                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
   15554                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
   15555                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x294)
   15556              $C$DW$1354      .dwtag  DW_TAG_subrange_type
   15557                      .dwattr $C$DW$1354, DW_AT_upper_bound(0x1d)
   15558                      .dwendtag $C$DW$T$46
   15559              
   15560              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
   15561                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$45)
   15562                      .dwattr $C$DW$T$116, DW_AT_address_class(0x17)
   15563              
   15564              $C$DW$T$47      .dwtag  DW_TAG_structure_type
   15565                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x2b3)
   15566              $C$DW$1355      .dwtag  DW_TAG_member
   15567                      .dwattr $C$DW$1355, DW_AT_type(*$C$DW$T$8)
   15568                      .dwattr $C$DW$1355, DW_AT_name("n_bests")
   15569                      .dwattr $C$DW$1355, DW_AT_TI_symbol_name("_n_bests")
   15570                      .dwattr $C$DW$1355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15571                      .dwattr $C$DW$1355, DW_AT_accessibility(DW_ACCESS_public)
   15572              $C$DW$1356      .dwtag  DW_TAG_member
   15573                      .dwattr $C$DW$1356, DW_AT_type(*$C$DW$T$44)
   15574                      .dwattr $C$DW$1356, DW_AT_name("best_idx")
   15575                      .dwattr $C$DW$1356, DW_AT_TI_symbol_name("_best_idx")
   15576                      .dwattr $C$DW$1356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15577                      .dwattr $C$DW$1356, DW_AT_accessibility(DW_ACCESS_public)
   15578              $C$DW$1357      .dwtag  DW_TAG_member
   15579                      .dwattr $C$DW$1357, DW_AT_type(*$C$DW$T$46)
   15580                      .dwattr $C$DW$1357, DW_AT_name("elem")
   15581                      .dwattr $C$DW$1357, DW_AT_TI_symbol_name("_elem")
   15582                      .dwattr $C$DW$1357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
   15583                      .dwattr $C$DW$1357, DW_AT_accessibility(DW_ACCESS_public)
   15584                      .dwendtag $C$DW$T$47
   15585              
   15586              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
   15587                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$47)
   15588                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   15589              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
   15590                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$86)
   15591                      .dwattr $C$DW$T$96, DW_AT_address_class(0x17)
   15592              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  354

   15593              $C$DW$T$48      .dwtag  DW_TAG_structure_type
   15594                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x14)
   15595              $C$DW$1358      .dwtag  DW_TAG_member
   15596                      .dwattr $C$DW$1358, DW_AT_type(*$C$DW$T$21)
   15597                      .dwattr $C$DW$1358, DW_AT_name("alpha_p")
   15598                      .dwattr $C$DW$1358, DW_AT_TI_symbol_name("_alpha_p")
   15599                      .dwattr $C$DW$1358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15600                      .dwattr $C$DW$1358, DW_AT_accessibility(DW_ACCESS_public)
   15601              $C$DW$1359      .dwtag  DW_TAG_member
   15602                      .dwattr $C$DW$1359, DW_AT_type(*$C$DW$T$21)
   15603                      .dwattr $C$DW$1359, DW_AT_name("sAlpha")
   15604                      .dwattr $C$DW$1359, DW_AT_TI_symbol_name("_sAlpha")
   15605                      .dwattr $C$DW$1359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15606                      .dwattr $C$DW$1359, DW_AT_accessibility(DW_ACCESS_public)
   15607              $C$DW$1360      .dwtag  DW_TAG_member
   15608                      .dwattr $C$DW$1360, DW_AT_type(*$C$DW$T$8)
   15609                      .dwattr $C$DW$1360, DW_AT_name("sBeta")
   15610                      .dwattr $C$DW$1360, DW_AT_TI_symbol_name("_sBeta")
   15611                      .dwattr $C$DW$1360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15612                      .dwattr $C$DW$1360, DW_AT_accessibility(DW_ACCESS_public)
   15613              $C$DW$1361      .dwtag  DW_TAG_member
   15614                      .dwattr $C$DW$1361, DW_AT_type(*$C$DW$T$8)
   15615                      .dwattr $C$DW$1361, DW_AT_name("lambdaLTEhigherE")
   15616                      .dwattr $C$DW$1361, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
   15617                      .dwattr $C$DW$1361, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15618                      .dwattr $C$DW$1361, DW_AT_accessibility(DW_ACCESS_public)
   15619              $C$DW$1362      .dwtag  DW_TAG_member
   15620                      .dwattr $C$DW$1362, DW_AT_type(*$C$DW$T$8)
   15621                      .dwattr $C$DW$1362, DW_AT_name("frm_count")
   15622                      .dwattr $C$DW$1362, DW_AT_TI_symbol_name("_frm_count")
   15623                      .dwattr $C$DW$1362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15624                      .dwattr $C$DW$1362, DW_AT_accessibility(DW_ACCESS_public)
   15625              $C$DW$1363      .dwtag  DW_TAG_member
   15626                      .dwattr $C$DW$1363, DW_AT_type(*$C$DW$T$21)
   15627                      .dwattr $C$DW$1363, DW_AT_name("prob_sp")
   15628                      .dwattr $C$DW$1363, DW_AT_TI_symbol_name("_prob_sp")
   15629                      .dwattr $C$DW$1363, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15630                      .dwattr $C$DW$1363, DW_AT_accessibility(DW_ACCESS_public)
   15631              $C$DW$1364      .dwtag  DW_TAG_member
   15632                      .dwattr $C$DW$1364, DW_AT_type(*$C$DW$T$23)
   15633                      .dwattr $C$DW$1364, DW_AT_name("s_noise_floor")
   15634                      .dwattr $C$DW$1364, DW_AT_TI_symbol_name("_s_noise_floor")
   15635                      .dwattr $C$DW$1364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15636                      .dwattr $C$DW$1364, DW_AT_accessibility(DW_ACCESS_public)
   15637              $C$DW$1365      .dwtag  DW_TAG_member
   15638                      .dwattr $C$DW$1365, DW_AT_type(*$C$DW$T$23)
   15639                      .dwattr $C$DW$1365, DW_AT_name("snr")
   15640                      .dwattr $C$DW$1365, DW_AT_TI_symbol_name("_snr")
   15641                      .dwattr $C$DW$1365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15642                      .dwattr $C$DW$1365, DW_AT_accessibility(DW_ACCESS_public)
   15643              $C$DW$1366      .dwtag  DW_TAG_member
   15644                      .dwattr $C$DW$1366, DW_AT_type(*$C$DW$T$23)
   15645                      .dwattr $C$DW$1366, DW_AT_name("ps_long_term_noise")
   15646                      .dwattr $C$DW$1366, DW_AT_TI_symbol_name("_ps_long_term_noise")
   15647                      .dwattr $C$DW$1366, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  355

   15648                      .dwattr $C$DW$1366, DW_AT_accessibility(DW_ACCESS_public)
   15649              $C$DW$1367      .dwtag  DW_TAG_member
   15650                      .dwattr $C$DW$1367, DW_AT_type(*$C$DW$T$8)
   15651                      .dwattr $C$DW$1367, DW_AT_name("frmEn")
   15652                      .dwattr $C$DW$1367, DW_AT_TI_symbol_name("_frmEn")
   15653                      .dwattr $C$DW$1367, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15654                      .dwattr $C$DW$1367, DW_AT_accessibility(DW_ACCESS_public)
   15655              $C$DW$1368      .dwtag  DW_TAG_member
   15656                      .dwattr $C$DW$1368, DW_AT_type(*$C$DW$T$8)
   15657                      .dwattr $C$DW$1368, DW_AT_name("meanEn")
   15658                      .dwattr $C$DW$1368, DW_AT_TI_symbol_name("_meanEn")
   15659                      .dwattr $C$DW$1368, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15660                      .dwattr $C$DW$1368, DW_AT_accessibility(DW_ACCESS_public)
   15661              $C$DW$1369      .dwtag  DW_TAG_member
   15662                      .dwattr $C$DW$1369, DW_AT_type(*$C$DW$T$8)
   15663                      .dwattr $C$DW$1369, DW_AT_name("prevMeanEn")
   15664                      .dwattr $C$DW$1369, DW_AT_TI_symbol_name("_prevMeanEn")
   15665                      .dwattr $C$DW$1369, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15666                      .dwattr $C$DW$1369, DW_AT_accessibility(DW_ACCESS_public)
   15667              $C$DW$1370      .dwtag  DW_TAG_member
   15668                      .dwattr $C$DW$1370, DW_AT_type(*$C$DW$T$8)
   15669                      .dwattr $C$DW$1370, DW_AT_name("noiselvl")
   15670                      .dwattr $C$DW$1370, DW_AT_TI_symbol_name("_noiselvl")
   15671                      .dwattr $C$DW$1370, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   15672                      .dwattr $C$DW$1370, DW_AT_accessibility(DW_ACCESS_public)
   15673              $C$DW$1371      .dwtag  DW_TAG_member
   15674                      .dwattr $C$DW$1371, DW_AT_type(*$C$DW$T$8)
   15675                      .dwattr $C$DW$1371, DW_AT_name("lambdaLTE")
   15676                      .dwattr $C$DW$1371, DW_AT_TI_symbol_name("_lambdaLTE")
   15677                      .dwattr $C$DW$1371, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15678                      .dwattr $C$DW$1371, DW_AT_accessibility(DW_ACCESS_public)
   15679              $C$DW$1372      .dwtag  DW_TAG_member
   15680                      .dwattr $C$DW$1372, DW_AT_type(*$C$DW$T$8)
   15681                      .dwattr $C$DW$1372, DW_AT_name("nbSpeechFrame")
   15682                      .dwattr $C$DW$1372, DW_AT_TI_symbol_name("_nbSpeechFrame")
   15683                      .dwattr $C$DW$1372, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   15684                      .dwattr $C$DW$1372, DW_AT_accessibility(DW_ACCESS_public)
   15685              $C$DW$1373      .dwtag  DW_TAG_member
   15686                      .dwattr $C$DW$1373, DW_AT_type(*$C$DW$T$8)
   15687                      .dwattr $C$DW$1373, DW_AT_name("hangOver")
   15688                      .dwattr $C$DW$1373, DW_AT_TI_symbol_name("_hangOver")
   15689                      .dwattr $C$DW$1373, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15690                      .dwattr $C$DW$1373, DW_AT_accessibility(DW_ACCESS_public)
   15691                      .dwendtag $C$DW$T$48
   15692              
   15693              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
   15694                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$48)
   15695                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   15696              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
   15697                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
   15698                      .dwattr $C$DW$T$90, DW_AT_address_class(0x17)
   15699              
   15700              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   15701                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
   15702              $C$DW$1374      .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  356

   15703                      .dwattr $C$DW$1374, DW_AT_type(*$C$DW$T$8)
   15704                      .dwattr $C$DW$1374, DW_AT_name("tran")
   15705                      .dwattr $C$DW$1374, DW_AT_TI_symbol_name("_tran")
   15706                      .dwattr $C$DW$1374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15707                      .dwattr $C$DW$1374, DW_AT_accessibility(DW_ACCESS_public)
   15708              $C$DW$1375      .dwtag  DW_TAG_member
   15709                      .dwattr $C$DW$1375, DW_AT_type(*$C$DW$T$32)
   15710                      .dwattr $C$DW$1375, DW_AT_name("pdf_idx")
   15711                      .dwattr $C$DW$1375, DW_AT_TI_symbol_name("_pdf_idx")
   15712                      .dwattr $C$DW$1375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15713                      .dwattr $C$DW$1375, DW_AT_accessibility(DW_ACCESS_public)
   15714                      .dwendtag $C$DW$T$49
   15715              
   15716              $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("HmmType")
   15717                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$49)
   15718                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   15719              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
   15720                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
   15721                      .dwattr $C$DW$T$118, DW_AT_address_class(0x17)
   15722              
   15723              $C$DW$T$50      .dwtag  DW_TAG_structure_type
   15724                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x03)
   15725              $C$DW$1376      .dwtag  DW_TAG_member
   15726                      .dwattr $C$DW$1376, DW_AT_type(*$C$DW$T$9)
   15727                      .dwattr $C$DW$1376, DW_AT_name("hmm_code")
   15728                      .dwattr $C$DW$1376, DW_AT_TI_symbol_name("_hmm_code")
   15729                      .dwattr $C$DW$1376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15730                      .dwattr $C$DW$1376, DW_AT_accessibility(DW_ACCESS_public)
   15731              $C$DW$1377      .dwtag  DW_TAG_member
   15732                      .dwattr $C$DW$1377, DW_AT_type(*$C$DW$T$9)
   15733                      .dwattr $C$DW$1377, DW_AT_name("n_next")
   15734                      .dwattr $C$DW$1377, DW_AT_TI_symbol_name("_n_next")
   15735                      .dwattr $C$DW$1377, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15736                      .dwattr $C$DW$1377, DW_AT_accessibility(DW_ACCESS_public)
   15737              $C$DW$1378      .dwtag  DW_TAG_member
   15738                      .dwattr $C$DW$1378, DW_AT_type(*$C$DW$T$32)
   15739                      .dwattr $C$DW$1378, DW_AT_name("next")
   15740                      .dwattr $C$DW$1378, DW_AT_TI_symbol_name("_next")
   15741                      .dwattr $C$DW$1378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15742                      .dwattr $C$DW$1378, DW_AT_accessibility(DW_ACCESS_public)
   15743                      .dwendtag $C$DW$T$50
   15744              
   15745              $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("SymType")
   15746                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$50)
   15747                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   15748              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
   15749                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
   15750                      .dwattr $C$DW$T$120, DW_AT_address_class(0x17)
   15751              
   15752              $C$DW$T$51      .dwtag  DW_TAG_structure_type
   15753                      .dwattr $C$DW$T$51, DW_AT_name("_SEARCH_MEM")
   15754                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
   15755              $C$DW$1379      .dwtag  DW_TAG_member
   15756                      .dwattr $C$DW$1379, DW_AT_type(*$C$DW$T$23)
   15757                      .dwattr $C$DW$1379, DW_AT_name("p_lld_hmm")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  357

   15758                      .dwattr $C$DW$1379, DW_AT_TI_symbol_name("_p_lld_hmm")
   15759                      .dwattr $C$DW$1379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15760                      .dwattr $C$DW$1379, DW_AT_accessibility(DW_ACCESS_public)
   15761              $C$DW$1380      .dwtag  DW_TAG_member
   15762                      .dwattr $C$DW$1380, DW_AT_type(*$C$DW$T$23)
   15763                      .dwattr $C$DW$1380, DW_AT_name("p_beta_hmm")
   15764                      .dwattr $C$DW$1380, DW_AT_TI_symbol_name("_p_beta_hmm")
   15765                      .dwattr $C$DW$1380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15766                      .dwattr $C$DW$1380, DW_AT_accessibility(DW_ACCESS_public)
   15767                      .dwendtag $C$DW$T$51
   15768              
   15769              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("SearchMemType")
   15770                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$51)
   15771                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
   15772              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
   15773                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
   15774                      .dwattr $C$DW$T$122, DW_AT_address_class(0x17)
   15775              $C$DW$T$4       .dwtag  DW_TAG_base_type
   15776                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
   15777                      .dwattr $C$DW$T$4, DW_AT_name("bool")
   15778                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
   15779              $C$DW$T$5       .dwtag  DW_TAG_base_type
   15780                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
   15781                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
   15782                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
   15783              $C$DW$T$6       .dwtag  DW_TAG_base_type
   15784                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
   15785                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
   15786                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
   15787              $C$DW$T$7       .dwtag  DW_TAG_base_type
   15788                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
   15789                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
   15790                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
   15791              $C$DW$T$8       .dwtag  DW_TAG_base_type
   15792                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
   15793                      .dwattr $C$DW$T$8, DW_AT_name("short")
   15794                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
   15795              
   15796              $C$DW$T$20      .dwtag  DW_TAG_array_type
   15797                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$8)
   15798                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
   15799                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x514)
   15800              $C$DW$1381      .dwtag  DW_TAG_subrange_type
   15801                      .dwattr $C$DW$1381, DW_AT_upper_bound(0x513)
   15802                      .dwendtag $C$DW$T$20
   15803              
   15804              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
   15805                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$8)
   15806                      .dwattr $C$DW$T$23, DW_AT_address_class(0x17)
   15807              
   15808              $C$DW$T$44      .dwtag  DW_TAG_array_type
   15809                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$8)
   15810                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
   15811                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x1e)
   15812              $C$DW$1382      .dwtag  DW_TAG_subrange_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  358

   15813                      .dwattr $C$DW$1382, DW_AT_upper_bound(0x1d)
   15814                      .dwendtag $C$DW$T$44
   15815              
   15816              
   15817              $C$DW$T$53      .dwtag  DW_TAG_array_type
   15818                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
   15819                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   15820                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x100)
   15821              $C$DW$1383      .dwtag  DW_TAG_subrange_type
   15822                      .dwattr $C$DW$1383, DW_AT_upper_bound(0xff)
   15823                      .dwendtag $C$DW$T$53
   15824              
   15825              
   15826              $C$DW$T$54      .dwtag  DW_TAG_array_type
   15827                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$8)
   15828                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
   15829                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x10)
   15830              $C$DW$1384      .dwtag  DW_TAG_subrange_type
   15831                      .dwattr $C$DW$1384, DW_AT_upper_bound(0x0f)
   15832                      .dwendtag $C$DW$T$54
   15833              
   15834              
   15835              $C$DW$T$55      .dwtag  DW_TAG_array_type
   15836                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$8)
   15837                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   15838                      .dwattr $C$DW$T$55, DW_AT_byte_size(0xe0)
   15839              $C$DW$1385      .dwtag  DW_TAG_subrange_type
   15840                      .dwattr $C$DW$1385, DW_AT_upper_bound(0x0d)
   15841              $C$DW$1386      .dwtag  DW_TAG_subrange_type
   15842                      .dwattr $C$DW$1386, DW_AT_upper_bound(0x0f)
   15843                      .dwendtag $C$DW$T$55
   15844              
   15845              $C$DW$1387      .dwtag  DW_TAG_TI_far_type
   15846                      .dwattr $C$DW$1387, DW_AT_type(*$C$DW$T$8)
   15847              $C$DW$T$56      .dwtag  DW_TAG_const_type
   15848                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$1387)
   15849              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
   15850                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   15851                      .dwattr $C$DW$T$57, DW_AT_address_class(0x17)
   15852              
   15853              $C$DW$T$58      .dwtag  DW_TAG_array_type
   15854                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
   15855                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
   15856                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x20)
   15857              $C$DW$1388      .dwtag  DW_TAG_subrange_type
   15858                      .dwattr $C$DW$1388, DW_AT_upper_bound(0x0f)
   15859                      .dwendtag $C$DW$T$58
   15860              
   15861              
   15862              $C$DW$T$152     .dwtag  DW_TAG_array_type
   15863                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$56)
   15864                      .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
   15865                      .dwattr $C$DW$T$152, DW_AT_byte_size(0x16)
   15866              $C$DW$1389      .dwtag  DW_TAG_subrange_type
   15867                      .dwattr $C$DW$1389, DW_AT_upper_bound(0x15)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  359

   15868                      .dwendtag $C$DW$T$152
   15869              
   15870              
   15871              $C$DW$T$62      .dwtag  DW_TAG_array_type
   15872                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$8)
   15873                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   15874                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x80)
   15875              $C$DW$1390      .dwtag  DW_TAG_subrange_type
   15876                      .dwattr $C$DW$1390, DW_AT_upper_bound(0x7f)
   15877                      .dwendtag $C$DW$T$62
   15878              
   15879              
   15880              $C$DW$T$63      .dwtag  DW_TAG_array_type
   15881                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$8)
   15882                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   15883                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x1a)
   15884              $C$DW$1391      .dwtag  DW_TAG_subrange_type
   15885                      .dwattr $C$DW$1391, DW_AT_upper_bound(0x19)
   15886                      .dwendtag $C$DW$T$63
   15887              
   15888              
   15889              $C$DW$T$81      .dwtag  DW_TAG_array_type
   15890                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$8)
   15891                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
   15892                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x20)
   15893              $C$DW$1392      .dwtag  DW_TAG_subrange_type
   15894                      .dwattr $C$DW$1392, DW_AT_upper_bound(0x1f)
   15895                      .dwendtag $C$DW$T$81
   15896              
   15897              
   15898              $C$DW$T$87      .dwtag  DW_TAG_array_type
   15899                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$8)
   15900                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   15901                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x14)
   15902              $C$DW$1393      .dwtag  DW_TAG_subrange_type
   15903                      .dwattr $C$DW$1393, DW_AT_upper_bound(0x13)
   15904                      .dwendtag $C$DW$T$87
   15905              
   15906              
   15907              $C$DW$T$174     .dwtag  DW_TAG_array_type
   15908                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$8)
   15909                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
   15910                      .dwattr $C$DW$T$174, DW_AT_byte_size(0x16)
   15911              $C$DW$1394      .dwtag  DW_TAG_subrange_type
   15912                      .dwattr $C$DW$1394, DW_AT_upper_bound(0x15)
   15913                      .dwendtag $C$DW$T$174
   15914              
   15915              $C$DW$T$9       .dwtag  DW_TAG_base_type
   15916                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
   15917                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
   15918                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
   15919              
   15920              $C$DW$T$32      .dwtag  DW_TAG_array_type
   15921                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$9)
   15922                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  360

   15923                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
   15924              $C$DW$1395      .dwtag  DW_TAG_subrange_type
   15925                      .dwattr $C$DW$1395, DW_AT_upper_bound(0x00)
   15926                      .dwendtag $C$DW$T$32
   15927              
   15928              
   15929              $C$DW$T$38      .dwtag  DW_TAG_array_type
   15930                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$9)
   15931                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
   15932                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
   15933              $C$DW$1396      .dwtag  DW_TAG_subrange_type
   15934                      .dwattr $C$DW$1396, DW_AT_upper_bound(0x01)
   15935                      .dwendtag $C$DW$T$38
   15936              
   15937              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
   15938                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$9)
   15939                      .dwattr $C$DW$T$40, DW_AT_address_class(0x17)
   15940              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
   15941                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
   15942                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
   15943              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
   15944                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
   15945                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
   15946              
   15947              $C$DW$T$42      .dwtag  DW_TAG_array_type
   15948                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$21)
   15949                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
   15950                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x14)
   15951              $C$DW$1397      .dwtag  DW_TAG_subrange_type
   15952                      .dwattr $C$DW$1397, DW_AT_upper_bound(0x13)
   15953                      .dwendtag $C$DW$T$42
   15954              
   15955              
   15956              $C$DW$T$88      .dwtag  DW_TAG_array_type
   15957                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$21)
   15958                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
   15959                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x02)
   15960              $C$DW$1398      .dwtag  DW_TAG_subrange_type
   15961                      .dwattr $C$DW$1398, DW_AT_upper_bound(0x01)
   15962                      .dwendtag $C$DW$T$88
   15963              
   15964              $C$DW$T$10      .dwtag  DW_TAG_base_type
   15965                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
   15966                      .dwattr $C$DW$T$10, DW_AT_name("int")
   15967                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
   15968              $C$DW$T$11      .dwtag  DW_TAG_base_type
   15969                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
   15970                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
   15971                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
   15972              $C$DW$T$12      .dwtag  DW_TAG_base_type
   15973                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
   15974                      .dwattr $C$DW$T$12, DW_AT_name("long")
   15975                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
   15976              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
   15977                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$12)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  361

   15978                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
   15979              
   15980              $C$DW$T$64      .dwtag  DW_TAG_array_type
   15981                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
   15982                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   15983                      .dwattr $C$DW$T$64, DW_AT_byte_size(0xd0)
   15984              $C$DW$1399      .dwtag  DW_TAG_subrange_type
   15985                      .dwattr $C$DW$1399, DW_AT_upper_bound(0x67)
   15986                      .dwendtag $C$DW$T$64
   15987              
   15988              
   15989              $C$DW$T$67      .dwtag  DW_TAG_array_type
   15990                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$12)
   15991                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   15992                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x20)
   15993              $C$DW$1400      .dwtag  DW_TAG_subrange_type
   15994                      .dwattr $C$DW$1400, DW_AT_upper_bound(0x0f)
   15995                      .dwendtag $C$DW$T$67
   15996              
   15997              $C$DW$T$13      .dwtag  DW_TAG_base_type
   15998                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
   15999                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
   16000                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
   16001              $C$DW$T$14      .dwtag  DW_TAG_base_type
   16002                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
   16003                      .dwattr $C$DW$T$14, DW_AT_name("long long")
   16004                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
   16005                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
   16006                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
   16007              $C$DW$T$15      .dwtag  DW_TAG_base_type
   16008                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
   16009                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
   16010                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
   16011                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
   16012                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
   16013              $C$DW$T$16      .dwtag  DW_TAG_base_type
   16014                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
   16015                      .dwattr $C$DW$T$16, DW_AT_name("float")
   16016                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
   16017              $C$DW$T$17      .dwtag  DW_TAG_base_type
   16018                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
   16019                      .dwattr $C$DW$T$17, DW_AT_name("double")
   16020                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
   16021              $C$DW$T$18      .dwtag  DW_TAG_base_type
   16022                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
   16023                      .dwattr $C$DW$T$18, DW_AT_name("long double")
   16024                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
   16025              $C$DW$T$76      .dwtag  DW_TAG_base_type
   16026                      .dwattr $C$DW$T$76, DW_AT_encoding(DW_ATE_signed_char)
   16027                      .dwattr $C$DW$T$76, DW_AT_name("signed char")
   16028                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x01)
   16029              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
   16030                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
   16031                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
   16032              $C$DW$T$80      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  362

   16033                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$77)
   16034                      .dwattr $C$DW$T$80, DW_AT_address_class(0x17)
   16035              
   16036              $C$DW$T$52      .dwtag  DW_TAG_structure_type
   16037                      .dwattr $C$DW$T$52, DW_AT_name("ele")
   16038                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x03)
   16039              $C$DW$1401      .dwtag  DW_TAG_member
   16040                      .dwattr $C$DW$1401, DW_AT_type(*$C$DW$T$9)
   16041                      .dwattr $C$DW$1401, DW_AT_name("sym")
   16042                      .dwattr $C$DW$1401, DW_AT_TI_symbol_name("_sym")
   16043                      .dwattr $C$DW$1401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16044                      .dwattr $C$DW$1401, DW_AT_accessibility(DW_ACCESS_public)
   16045              $C$DW$1402      .dwtag  DW_TAG_member
   16046                      .dwattr $C$DW$1402, DW_AT_type(*$C$DW$T$9)
   16047                      .dwattr $C$DW$1402, DW_AT_name("idx_flag")
   16048                      .dwattr $C$DW$1402, DW_AT_TI_symbol_name("_idx_flag")
   16049                      .dwattr $C$DW$1402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16050                      .dwattr $C$DW$1402, DW_AT_accessibility(DW_ACCESS_public)
   16051              $C$DW$1403      .dwtag  DW_TAG_member
   16052                      .dwattr $C$DW$1403, DW_AT_type(*$C$DW$T$9)
   16053                      .dwattr $C$DW$1403, DW_AT_name("next")
   16054                      .dwattr $C$DW$1403, DW_AT_TI_symbol_name("_next")
   16055                      .dwattr $C$DW$1403, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16056                      .dwattr $C$DW$1403, DW_AT_accessibility(DW_ACCESS_public)
   16057                      .dwendtag $C$DW$T$52
   16058              
   16059              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
   16060                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$52)
   16061                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
   16062              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
   16063                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
   16064                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
   16065              
   16066              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   16067                      .dwattr $C$DW$T$93, DW_AT_name("gmhmm_type")
   16068                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x7fe)
   16069              $C$DW$1404      .dwtag  DW_TAG_member
   16070                      .dwattr $C$DW$1404, DW_AT_type(*$C$DW$T$21)
   16071                      .dwattr $C$DW$1404, DW_AT_name("avedepth")
   16072                      .dwattr $C$DW$1404, DW_AT_TI_symbol_name("_avedepth")
   16073                      .dwattr $C$DW$1404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16074                      .dwattr $C$DW$1404, DW_AT_accessibility(DW_ACCESS_public)
   16075              $C$DW$1405      .dwtag  DW_TAG_member
   16076                      .dwattr $C$DW$1405, DW_AT_type(*$C$DW$T$21)
   16077                      .dwattr $C$DW$1405, DW_AT_name("bestdepth")
   16078                      .dwattr $C$DW$1405, DW_AT_TI_symbol_name("_bestdepth")
   16079                      .dwattr $C$DW$1405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16080                      .dwattr $C$DW$1405, DW_AT_accessibility(DW_ACCESS_public)
   16081              $C$DW$1406      .dwtag  DW_TAG_member
   16082                      .dwattr $C$DW$1406, DW_AT_type(*$C$DW$T$21)
   16083                      .dwattr $C$DW$1406, DW_AT_name("index_mean")
   16084                      .dwattr $C$DW$1406, DW_AT_TI_symbol_name("_index_mean")
   16085                      .dwattr $C$DW$1406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16086                      .dwattr $C$DW$1406, DW_AT_accessibility(DW_ACCESS_public)
   16087              $C$DW$1407      .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  363

   16088                      .dwattr $C$DW$1407, DW_AT_type(*$C$DW$T$21)
   16089                      .dwattr $C$DW$1407, DW_AT_name("signal_cnt")
   16090                      .dwattr $C$DW$1407, DW_AT_TI_symbol_name("_signal_cnt")
   16091                      .dwattr $C$DW$1407, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16092                      .dwattr $C$DW$1407, DW_AT_accessibility(DW_ACCESS_public)
   16093              $C$DW$1408      .dwtag  DW_TAG_member
   16094                      .dwattr $C$DW$1408, DW_AT_type(*$C$DW$T$8)
   16095                      .dwattr $C$DW$1408, DW_AT_name("buf_idx")
   16096                      .dwattr $C$DW$1408, DW_AT_TI_symbol_name("_buf_idx")
   16097                      .dwattr $C$DW$1408, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16098                      .dwattr $C$DW$1408, DW_AT_accessibility(DW_ACCESS_public)
   16099              $C$DW$1409      .dwtag  DW_TAG_member
   16100                      .dwattr $C$DW$1409, DW_AT_type(*$C$DW$T$21)
   16101                      .dwattr $C$DW$1409, DW_AT_name("speech_detected")
   16102                      .dwattr $C$DW$1409, DW_AT_TI_symbol_name("_speech_detected")
   16103                      .dwattr $C$DW$1409, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16104                      .dwattr $C$DW$1409, DW_AT_accessibility(DW_ACCESS_public)
   16105              $C$DW$1410      .dwtag  DW_TAG_member
   16106                      .dwattr $C$DW$1410, DW_AT_type(*$C$DW$T$21)
   16107                      .dwattr $C$DW$1410, DW_AT_name("mfcc_cnt")
   16108                      .dwattr $C$DW$1410, DW_AT_TI_symbol_name("_mfcc_cnt")
   16109                      .dwattr $C$DW$1410, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16110                      .dwattr $C$DW$1410, DW_AT_accessibility(DW_ACCESS_public)
   16111              $C$DW$1411      .dwtag  DW_TAG_member
   16112                      .dwattr $C$DW$1411, DW_AT_type(*$C$DW$T$21)
   16113                      .dwattr $C$DW$1411, DW_AT_name("nbr_cpy")
   16114                      .dwattr $C$DW$1411, DW_AT_TI_symbol_name("_nbr_cpy")
   16115                      .dwattr $C$DW$1411, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16116                      .dwattr $C$DW$1411, DW_AT_accessibility(DW_ACCESS_public)
   16117              $C$DW$1412      .dwtag  DW_TAG_member
   16118                      .dwattr $C$DW$1412, DW_AT_type(*$C$DW$T$8)
   16119                      .dwattr $C$DW$1412, DW_AT_name("last_sig")
   16120                      .dwattr $C$DW$1412, DW_AT_TI_symbol_name("_last_sig")
   16121                      .dwattr $C$DW$1412, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16122                      .dwattr $C$DW$1412, DW_AT_accessibility(DW_ACCESS_public)
   16123              $C$DW$1413      .dwtag  DW_TAG_member
   16124                      .dwattr $C$DW$1413, DW_AT_type(*$C$DW$T$53)
   16125                      .dwattr $C$DW$1413, DW_AT_name("sample_signal")
   16126                      .dwattr $C$DW$1413, DW_AT_TI_symbol_name("_sample_signal")
   16127                      .dwattr $C$DW$1413, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   16128                      .dwattr $C$DW$1413, DW_AT_accessibility(DW_ACCESS_public)
   16129              $C$DW$1414      .dwtag  DW_TAG_member
   16130                      .dwattr $C$DW$1414, DW_AT_type(*$C$DW$T$8)
   16131                      .dwattr $C$DW$1414, DW_AT_name("amplitude_max")
   16132                      .dwattr $C$DW$1414, DW_AT_TI_symbol_name("_amplitude_max")
   16133                      .dwattr $C$DW$1414, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
   16134                      .dwattr $C$DW$1414, DW_AT_accessibility(DW_ACCESS_public)
   16135              $C$DW$1415      .dwtag  DW_TAG_member
   16136                      .dwattr $C$DW$1415, DW_AT_type(*$C$DW$T$8)
   16137                      .dwattr $C$DW$1415, DW_AT_name("amplitude_min")
   16138                      .dwattr $C$DW$1415, DW_AT_TI_symbol_name("_amplitude_min")
   16139                      .dwattr $C$DW$1415, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
   16140                      .dwattr $C$DW$1415, DW_AT_accessibility(DW_ACCESS_public)
   16141              $C$DW$1416      .dwtag  DW_TAG_member
   16142                      .dwattr $C$DW$1416, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:03 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0125610                         PAGE  364

   16143                      .dwattr $C$DW$1416, DW_AT_name("pred_first_frame")
   16144                      .dwattr $C$DW$1416, DW_AT_TI_symbol_name("_pred_first_frame")
   16145                      .dwattr $C$DW$1416, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
   16146                      .dwattr $C$DW$1416, DW_AT_accessibility(DW_ACCESS_public)
   16147              $C$DW$1417      .dwtag  DW_TAG_member
   16148                      .dwattr $C$DW$1417, DW_AT_type(*$C$DW$T$8)
   16149                      .dwattr $C$DW$1417, DW_AT_name("frm_cnt")
   16150                      .dwattr $C$DW$1417, DW_AT_TI_symbol_name("_frm_cnt")
   16151                      .dwattr $C$DW$1417, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
   16152                      .dwattr $C$DW$1417, DW_AT_accessibility(DW_ACCESS_public)
   16153              $C$DW$1418      .dwtag  DW_TAG_member
   16154                      .dwattr $C$DW$1418, DW_AT_type(*$C$DW$T$8)
   16155                      .dwattr $C$DW$1418, DW_AT_name("beam_count")
   16156                      .dwattr $C$DW$1418, DW_AT_TI_symbol_name("_beam_count")
   16157                      .dwattr $C$DW$1418, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
