TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE    1

    3524              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:34:05 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1279              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineVALTreeMemorySize"), DW_AT_const_value(0x2
    1280              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSym2PosMapSize"), DW_AT_const_value(0x25f)
    1281              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineShortUtterance"), DW_AT_const_value(0x2bc)
    1282              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadHMM2Phone"), DW_AT_const_value(0x320)
    1283              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNoSilencePhone"), DW_AT_const_value(0x321)
    1284              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhone2Voicing"), DW_AT_const_value(0x322)
    1285              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhoneDuration"), DW_AT_const_value(0x323)
    1286              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMismatch"), DW_AT_const_value(0x324)
    1287              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMissWord"), DW_AT_const_value(0x325)
    1288              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneDuration"), DW_AT_const_value(0x326)
    1289              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneWord"), DW_AT_const_value(0x327)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   30

    1290              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveTTSMean"), DW_AT_const_value(0x328)
    1291              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveVoicing"), DW_AT_const_value(0x329)
    1292              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveDuration"), DW_AT_const_value(0x32a)
    1293              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSTTS"), DW_AT_const_value(0x32b)
    1294              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneList"), DW_AT_const_value(0x32c)
    1295              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumPhones"), DW_AT_const_value(0x32d)
    1296              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumWords"), DW_AT_const_value(0x32e)
    1297              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputFile"), DW_AT_const_value(0x32f)
    1298              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputMFCC"), DW_AT_const_value(0x330)
    1299              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputDuration"), DW_AT_const_value(0x331)
    1300              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputVoicing"), DW_AT_const_value(0x332)
    1301              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNotFound"), DW_AT_const_value(0x333)
    1302              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputMeanSize"), DW_AT_const_value(0x334)
    1303              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutput"), DW_AT_const_value(0x335)
    1304                      .dwendtag $C$DW$T$91
    1305              
    1306              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineStatusType")
    1307                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    1308                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1309              
    1310              $C$DW$T$102     .dwtag  DW_TAG_enumeration_type
    1311                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x01)
    1312              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSuccess"), DW_AT_const_value(0x00)
    1313              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACMemoryFail"), DW_AT_const_value(0x01)
    1314              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACLoadFail"), DW_AT_const_value(0x02)
    1315              $C$DW$177       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACReset"), DW_AT_const_value(0x03)
    1316              $C$DW$178       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSaveFail"), DW_AT_const_value(0x04)
    1317              $C$DW$179       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSBCInitFail"), DW_AT_const_value(0x05)
    1318              $C$DW$180       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSBCLoadFail"), DW_AT_const_value(0x06)
    1319              $C$DW$181       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACSVAFail"), DW_AT_const_value(0x07)
    1320              $C$DW$182       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACFail"), DW_AT_const_value(0x08)
    1321              $C$DW$183       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACNoAlignment"), DW_AT_const_value(0x09)
    1322              $C$DW$184       .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineJACRJLoadFail"), DW_AT_const_value(0x0a)
    1323                      .dwendtag $C$DW$T$102
    1324              
    1325              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineJACStatusType")
    1326                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    1327                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    1328              
    1329              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1330                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
    1331              $C$DW$185       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$8)
    1333                      .dwattr $C$DW$185, DW_AT_name("num")
    1334                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_num")
    1335                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1336                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1337              $C$DW$186       .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$8)
    1339                      .dwattr $C$DW$186, DW_AT_name("x1")
    1340                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_x1")
    1341                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1342                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1343              $C$DW$187       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   31

    1345                      .dwattr $C$DW$187, DW_AT_name("x2")
    1346                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_x2")
    1347                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1348                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1349                      .dwendtag $C$DW$T$19
    1350              
    1351              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
    1352                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$19)
    1353                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1354              $C$DW$188       .dwtag  DW_TAG_TI_far_type
    1355                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$56)
    1356              $C$DW$T$57      .dwtag  DW_TAG_const_type
    1357                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$188)
    1358              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    1359                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1360                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
    1361              
    1362              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1363                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    1364              $C$DW$189       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    1366                      .dwattr $C$DW$189, DW_AT_name("max_mem_usage")
    1367                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_max_mem_usage")
    1368                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1369                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$190       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    1372                      .dwattr $C$DW$190, DW_AT_name("n_terminals")
    1373                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_n_terminals")
    1374                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1375                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$191       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    1378                      .dwattr $C$DW$191, DW_AT_name("n_monophones")
    1379                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_n_monophones")
    1380                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1381                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1382              $C$DW$192       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    1384                      .dwattr $C$DW$192, DW_AT_name("hlrTreeBase")
    1385                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_hlrTreeBase")
    1386                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1387                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1388              $C$DW$193       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    1390                      .dwattr $C$DW$193, DW_AT_name("hlrTerminal")
    1391                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_hlrTerminal")
    1392                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1393                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1394              $C$DW$194       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    1396                      .dwattr $C$DW$194, DW_AT_name("pHMM2phone")
    1397                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_pHMM2phone")
    1398                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1399                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   32

    1400              $C$DW$195       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    1402                      .dwattr $C$DW$195, DW_AT_name("hlrTransformIndex")
    1403                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_hlrTransformIndex")
    1404                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1405                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$196       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    1408                      .dwattr $C$DW$196, DW_AT_name("hlr_TRANSFORM_SIZE")
    1409                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    1410                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1411                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$197       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    1414                      .dwattr $C$DW$197, DW_AT_name("hlrTransforms")
    1415                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_hlrTransforms")
    1416                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1417                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$198       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    1420                      .dwattr $C$DW$198, DW_AT_name("pSegStat_dif1")
    1421                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_pSegStat_dif1")
    1422                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1423                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$199       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    1426                      .dwattr $C$DW$199, DW_AT_name("pSegStat_dif2")
    1427                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_pSegStat_dif2")
    1428                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1429                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$200       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    1432                      .dwattr $C$DW$200, DW_AT_name("pEnhanced")
    1433                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_pEnhanced")
    1434                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1435                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$201       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    1438                      .dwattr $C$DW$201, DW_AT_name("bk_node_cnt")
    1439                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_bk_node_cnt")
    1440                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1441                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1442                      .dwendtag $C$DW$T$23
    1443              
    1444              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    1445                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$23)
    1446                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1447              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    1448                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    1449                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
    1450              
    1451              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1452                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    1453              $C$DW$202       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   33

    1455                      .dwattr $C$DW$202, DW_AT_name("sym_code")
    1456                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_sym_code")
    1457                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1459              $C$DW$203       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$9)
    1461                      .dwattr $C$DW$203, DW_AT_name("start_cell")
    1462                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_start_cell")
    1463                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1464                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$204       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$9)
    1467                      .dwattr $C$DW$204, DW_AT_name("depth")
    1468                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_depth")
    1469                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1470                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1471                      .dwendtag $C$DW$T$24
    1472              
    1473              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    1474                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$24)
    1475                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1476              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    1477                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    1478                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    1479              
    1480              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1481                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    1482              $C$DW$205       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$8)
    1484                      .dwattr $C$DW$205, DW_AT_name("scr")
    1485                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_scr")
    1486                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1488              $C$DW$206       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$9)
    1490                      .dwattr $C$DW$206, DW_AT_name("sym")
    1491                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_sym")
    1492                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1493                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1494              $C$DW$207       .dwtag  DW_TAG_member
    1495                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$9)
    1496                      .dwattr $C$DW$207, DW_AT_name("frm")
    1497                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_frm")
    1498                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1499                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1500                      .dwendtag $C$DW$T$25
    1501              
    1502              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    1503                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$25)
    1504                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1505              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    1506                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1507                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    1508              
    1509              $C$DW$T$26      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   34

    1510                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1511              $C$DW$208       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$9)
    1513                      .dwattr $C$DW$208, DW_AT_name("frm")
    1514                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_frm")
    1515                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$209       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$9)
    1519                      .dwattr $C$DW$209, DW_AT_name("beam_idx")
    1520                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_beam_idx")
    1521                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1522                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1523                      .dwendtag $C$DW$T$26
    1524              
    1525              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    1526                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$26)
    1527                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1528              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    1529                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    1530                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    1531              
    1532              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1533                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    1534              $C$DW$210       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$9)
    1536                      .dwattr $C$DW$210, DW_AT_name("n_hmm")
    1537                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_n_hmm")
    1538                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1540              $C$DW$211       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$9)
    1542                      .dwattr $C$DW$211, DW_AT_name("n_sym")
    1543                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_n_sym")
    1544                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1545                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$212       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$9)
    1548                      .dwattr $C$DW$212, DW_AT_name("n_word")
    1549                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_n_word")
    1550                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1551                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$213       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$9)
    1554                      .dwattr $C$DW$213, DW_AT_name("n_set")
    1555                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_n_set")
    1556                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1557                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1558              $C$DW$214       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$9)
    1560                      .dwattr $C$DW$214, DW_AT_name("n_hmm_set")
    1561                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_n_hmm_set")
    1562                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1563                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1564              $C$DW$215       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   35

    1565                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$9)
    1566                      .dwattr $C$DW$215, DW_AT_name("start")
    1567                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_start")
    1568                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1569                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1570              $C$DW$216       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$9)
    1572                      .dwattr $C$DW$216, DW_AT_name("stop")
    1573                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_stop")
    1574                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1575                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1576              $C$DW$217       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    1578                      .dwattr $C$DW$217, DW_AT_name("symlist")
    1579                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_symlist")
    1580                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1581                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1582                      .dwendtag $C$DW$T$28
    1583              
    1584              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    1585                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    1586                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1587              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    1588                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    1589                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    1590              
    1591              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1592                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1593              $C$DW$218       .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$9)
    1595                      .dwattr $C$DW$218, DW_AT_name("high_pos")
    1596                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_high_pos")
    1597                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1599              $C$DW$219       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$9)
    1601                      .dwattr $C$DW$219, DW_AT_name("cur_pos")
    1602                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_cur_pos")
    1603                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1604                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1605                      .dwendtag $C$DW$T$29
    1606              
    1607              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    1608                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1609                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1610              
    1611              $C$DW$T$31      .dwtag  DW_TAG_array_type
    1612                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1613                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1614                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1615              $C$DW$220       .dwtag  DW_TAG_subrange_type
    1616                      .dwattr $C$DW$220, DW_AT_upper_bound(0x01)
    1617                      .dwendtag $C$DW$T$31
    1618              
    1619              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   36

    1620              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1621                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    1622              $C$DW$221       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$30)
    1624                      .dwattr $C$DW$221, DW_AT_name("state")
    1625                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_state")
    1626                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1628              $C$DW$222       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$31)
    1630                      .dwattr $C$DW$222, DW_AT_name("sym")
    1631                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_sym")
    1632                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1633                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1634              $C$DW$223       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$30)
    1636                      .dwattr $C$DW$223, DW_AT_name("beam")
    1637                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_beam")
    1638                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1639                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1640              $C$DW$224       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$30)
    1642                      .dwattr $C$DW$224, DW_AT_name("time")
    1643                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_time")
    1644                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1645                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1646                      .dwendtag $C$DW$T$32
    1647              
    1648              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    1649                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$32)
    1650                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1651              
    1652              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1653                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
    1654              $C$DW$225       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$33)
    1656                      .dwattr $C$DW$225, DW_AT_name("cur_sym")
    1657                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_cur_sym")
    1658                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1659                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1660              $C$DW$226       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$9)
    1662                      .dwattr $C$DW$226, DW_AT_name("cur_state")
    1663                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_cur_state")
    1664                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1665                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1666                      .dwendtag $C$DW$T$34
    1667              
    1668              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    1669                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
    1670                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1671              
    1672              $C$DW$T$81      .dwtag  DW_TAG_array_type
    1673                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1674                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   37

    1675                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x06)
    1676              $C$DW$227       .dwtag  DW_TAG_subrange_type
    1677                      .dwattr $C$DW$227, DW_AT_upper_bound(0x01)
    1678                      .dwendtag $C$DW$T$81
    1679              
    1680              
    1681              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1682                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    1683              $C$DW$228       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$9)
    1685                      .dwattr $C$DW$228, DW_AT_name("max_nbr_syms")
    1686                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_max_nbr_syms")
    1687                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$229       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$8)
    1691                      .dwattr $C$DW$229, DW_AT_name("nbr_syms")
    1692                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_nbr_syms")
    1693                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1694                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1695              $C$DW$230       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$21)
    1697                      .dwattr $C$DW$230, DW_AT_name("sym2pos")
    1698                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_sym2pos")
    1699                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1700                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1701              $C$DW$231       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$35)
    1703                      .dwattr $C$DW$231, DW_AT_name("syms")
    1704                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_syms")
    1705                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1706                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1707                      .dwendtag $C$DW$T$36
    1708              
    1709              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    1710                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
    1711                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1712              
    1713              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1714                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    1715              $C$DW$232       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$8)
    1717                      .dwattr $C$DW$232, DW_AT_name("scr")
    1718                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_scr")
    1719                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1721              $C$DW$233       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$8)
    1723                      .dwattr $C$DW$233, DW_AT_name("n_ans")
    1724                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_n_ans")
    1725                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1726                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1727              $C$DW$234       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$37)
    1729                      .dwattr $C$DW$234, DW_AT_name("answers")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   38

    1730                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_answers")
    1731                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1732                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1733                      .dwendtag $C$DW$T$38
    1734              
    1735              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    1736                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
    1737                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1738              
    1739              $C$DW$T$41      .dwtag  DW_TAG_array_type
    1740                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1741                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1742                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
    1743              $C$DW$235       .dwtag  DW_TAG_subrange_type
    1744                      .dwattr $C$DW$235, DW_AT_upper_bound(0x1d)
    1745                      .dwendtag $C$DW$T$41
    1746              
    1747              
    1748              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1749                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
    1750              $C$DW$236       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$8)
    1752                      .dwattr $C$DW$236, DW_AT_name("n_bests")
    1753                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_n_bests")
    1754                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1756              $C$DW$237       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$39)
    1758                      .dwattr $C$DW$237, DW_AT_name("best_idx")
    1759                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_best_idx")
    1760                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1761                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1762              $C$DW$238       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$41)
    1764                      .dwattr $C$DW$238, DW_AT_name("elem")
    1765                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_elem")
    1766                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1767                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1768                      .dwendtag $C$DW$T$42
    1769              
    1770              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    1771                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
    1772                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1773              
    1774              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1775                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
    1776              $C$DW$239       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    1778                      .dwattr $C$DW$239, DW_AT_name("alpha_p")
    1779                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_alpha_p")
    1780                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1782              $C$DW$240       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    1784                      .dwattr $C$DW$240, DW_AT_name("sAlpha")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   39

    1785                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_sAlpha")
    1786                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1787                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1788              $C$DW$241       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$8)
    1790                      .dwattr $C$DW$241, DW_AT_name("sBeta")
    1791                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_sBeta")
    1792                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1793                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1794              $C$DW$242       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$8)
    1796                      .dwattr $C$DW$242, DW_AT_name("lambdaLTEhigherE")
    1797                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    1798                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1799                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1800              $C$DW$243       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$8)
    1802                      .dwattr $C$DW$243, DW_AT_name("frm_count")
    1803                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_frm_count")
    1804                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1805                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1806              $C$DW$244       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    1808                      .dwattr $C$DW$244, DW_AT_name("prob_sp")
    1809                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_prob_sp")
    1810                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1811                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1812              $C$DW$245       .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$21)
    1814                      .dwattr $C$DW$245, DW_AT_name("s_noise_floor")
    1815                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_s_noise_floor")
    1816                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1817                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1818              $C$DW$246       .dwtag  DW_TAG_member
    1819                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
    1820                      .dwattr $C$DW$246, DW_AT_name("snr")
    1821                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_snr")
    1822                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1823                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1824              $C$DW$247       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$21)
    1826                      .dwattr $C$DW$247, DW_AT_name("ps_long_term_noise")
    1827                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_ps_long_term_noise")
    1828                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1829                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1830              $C$DW$248       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$8)
    1832                      .dwattr $C$DW$248, DW_AT_name("frmEn")
    1833                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_frmEn")
    1834                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1835                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1836              $C$DW$249       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$8)
    1838                      .dwattr $C$DW$249, DW_AT_name("meanEn")
    1839                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_meanEn")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   40

    1840                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1841                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1842              $C$DW$250       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$8)
    1844                      .dwattr $C$DW$250, DW_AT_name("prevMeanEn")
    1845                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_prevMeanEn")
    1846                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1847                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1848              $C$DW$251       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$8)
    1850                      .dwattr $C$DW$251, DW_AT_name("noiselvl")
    1851                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_noiselvl")
    1852                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1853                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1854              $C$DW$252       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$8)
    1856                      .dwattr $C$DW$252, DW_AT_name("lambdaLTE")
    1857                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_lambdaLTE")
    1858                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1859                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1860              $C$DW$253       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$8)
    1862                      .dwattr $C$DW$253, DW_AT_name("nbSpeechFrame")
    1863                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_nbSpeechFrame")
    1864                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1865                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1866              $C$DW$254       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$8)
    1868                      .dwattr $C$DW$254, DW_AT_name("hangOver")
    1869                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_hangOver")
    1870                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1871                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1872                      .dwendtag $C$DW$T$43
    1873              
    1874              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    1875                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$43)
    1876                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1877              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    1878                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1879                      .dwattr $C$DW$T$87, DW_AT_address_class(0x17)
    1880              
    1881              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1882                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
    1883              $C$DW$255       .dwtag  DW_TAG_member
    1884                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$8)
    1885                      .dwattr $C$DW$255, DW_AT_name("mean")
    1886                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_mean")
    1887                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1888                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1889              $C$DW$256       .dwtag  DW_TAG_member
    1890                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$8)
    1891                      .dwattr $C$DW$256, DW_AT_name("inv")
    1892                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_inv")
    1893                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1894                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   41

    1895              $C$DW$257       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$8)
    1897                      .dwattr $C$DW$257, DW_AT_name("gconst")
    1898                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_gconst")
    1899                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1900                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1901                      .dwendtag $C$DW$T$44
    1902              
    1903              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    1904                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    1905                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1906              
    1907              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1908                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
    1909              $C$DW$258       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$45)
    1911                      .dwattr $C$DW$258, DW_AT_name("base_mem")
    1912                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_base_mem")
    1913                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1914                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$259       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    1917                      .dwattr $C$DW$259, DW_AT_name("mem_count")
    1918                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_mem_count")
    1919                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    1920                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$260       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$22)
    1923                      .dwattr $C$DW$260, DW_AT_name("answers")
    1924                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_answers")
    1925                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    1926                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$261       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$22)
    1929                      .dwattr $C$DW$261, DW_AT_name("uStp")
    1930                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_uStp")
    1931                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    1932                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$262       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    1935                      .dwattr $C$DW$262, DW_AT_name("nWords")
    1936                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_nWords")
    1937                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    1938                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$263       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$8)
    1941                      .dwattr $C$DW$263, DW_AT_name("nS")
    1942                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_nS")
    1943                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    1944                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$264       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$21)
    1947                      .dwattr $C$DW$264, DW_AT_name("cm_scr")
    1948                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_cm_scr")
    1949                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   42

    1950                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$265       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$8)
    1953                      .dwattr $C$DW$265, DW_AT_name("bNeedUpdate")
    1954                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_bNeedUpdate")
    1955                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    1956                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$266       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$21)
    1959                      .dwattr $C$DW$266, DW_AT_name("cm_anti_scr")
    1960                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_cm_anti_scr")
    1961                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    1962                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$267       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$12)
    1965                      .dwattr $C$DW$267, DW_AT_name("cm_fg_scr")
    1966                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_cm_fg_scr")
    1967                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    1968                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$268       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$12)
    1971                      .dwattr $C$DW$268, DW_AT_name("cm_bk_scr")
    1972                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_cm_bk_scr")
    1973                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    1974                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1975              $C$DW$269       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$8)
    1977                      .dwattr $C$DW$269, DW_AT_name("th_nbest")
    1978                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_th_nbest")
    1979                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    1980                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$270       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$8)
    1983                      .dwattr $C$DW$270, DW_AT_name("nSpeech")
    1984                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_nSpeech")
    1985                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    1986                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1987              $C$DW$271       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$8)
    1989                      .dwattr $C$DW$271, DW_AT_name("nNoise")
    1990                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_nNoise")
    1991                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    1992                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1993              $C$DW$272       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$12)
    1995                      .dwattr $C$DW$272, DW_AT_name("speech_power")
    1996                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_speech_power")
    1997                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    1998                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$273       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$12)
    2001                      .dwattr $C$DW$273, DW_AT_name("noise_power")
    2002                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_noise_power")
    2003                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    2004                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   43

    2005              $C$DW$274       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$12)
    2007                      .dwattr $C$DW$274, DW_AT_name("noise_power_sqr")
    2008                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_noise_power_sqr")
    2009                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    2010                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$275       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$8)
    2013                      .dwattr $C$DW$275, DW_AT_name("NSNR")
    2014                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_NSNR")
    2015                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    2016                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$276       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$46)
    2019                      .dwattr $C$DW$276, DW_AT_name("H0")
    2020                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_H0")
    2021                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    2022                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$277       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$46)
    2025                      .dwattr $C$DW$277, DW_AT_name("H1")
    2026                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_H1")
    2027                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    2028                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2029              $C$DW$278       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    2031                      .dwattr $C$DW$278, DW_AT_name("lgBeta")
    2032                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_lgBeta")
    2033                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    2034                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2035              $C$DW$279       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$47)
    2037                      .dwattr $C$DW$279, DW_AT_name("acc_dif2_beta")
    2038                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_acc_dif2_beta")
    2039                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    2040                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2041              $C$DW$280       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$8)
    2043                      .dwattr $C$DW$280, DW_AT_name("bCalced")
    2044                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_bCalced")
    2045                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    2046                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2047              $C$DW$281       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
    2049                      .dwattr $C$DW$281, DW_AT_name("sCH")
    2050                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_sCH")
    2051                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    2052                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2053              $C$DW$282       .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$47)
    2055                      .dwattr $C$DW$282, DW_AT_name("lAccum")
    2056                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_lAccum")
    2057                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    2058                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2059              $C$DW$283       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   44

    2060                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$8)
    2061                      .dwattr $C$DW$283, DW_AT_name("adp_th")
    2062                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_adp_th")
    2063                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    2064                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2065                      .dwendtag $C$DW$T$48
    2066              
    2067              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    2068                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$48)
    2069                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2070              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    2071                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    2072                      .dwattr $C$DW$T$89, DW_AT_address_class(0x17)
    2073              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2074                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    2075              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("Ptr")
    2076                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$3)
    2077                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    2078              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2079                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2080                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2081                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2082              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2083                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2084                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2085                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2086              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2087                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2088                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2089                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2090              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2091                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2092                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2093                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2094              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2095                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2096                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2097                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2098              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    2099                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$8)
    2100                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    2101              
    2102              $C$DW$T$39      .dwtag  DW_TAG_array_type
    2103                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
    2104                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2105                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    2106              $C$DW$284       .dwtag  DW_TAG_subrange_type
    2107                      .dwattr $C$DW$284, DW_AT_upper_bound(0x1d)
    2108                      .dwendtag $C$DW$T$39
    2109              
    2110              
    2111              $C$DW$T$45      .dwtag  DW_TAG_array_type
    2112                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$8)
    2113                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2114                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x514)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   45

    2115              $C$DW$285       .dwtag  DW_TAG_subrange_type
    2116                      .dwattr $C$DW$285, DW_AT_upper_bound(0x513)
    2117                      .dwendtag $C$DW$T$45
    2118              
    2119              
    2120              $C$DW$T$50      .dwtag  DW_TAG_array_type
    2121                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$8)
    2122                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2123                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x100)
    2124              $C$DW$286       .dwtag  DW_TAG_subrange_type
    2125                      .dwattr $C$DW$286, DW_AT_upper_bound(0xff)
    2126                      .dwendtag $C$DW$T$50
    2127              
    2128              
    2129              $C$DW$T$51      .dwtag  DW_TAG_array_type
    2130                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    2131                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2132                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    2133              $C$DW$287       .dwtag  DW_TAG_subrange_type
    2134                      .dwattr $C$DW$287, DW_AT_upper_bound(0x0f)
    2135                      .dwendtag $C$DW$T$51
    2136              
    2137              
    2138              $C$DW$T$52      .dwtag  DW_TAG_array_type
    2139                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    2140                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2141                      .dwattr $C$DW$T$52, DW_AT_byte_size(0xe0)
    2142              $C$DW$288       .dwtag  DW_TAG_subrange_type
    2143                      .dwattr $C$DW$288, DW_AT_upper_bound(0x0d)
    2144              $C$DW$289       .dwtag  DW_TAG_subrange_type
    2145                      .dwattr $C$DW$289, DW_AT_upper_bound(0x0f)
    2146                      .dwendtag $C$DW$T$52
    2147              
    2148              $C$DW$290       .dwtag  DW_TAG_TI_far_type
    2149                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$8)
    2150              $C$DW$T$53      .dwtag  DW_TAG_const_type
    2151                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$290)
    2152              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    2153                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2154                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    2155              
    2156              $C$DW$T$55      .dwtag  DW_TAG_array_type
    2157                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2158                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2159                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x20)
    2160              $C$DW$291       .dwtag  DW_TAG_subrange_type
    2161                      .dwattr $C$DW$291, DW_AT_upper_bound(0x0f)
    2162                      .dwendtag $C$DW$T$55
    2163              
    2164              
    2165              $C$DW$T$122     .dwtag  DW_TAG_array_type
    2166                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$53)
    2167                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    2168                      .dwattr $C$DW$T$122, DW_AT_byte_size(0x10)
    2169              $C$DW$292       .dwtag  DW_TAG_subrange_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   46

    2170                      .dwattr $C$DW$292, DW_AT_upper_bound(0x0f)
    2171                      .dwendtag $C$DW$T$122
    2172              
    2173              
    2174              $C$DW$T$59      .dwtag  DW_TAG_array_type
    2175                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$8)
    2176                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2177                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x80)
    2178              $C$DW$293       .dwtag  DW_TAG_subrange_type
    2179                      .dwattr $C$DW$293, DW_AT_upper_bound(0x7f)
    2180                      .dwendtag $C$DW$T$59
    2181              
    2182              
    2183              $C$DW$T$60      .dwtag  DW_TAG_array_type
    2184                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    2185                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2186                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x1a)
    2187              $C$DW$294       .dwtag  DW_TAG_subrange_type
    2188                      .dwattr $C$DW$294, DW_AT_upper_bound(0x19)
    2189                      .dwendtag $C$DW$T$60
    2190              
    2191              
    2192              $C$DW$T$78      .dwtag  DW_TAG_array_type
    2193                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$8)
    2194                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2195                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x20)
    2196              $C$DW$295       .dwtag  DW_TAG_subrange_type
    2197                      .dwattr $C$DW$295, DW_AT_upper_bound(0x1f)
    2198                      .dwendtag $C$DW$T$78
    2199              
    2200              
    2201              $C$DW$T$84      .dwtag  DW_TAG_array_type
    2202                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$8)
    2203                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2204                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x14)
    2205              $C$DW$296       .dwtag  DW_TAG_subrange_type
    2206                      .dwattr $C$DW$296, DW_AT_upper_bound(0x13)
    2207                      .dwendtag $C$DW$T$84
    2208              
    2209              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2210                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2211                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2212                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2213              
    2214              $C$DW$T$27      .dwtag  DW_TAG_array_type
    2215                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    2216                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2217                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2218              $C$DW$297       .dwtag  DW_TAG_subrange_type
    2219                      .dwattr $C$DW$297, DW_AT_upper_bound(0x00)
    2220                      .dwendtag $C$DW$T$27
    2221              
    2222              
    2223              $C$DW$T$33      .dwtag  DW_TAG_array_type
    2224                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   47

    2225                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2226                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2227              $C$DW$298       .dwtag  DW_TAG_subrange_type
    2228                      .dwattr $C$DW$298, DW_AT_upper_bound(0x01)
    2229                      .dwendtag $C$DW$T$33
    2230              
    2231              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2232                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    2233                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    2234              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    2235                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    2236                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2237              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    2238                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    2239                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    2240              
    2241              $C$DW$T$37      .dwtag  DW_TAG_array_type
    2242                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
    2243                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2244                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    2245              $C$DW$299       .dwtag  DW_TAG_subrange_type
    2246                      .dwattr $C$DW$299, DW_AT_upper_bound(0x13)
    2247                      .dwendtag $C$DW$T$37
    2248              
    2249              
    2250              $C$DW$T$85      .dwtag  DW_TAG_array_type
    2251                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
    2252                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2253                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    2254              $C$DW$300       .dwtag  DW_TAG_subrange_type
    2255                      .dwattr $C$DW$300, DW_AT_upper_bound(0x01)
    2256                      .dwendtag $C$DW$T$85
    2257              
    2258              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2259                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2260                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2261                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2262              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("Int")
    2263                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$10)
    2264                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    2265              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2266                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2267                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2268                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2269              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2270                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2271                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2272                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2273              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    2274                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
    2275                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    2276              
    2277              $C$DW$T$61      .dwtag  DW_TAG_array_type
    2278                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$12)
    2279                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   48

    2280                      .dwattr $C$DW$T$61, DW_AT_byte_size(0xd0)
    2281              $C$DW$301       .dwtag  DW_TAG_subrange_type
    2282                      .dwattr $C$DW$301, DW_AT_upper_bound(0x67)
    2283                      .dwendtag $C$DW$T$61
    2284              
    2285              
    2286              $C$DW$T$64      .dwtag  DW_TAG_array_type
    2287                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
    2288                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    2289                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x20)
    2290              $C$DW$302       .dwtag  DW_TAG_subrange_type
    2291                      .dwattr $C$DW$302, DW_AT_upper_bound(0x0f)
    2292                      .dwendtag $C$DW$T$64
    2293              
    2294              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2295                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2296                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2297                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2298              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
    2299                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$13)
    2300                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    2301              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    2302                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$13)
    2303                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    2304              $C$DW$T$14      .dwtag  DW_TAG_base_type
    2305                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2306                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    2307                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    2308                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    2309                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    2310              $C$DW$T$15      .dwtag  DW_TAG_base_type
    2311                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2312                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2313                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    2314                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    2315                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    2316              $C$DW$T$16      .dwtag  DW_TAG_base_type
    2317                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2318                      .dwattr $C$DW$T$16, DW_AT_name("float")
    2319                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    2320              $C$DW$T$17      .dwtag  DW_TAG_base_type
    2321                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2322                      .dwattr $C$DW$T$17, DW_AT_name("double")
    2323                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    2324              $C$DW$T$18      .dwtag  DW_TAG_base_type
    2325                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2326                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    2327                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    2328              $C$DW$T$73      .dwtag  DW_TAG_base_type
    2329                      .dwattr $C$DW$T$73, DW_AT_encoding(DW_ATE_signed_char)
    2330                      .dwattr $C$DW$T$73, DW_AT_name("signed char")
    2331                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    2332              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    2333                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2334                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   49

    2335              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    2336                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$74)
    2337                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    2338              
    2339              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2340                      .dwattr $C$DW$T$49, DW_AT_name("ele")
    2341                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x03)
    2342              $C$DW$303       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$9)
    2344                      .dwattr $C$DW$303, DW_AT_name("sym")
    2345                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_sym")
    2346                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2347                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2348              $C$DW$304       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$9)
    2350                      .dwattr $C$DW$304, DW_AT_name("idx_flag")
    2351                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_idx_flag")
    2352                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2353                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2354              $C$DW$305       .dwtag  DW_TAG_member
    2355                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$9)
    2356                      .dwattr $C$DW$305, DW_AT_name("next")
    2357                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_next")
    2358                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2359                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2360                      .dwendtag $C$DW$T$49
    2361              
    2362              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    2363                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$49)
    2364                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2365              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    2366                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2367                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    2368              
    2369              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    2370                      .dwattr $C$DW$T$90, DW_AT_name("gmhmm_type")
    2371                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x7fe)
    2372              $C$DW$306       .dwtag  DW_TAG_member
    2373                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    2374                      .dwattr $C$DW$306, DW_AT_name("avedepth")
    2375                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_avedepth")
    2376                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2378              $C$DW$307       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    2380                      .dwattr $C$DW$307, DW_AT_name("bestdepth")
    2381                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_bestdepth")
    2382                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2383                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2384              $C$DW$308       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    2386                      .dwattr $C$DW$308, DW_AT_name("index_mean")
    2387                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_index_mean")
    2388                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2389                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   50

    2390              $C$DW$309       .dwtag  DW_TAG_member
    2391                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    2392                      .dwattr $C$DW$309, DW_AT_name("signal_cnt")
    2393                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_signal_cnt")
    2394                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2395                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2396              $C$DW$310       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$8)
    2398                      .dwattr $C$DW$310, DW_AT_name("buf_idx")
    2399                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_buf_idx")
    2400                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2401                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2402              $C$DW$311       .dwtag  DW_TAG_member
    2403                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    2404                      .dwattr $C$DW$311, DW_AT_name("speech_detected")
    2405                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_speech_detected")
    2406                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2407                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2408              $C$DW$312       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    2410                      .dwattr $C$DW$312, DW_AT_name("mfcc_cnt")
    2411                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_mfcc_cnt")
    2412                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2413                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2414              $C$DW$313       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    2416                      .dwattr $C$DW$313, DW_AT_name("nbr_cpy")
    2417                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_nbr_cpy")
    2418                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2419                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2420              $C$DW$314       .dwtag  DW_TAG_member
    2421                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$8)
    2422                      .dwattr $C$DW$314, DW_AT_name("last_sig")
    2423                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_last_sig")
    2424                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2425                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2426              $C$DW$315       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$50)
    2428                      .dwattr $C$DW$315, DW_AT_name("sample_signal")
    2429                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_sample_signal")
    2430                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2431                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2432              $C$DW$316       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$8)
    2434                      .dwattr $C$DW$316, DW_AT_name("amplitude_max")
    2435                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_amplitude_max")
    2436                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    2437                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2438              $C$DW$317       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$8)
    2440                      .dwattr $C$DW$317, DW_AT_name("amplitude_min")
    2441                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_amplitude_min")
    2442                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    2443                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2444              $C$DW$318       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   51

    2445                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$8)
    2446                      .dwattr $C$DW$318, DW_AT_name("pred_first_frame")
    2447                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_pred_first_frame")
    2448                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    2449                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2450              $C$DW$319       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$8)
    2452                      .dwattr $C$DW$319, DW_AT_name("frm_cnt")
    2453                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_frm_cnt")
    2454                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    2455                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2456              $C$DW$320       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$8)
    2458                      .dwattr $C$DW$320, DW_AT_name("beam_count")
    2459                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_beam_count")
    2460                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    2461                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2462              $C$DW$321       .dwtag  DW_TAG_member
    2463                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$8)
    2464                      .dwattr $C$DW$321, DW_AT_name("active_beam_cells")
    2465                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_active_beam_cells")
    2466                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    2467                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2468              $C$DW$322       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$8)
    2470                      .dwattr $C$DW$322, DW_AT_name("active_time_cells")
    2471                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_active_time_cells")
    2472                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    2473                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2474              $C$DW$323       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$9)
    2476                      .dwattr $C$DW$323, DW_AT_name("ending_sym_count")
    2477                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_ending_sym_count")
    2478                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2479                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2480              $C$DW$324       .dwtag  DW_TAG_member
    2481                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$8)
    2482                      .dwattr $C$DW$324, DW_AT_name("comp_type")
    2483                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_comp_type")
    2484                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    2485                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2486              $C$DW$325       .dwtag  DW_TAG_member
    2487                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$9)
    2488                      .dwattr $C$DW$325, DW_AT_name("low_vol_limit")
    2489                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_low_vol_limit")
    2490                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    2491                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2492              $C$DW$326       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$9)
    2494                      .dwattr $C$DW$326, DW_AT_name("high_vol_limit")
    2495                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_high_vol_limit")
    2496                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
    2497                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2498              $C$DW$327       .dwtag  DW_TAG_member
    2499                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:06 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\0994410                         PAGE   52

    2500                      .dwattr $C$DW$327, DW_AT_name("vol")
    2501                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_vol")
    2502                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2503                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2504              $C$DW$328       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
    2506                      .dwattr $C$DW$328, DW_AT_name("n_mfcc")
    2507                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_n_mfcc")
    2508                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    2509                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2510              $C$DW$329       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$8)
    2512                      .dwattr $C$DW$329, DW_AT_name("nbr_dim")
    2513                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_nbr_dim")
    2514                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    2515                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2516              $C$DW$330       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    2518                      .dwattr $C$DW$330, DW_AT_name("n_filter")
    2519                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_n_filter")
    2520                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    2521                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2522              $C$DW$331       .dwtag  DW_TAG_member
    2523                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$52)
    2524                      .dwattr $C$DW$331, DW_AT_name("mfcc_buf")
    2525                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_mfcc_buf")
    2526                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2527                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2528              $C$DW$332       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$51)
    2530                      .dwattr $C$DW$332, DW_AT_name("mfcc_mean")
    2531                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_mfcc_mean")
    2532                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f8]
    2533                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2534              $C$DW$333       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$55)
    2536                      .dwattr $C$DW$333, DW_AT_name("cosxfm")
    2537                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_cosxfm")
    2538                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    2539                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2540              $C$DW$334       .dwtag  DW_TAG_member
