TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE    1

    2601              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:34:07 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     384              $C$DW$56        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureDimensionFail"), DW_AT_const_value(
     385              $C$DW$57        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSegmentSizeCheckFail"), DW_AT_const_value(
     386              $C$DW$58        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelFileFail"), DW_AT_const_value(0x1c4)
     387              $C$DW$59        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSaveFail"), DW_AT_const_value(0x1c5)
     388              $C$DW$60        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineEnrollLoadFail"), DW_AT_const_value(0x1c6)
     389              $C$DW$61        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackgoundCreationFail"), DW_AT_const_value
     390              $C$DW$62        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineStateMemoryOut"), DW_AT_const_value(0x1f4)
     391              $C$DW$63        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSearchMemoryOut"), DW_AT_const_value(0x1f5
     392              $C$DW$64        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelMemorySize"), DW_AT_const_value(0x258
     393              $C$DW$65        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineFeatureMemorySize"), DW_AT_const_value(0x2
     394              $C$DW$66        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineNetworkMemorySize"), DW_AT_const_value(0x2
     395              $C$DW$67        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineModelSize"), DW_AT_const_value(0x25b)
     396              $C$DW$68        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineBackTrackMemorySize"), DW_AT_const_value(0
     397              $C$DW$69        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineCMMemorySize"), DW_AT_const_value(0x25d)
     398              $C$DW$70        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineVALTreeMemorySize"), DW_AT_const_value(0x2
     399              $C$DW$71        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineSym2PosMapSize"), DW_AT_const_value(0x25f)
     400              $C$DW$72        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrEngineShortUtterance"), DW_AT_const_value(0x2bc)
     401              $C$DW$73        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadHMM2Phone"), DW_AT_const_value(0x320)
     402              $C$DW$74        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNoSilencePhone"), DW_AT_const_value(0x321)
     403              $C$DW$75        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhone2Voicing"), DW_AT_const_value(0x322)
     404              $C$DW$76        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSLoadPhoneDuration"), DW_AT_const_value(0x323)
     405              $C$DW$77        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMismatch"), DW_AT_const_value(0x324)
     406              $C$DW$78        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneMissWord"), DW_AT_const_value(0x325)
     407              $C$DW$79        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneDuration"), DW_AT_const_value(0x326)
     408              $C$DW$80        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneWord"), DW_AT_const_value(0x327)
     409              $C$DW$81        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveTTSMean"), DW_AT_const_value(0x328)
     410              $C$DW$82        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveVoicing"), DW_AT_const_value(0x329)
     411              $C$DW$83        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSSaveDuration"), DW_AT_const_value(0x32a)
     412              $C$DW$84        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSTTS"), DW_AT_const_value(0x32b)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   10

     413              $C$DW$85        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSPhoneList"), DW_AT_const_value(0x32c)
     414              $C$DW$86        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumPhones"), DW_AT_const_value(0x32d)
     415              $C$DW$87        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNumWords"), DW_AT_const_value(0x32e)
     416              $C$DW$88        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputFile"), DW_AT_const_value(0x32f)
     417              $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputMFCC"), DW_AT_const_value(0x330)
     418              $C$DW$90        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputDuration"), DW_AT_const_value(0x331)
     419              $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSInputVoicing"), DW_AT_const_value(0x332)
     420              $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSNotFound"), DW_AT_const_value(0x333)
     421              $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutputMeanSize"), DW_AT_const_value(0x334)
     422              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("eTIesrTTSOutput"), DW_AT_const_value(0x335)
     423                      .dwendtag $C$DW$T$91
     424              
     425              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TIesrEngineStatusType")
     426                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
     427                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
     428              
     429              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     430                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
     431              $C$DW$95        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$8)
     433                      .dwattr $C$DW$95, DW_AT_name("num")
     434                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_num")
     435                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     436                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     437              $C$DW$96        .dwtag  DW_TAG_member
     438                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$8)
     439                      .dwattr $C$DW$96, DW_AT_name("x1")
     440                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_x1")
     441                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     442                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     443              $C$DW$97        .dwtag  DW_TAG_member
     444                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$8)
     445                      .dwattr $C$DW$97, DW_AT_name("x2")
     446                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_x2")
     447                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     448                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     449                      .dwendtag $C$DW$T$19
     450              
     451              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
     452                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$19)
     453                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
     454              $C$DW$98        .dwtag  DW_TAG_TI_far_type
     455                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$56)
     456              $C$DW$T$57      .dwtag  DW_TAG_const_type
     457                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$98)
     458              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
     459                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
     460                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
     461              
     462              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     463                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     464              $C$DW$99        .dwtag  DW_TAG_member
     465                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
     466                      .dwattr $C$DW$99, DW_AT_name("max_mem_usage")
     467                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_max_mem_usage")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   11

     468                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     470              $C$DW$100       .dwtag  DW_TAG_member
     471                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
     472                      .dwattr $C$DW$100, DW_AT_name("n_terminals")
     473                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_n_terminals")
     474                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     475                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     476              $C$DW$101       .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
     478                      .dwattr $C$DW$101, DW_AT_name("n_monophones")
     479                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_n_monophones")
     480                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     481                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     482              $C$DW$102       .dwtag  DW_TAG_member
     483                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
     484                      .dwattr $C$DW$102, DW_AT_name("hlrTreeBase")
     485                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_hlrTreeBase")
     486                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     487                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     488              $C$DW$103       .dwtag  DW_TAG_member
     489                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$22)
     490                      .dwattr $C$DW$103, DW_AT_name("hlrTerminal")
     491                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_hlrTerminal")
     492                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     493                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     494              $C$DW$104       .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
     496                      .dwattr $C$DW$104, DW_AT_name("pHMM2phone")
     497                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_pHMM2phone")
     498                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     499                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     500              $C$DW$105       .dwtag  DW_TAG_member
     501                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$22)
     502                      .dwattr $C$DW$105, DW_AT_name("hlrTransformIndex")
     503                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_hlrTransformIndex")
     504                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     505                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     506              $C$DW$106       .dwtag  DW_TAG_member
     507                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
     508                      .dwattr $C$DW$106, DW_AT_name("hlr_TRANSFORM_SIZE")
     509                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
     510                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     511                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     512              $C$DW$107       .dwtag  DW_TAG_member
     513                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$21)
     514                      .dwattr $C$DW$107, DW_AT_name("hlrTransforms")
     515                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_hlrTransforms")
     516                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     517                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     518              $C$DW$108       .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
     520                      .dwattr $C$DW$108, DW_AT_name("pSegStat_dif1")
     521                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_pSegStat_dif1")
     522                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   12

     523                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     524              $C$DW$109       .dwtag  DW_TAG_member
     525                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
     526                      .dwattr $C$DW$109, DW_AT_name("pSegStat_dif2")
     527                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_pSegStat_dif2")
     528                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     529                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     530              $C$DW$110       .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
     532                      .dwattr $C$DW$110, DW_AT_name("pEnhanced")
     533                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_pEnhanced")
     534                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     535                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     536              $C$DW$111       .dwtag  DW_TAG_member
     537                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
     538                      .dwattr $C$DW$111, DW_AT_name("bk_node_cnt")
     539                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bk_node_cnt")
     540                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     541                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     542                      .dwendtag $C$DW$T$23
     543              
     544              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
     545                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$23)
     546                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     547              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
     548                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
     549                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
     550              
     551              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     552                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
     553              $C$DW$112       .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$9)
     555                      .dwattr $C$DW$112, DW_AT_name("sym_code")
     556                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_sym_code")
     557                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     558                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     559              $C$DW$113       .dwtag  DW_TAG_member
     560                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$9)
     561                      .dwattr $C$DW$113, DW_AT_name("start_cell")
     562                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_start_cell")
     563                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     564                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     565              $C$DW$114       .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$9)
     567                      .dwattr $C$DW$114, DW_AT_name("depth")
     568                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_depth")
     569                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     570                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     571                      .dwendtag $C$DW$T$24
     572              
     573              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
     574                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$24)
     575                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     576              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
     577                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   13

     578                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
     579              
     580              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     581                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
     582              $C$DW$115       .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$8)
     584                      .dwattr $C$DW$115, DW_AT_name("scr")
     585                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_scr")
     586                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     587                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     588              $C$DW$116       .dwtag  DW_TAG_member
     589                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$9)
     590                      .dwattr $C$DW$116, DW_AT_name("sym")
     591                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_sym")
     592                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     593                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     594              $C$DW$117       .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$9)
     596                      .dwattr $C$DW$117, DW_AT_name("frm")
     597                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_frm")
     598                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     599                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     600                      .dwendtag $C$DW$T$25
     601              
     602              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
     603                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$25)
     604                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     605              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
     606                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
     607                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
     608              
     609              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     610                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     611              $C$DW$118       .dwtag  DW_TAG_member
     612                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$9)
     613                      .dwattr $C$DW$118, DW_AT_name("frm")
     614                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_frm")
     615                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     617              $C$DW$119       .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$9)
     619                      .dwattr $C$DW$119, DW_AT_name("beam_idx")
     620                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_beam_idx")
     621                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     622                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     623                      .dwendtag $C$DW$T$26
     624              
     625              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
     626                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$26)
     627                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     628              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
     629                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
     630                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
     631              
     632              $C$DW$T$28      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   14

     633                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
     634              $C$DW$120       .dwtag  DW_TAG_member
     635                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$9)
     636                      .dwattr $C$DW$120, DW_AT_name("n_hmm")
     637                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_n_hmm")
     638                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     640              $C$DW$121       .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$9)
     642                      .dwattr $C$DW$121, DW_AT_name("n_sym")
     643                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_n_sym")
     644                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     645                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     646              $C$DW$122       .dwtag  DW_TAG_member
     647                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$9)
     648                      .dwattr $C$DW$122, DW_AT_name("n_word")
     649                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_n_word")
     650                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     651                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     652              $C$DW$123       .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$9)
     654                      .dwattr $C$DW$123, DW_AT_name("n_set")
     655                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_n_set")
     656                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     657                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     658              $C$DW$124       .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$9)
     660                      .dwattr $C$DW$124, DW_AT_name("n_hmm_set")
     661                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_n_hmm_set")
     662                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     663                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     664              $C$DW$125       .dwtag  DW_TAG_member
     665                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$9)
     666                      .dwattr $C$DW$125, DW_AT_name("start")
     667                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_start")
     668                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     669                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     670              $C$DW$126       .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$9)
     672                      .dwattr $C$DW$126, DW_AT_name("stop")
     673                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_stop")
     674                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     675                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     676              $C$DW$127       .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
     678                      .dwattr $C$DW$127, DW_AT_name("symlist")
     679                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_symlist")
     680                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     681                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     682                      .dwendtag $C$DW$T$28
     683              
     684              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
     685                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
     686                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
     687              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   15

     688                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
     689                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
     690              
     691              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     692                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     693              $C$DW$128       .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$9)
     695                      .dwattr $C$DW$128, DW_AT_name("high_pos")
     696                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_high_pos")
     697                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     698                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     699              $C$DW$129       .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$9)
     701                      .dwattr $C$DW$129, DW_AT_name("cur_pos")
     702                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_cur_pos")
     703                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     704                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
     705                      .dwendtag $C$DW$T$29
     706              
     707              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
     708                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     709                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     710              
     711              $C$DW$T$31      .dwtag  DW_TAG_array_type
     712                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     713                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     714                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
     715              $C$DW$130       .dwtag  DW_TAG_subrange_type
     716                      .dwattr $C$DW$130, DW_AT_upper_bound(0x01)
     717                      .dwendtag $C$DW$T$31
     718              
     719              
     720              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     721                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
     722              $C$DW$131       .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$30)
     724                      .dwattr $C$DW$131, DW_AT_name("state")
     725                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_state")
     726                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
     728              $C$DW$132       .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$31)
     730                      .dwattr $C$DW$132, DW_AT_name("sym")
     731                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_sym")
     732                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     733                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
     734              $C$DW$133       .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$30)
     736                      .dwattr $C$DW$133, DW_AT_name("beam")
     737                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_beam")
     738                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     739                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$134       .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$30)
     742                      .dwattr $C$DW$134, DW_AT_name("time")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   16

     743                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_time")
     744                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     745                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
     746                      .dwendtag $C$DW$T$32
     747              
     748              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
     749                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$32)
     750                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     751              
     752              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     753                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
     754              $C$DW$135       .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$33)
     756                      .dwattr $C$DW$135, DW_AT_name("cur_sym")
     757                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_cur_sym")
     758                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     759                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
     760              $C$DW$136       .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$9)
     762                      .dwattr $C$DW$136, DW_AT_name("cur_state")
     763                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_cur_state")
     764                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     765                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
     766                      .dwendtag $C$DW$T$34
     767              
     768              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
     769                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
     770                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     771              
     772              $C$DW$T$81      .dwtag  DW_TAG_array_type
     773                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
     774                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
     775                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x06)
     776              $C$DW$137       .dwtag  DW_TAG_subrange_type
     777                      .dwattr $C$DW$137, DW_AT_upper_bound(0x01)
     778                      .dwendtag $C$DW$T$81
     779              
     780              
     781              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     782                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
     783              $C$DW$138       .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$9)
     785                      .dwattr $C$DW$138, DW_AT_name("max_nbr_syms")
     786                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_max_nbr_syms")
     787                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
     789              $C$DW$139       .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$8)
     791                      .dwattr $C$DW$139, DW_AT_name("nbr_syms")
     792                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_nbr_syms")
     793                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     794                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
     795              $C$DW$140       .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
     797                      .dwattr $C$DW$140, DW_AT_name("sym2pos")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   17

     798                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_sym2pos")
     799                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     800                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
     801              $C$DW$141       .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$35)
     803                      .dwattr $C$DW$141, DW_AT_name("syms")
     804                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_syms")
     805                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     806                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
     807                      .dwendtag $C$DW$T$36
     808              
     809              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
     810                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
     811                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
     812              
     813              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     814                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
     815              $C$DW$142       .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$8)
     817                      .dwattr $C$DW$142, DW_AT_name("scr")
     818                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_scr")
     819                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     820                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
     821              $C$DW$143       .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$8)
     823                      .dwattr $C$DW$143, DW_AT_name("n_ans")
     824                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_n_ans")
     825                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     826                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
     827              $C$DW$144       .dwtag  DW_TAG_member
     828                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$37)
     829                      .dwattr $C$DW$144, DW_AT_name("answers")
     830                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_answers")
     831                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     832                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
     833                      .dwendtag $C$DW$T$38
     834              
     835              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
     836                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
     837                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     838              
     839              $C$DW$T$41      .dwtag  DW_TAG_array_type
     840                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
     841                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     842                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
     843              $C$DW$145       .dwtag  DW_TAG_subrange_type
     844                      .dwattr $C$DW$145, DW_AT_upper_bound(0x1d)
     845                      .dwendtag $C$DW$T$41
     846              
     847              
     848              $C$DW$T$42      .dwtag  DW_TAG_structure_type
     849                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
     850              $C$DW$146       .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$8)
     852                      .dwattr $C$DW$146, DW_AT_name("n_bests")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   18

     853                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_n_bests")
     854                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     855                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
     856              $C$DW$147       .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$39)
     858                      .dwattr $C$DW$147, DW_AT_name("best_idx")
     859                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_best_idx")
     860                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     861                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
     862              $C$DW$148       .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$41)
     864                      .dwattr $C$DW$148, DW_AT_name("elem")
     865                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_elem")
     866                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     867                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
     868                      .dwendtag $C$DW$T$42
     869              
     870              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
     871                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
     872                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
     873              
     874              $C$DW$T$43      .dwtag  DW_TAG_structure_type
     875                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
     876              $C$DW$149       .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
     878                      .dwattr $C$DW$149, DW_AT_name("alpha_p")
     879                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_alpha_p")
     880                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
     882              $C$DW$150       .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
     884                      .dwattr $C$DW$150, DW_AT_name("sAlpha")
     885                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_sAlpha")
     886                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     887                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
     888              $C$DW$151       .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$8)
     890                      .dwattr $C$DW$151, DW_AT_name("sBeta")
     891                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_sBeta")
     892                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     893                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
     894              $C$DW$152       .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$8)
     896                      .dwattr $C$DW$152, DW_AT_name("lambdaLTEhigherE")
     897                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
     898                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     899                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
     900              $C$DW$153       .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$8)
     902                      .dwattr $C$DW$153, DW_AT_name("frm_count")
     903                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_frm_count")
     904                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     905                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
     906              $C$DW$154       .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   19

     908                      .dwattr $C$DW$154, DW_AT_name("prob_sp")
     909                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_prob_sp")
     910                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     911                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
     912              $C$DW$155       .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
     914                      .dwattr $C$DW$155, DW_AT_name("s_noise_floor")
     915                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_s_noise_floor")
     916                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     917                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
     918              $C$DW$156       .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
     920                      .dwattr $C$DW$156, DW_AT_name("snr")
     921                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_snr")
     922                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     923                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
     924              $C$DW$157       .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
     926                      .dwattr $C$DW$157, DW_AT_name("ps_long_term_noise")
     927                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ps_long_term_noise")
     928                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     929                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
     930              $C$DW$158       .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$8)
     932                      .dwattr $C$DW$158, DW_AT_name("frmEn")
     933                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_frmEn")
     934                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     935                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
     936              $C$DW$159       .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$8)
     938                      .dwattr $C$DW$159, DW_AT_name("meanEn")
     939                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_meanEn")
     940                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     941                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$160       .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$8)
     944                      .dwattr $C$DW$160, DW_AT_name("prevMeanEn")
     945                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_prevMeanEn")
     946                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     947                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
     948              $C$DW$161       .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$8)
     950                      .dwattr $C$DW$161, DW_AT_name("noiselvl")
     951                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_noiselvl")
     952                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     953                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
     954              $C$DW$162       .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$8)
     956                      .dwattr $C$DW$162, DW_AT_name("lambdaLTE")
     957                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_lambdaLTE")
     958                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     959                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
     960              $C$DW$163       .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$8)
     962                      .dwattr $C$DW$163, DW_AT_name("nbSpeechFrame")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   20

     963                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_nbSpeechFrame")
     964                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     965                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
     966              $C$DW$164       .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$8)
     968                      .dwattr $C$DW$164, DW_AT_name("hangOver")
     969                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_hangOver")
     970                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     971                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
     972                      .dwendtag $C$DW$T$43
     973              
     974              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
     975                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$43)
     976                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
     977              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
     978                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
     979                      .dwattr $C$DW$T$87, DW_AT_address_class(0x17)
     980              
     981              $C$DW$T$44      .dwtag  DW_TAG_structure_type
     982                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
     983              $C$DW$165       .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$8)
     985                      .dwattr $C$DW$165, DW_AT_name("mean")
     986                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_mean")
     987                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$166       .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$8)
     991                      .dwattr $C$DW$166, DW_AT_name("inv")
     992                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_inv")
     993                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     994                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
     995              $C$DW$167       .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$8)
     997                      .dwattr $C$DW$167, DW_AT_name("gconst")
     998                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_gconst")
     999                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1000                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1001                      .dwendtag $C$DW$T$44
    1002              
    1003              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    1004                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    1005                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1006              
    1007              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1008                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
    1009              $C$DW$168       .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$45)
    1011                      .dwattr $C$DW$168, DW_AT_name("base_mem")
    1012                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_base_mem")
    1013                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$169       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1017                      .dwattr $C$DW$169, DW_AT_name("mem_count")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   21

    1018                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_mem_count")
    1019                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    1020                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$170       .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    1023                      .dwattr $C$DW$170, DW_AT_name("answers")
    1024                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_answers")
    1025                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    1026                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$171       .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    1029                      .dwattr $C$DW$171, DW_AT_name("uStp")
    1030                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_uStp")
    1031                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    1032                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$172       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1035                      .dwattr $C$DW$172, DW_AT_name("nWords")
    1036                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_nWords")
    1037                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    1038                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$173       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$8)
    1041                      .dwattr $C$DW$173, DW_AT_name("nS")
    1042                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_nS")
    1043                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    1044                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$174       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    1047                      .dwattr $C$DW$174, DW_AT_name("cm_scr")
    1048                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_cm_scr")
    1049                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    1050                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$175       .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$8)
    1053                      .dwattr $C$DW$175, DW_AT_name("bNeedUpdate")
    1054                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_bNeedUpdate")
    1055                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    1056                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$176       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    1059                      .dwattr $C$DW$176, DW_AT_name("cm_anti_scr")
    1060                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_cm_anti_scr")
    1061                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    1062                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1063              $C$DW$177       .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$12)
    1065                      .dwattr $C$DW$177, DW_AT_name("cm_fg_scr")
    1066                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_cm_fg_scr")
    1067                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    1068                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1069              $C$DW$178       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$12)
    1071                      .dwattr $C$DW$178, DW_AT_name("cm_bk_scr")
    1072                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_cm_bk_scr")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   22

    1073                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    1074                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1075              $C$DW$179       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$8)
    1077                      .dwattr $C$DW$179, DW_AT_name("th_nbest")
    1078                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_th_nbest")
    1079                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    1080                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1081              $C$DW$180       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$8)
    1083                      .dwattr $C$DW$180, DW_AT_name("nSpeech")
    1084                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_nSpeech")
    1085                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    1086                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1087              $C$DW$181       .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$8)
    1089                      .dwattr $C$DW$181, DW_AT_name("nNoise")
    1090                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_nNoise")
    1091                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    1092                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1093              $C$DW$182       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$12)
    1095                      .dwattr $C$DW$182, DW_AT_name("speech_power")
    1096                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_speech_power")
    1097                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    1098                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$183       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$12)
    1101                      .dwattr $C$DW$183, DW_AT_name("noise_power")
    1102                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_noise_power")
    1103                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    1104                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$184       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$12)
    1107                      .dwattr $C$DW$184, DW_AT_name("noise_power_sqr")
    1108                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_noise_power_sqr")
    1109                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    1110                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$185       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$8)
    1113                      .dwattr $C$DW$185, DW_AT_name("NSNR")
    1114                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_NSNR")
    1115                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    1116                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$186       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$46)
    1119                      .dwattr $C$DW$186, DW_AT_name("H0")
    1120                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_H0")
    1121                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    1122                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$187       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$46)
    1125                      .dwattr $C$DW$187, DW_AT_name("H1")
    1126                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_H1")
    1127                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   23

    1128                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1129              $C$DW$188       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
    1131                      .dwattr $C$DW$188, DW_AT_name("lgBeta")
    1132                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_lgBeta")
    1133                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    1134                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$189       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$47)
    1137                      .dwattr $C$DW$189, DW_AT_name("acc_dif2_beta")
    1138                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_acc_dif2_beta")
    1139                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    1140                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$190       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$8)
    1143                      .dwattr $C$DW$190, DW_AT_name("bCalced")
    1144                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bCalced")
    1145                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    1146                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1147              $C$DW$191       .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$21)
    1149                      .dwattr $C$DW$191, DW_AT_name("sCH")
    1150                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_sCH")
    1151                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    1152                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1153              $C$DW$192       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$47)
    1155                      .dwattr $C$DW$192, DW_AT_name("lAccum")
    1156                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_lAccum")
    1157                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    1158                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1159              $C$DW$193       .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$8)
    1161                      .dwattr $C$DW$193, DW_AT_name("adp_th")
    1162                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_adp_th")
    1163                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    1164                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1165                      .dwendtag $C$DW$T$48
    1166              
    1167              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    1168                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$48)
    1169                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1170              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    1171                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1172                      .dwattr $C$DW$T$89, DW_AT_address_class(0x17)
    1173              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1174                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1175                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1176                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1177              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1178                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1179                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1180                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1181              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1182                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   24

    1183                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1184                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1185              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1186                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1187                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1188                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1189              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1190                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1191                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1192                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1193              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    1194                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$8)
    1195                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    1196              
    1197              $C$DW$T$39      .dwtag  DW_TAG_array_type
    1198                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
    1199                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1200                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    1201              $C$DW$194       .dwtag  DW_TAG_subrange_type
    1202                      .dwattr $C$DW$194, DW_AT_upper_bound(0x1d)
    1203                      .dwendtag $C$DW$T$39
    1204              
    1205              
    1206              $C$DW$T$45      .dwtag  DW_TAG_array_type
    1207                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$8)
    1208                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1209                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x514)
    1210              $C$DW$195       .dwtag  DW_TAG_subrange_type
    1211                      .dwattr $C$DW$195, DW_AT_upper_bound(0x513)
    1212                      .dwendtag $C$DW$T$45
    1213              
    1214              
    1215              $C$DW$T$50      .dwtag  DW_TAG_array_type
    1216                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$8)
    1217                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1218                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x100)
    1219              $C$DW$196       .dwtag  DW_TAG_subrange_type
    1220                      .dwattr $C$DW$196, DW_AT_upper_bound(0xff)
    1221                      .dwendtag $C$DW$T$50
    1222              
    1223              
    1224              $C$DW$T$51      .dwtag  DW_TAG_array_type
    1225                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    1226                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1227                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    1228              $C$DW$197       .dwtag  DW_TAG_subrange_type
    1229                      .dwattr $C$DW$197, DW_AT_upper_bound(0x0f)
    1230                      .dwendtag $C$DW$T$51
    1231              
    1232              
    1233              $C$DW$T$52      .dwtag  DW_TAG_array_type
    1234                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    1235                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1236                      .dwattr $C$DW$T$52, DW_AT_byte_size(0xe0)
    1237              $C$DW$198       .dwtag  DW_TAG_subrange_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   25

    1238                      .dwattr $C$DW$198, DW_AT_upper_bound(0x0d)
    1239              $C$DW$199       .dwtag  DW_TAG_subrange_type
    1240                      .dwattr $C$DW$199, DW_AT_upper_bound(0x0f)
    1241                      .dwendtag $C$DW$T$52
    1242              
    1243              $C$DW$200       .dwtag  DW_TAG_TI_far_type
    1244                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$8)
    1245              $C$DW$T$53      .dwtag  DW_TAG_const_type
    1246                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$200)
    1247              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    1248                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1249                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    1250              
    1251              $C$DW$T$55      .dwtag  DW_TAG_array_type
    1252                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1253                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1254                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x20)
    1255              $C$DW$201       .dwtag  DW_TAG_subrange_type
    1256                      .dwattr $C$DW$201, DW_AT_upper_bound(0x0f)
    1257                      .dwendtag $C$DW$T$55
    1258              
    1259              
    1260              $C$DW$T$59      .dwtag  DW_TAG_array_type
    1261                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$8)
    1262                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1263                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x80)
    1264              $C$DW$202       .dwtag  DW_TAG_subrange_type
    1265                      .dwattr $C$DW$202, DW_AT_upper_bound(0x7f)
    1266                      .dwendtag $C$DW$T$59
    1267              
    1268              
    1269              $C$DW$T$60      .dwtag  DW_TAG_array_type
    1270                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    1271                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1272                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x1a)
    1273              $C$DW$203       .dwtag  DW_TAG_subrange_type
    1274                      .dwattr $C$DW$203, DW_AT_upper_bound(0x19)
    1275                      .dwendtag $C$DW$T$60
    1276              
    1277              
    1278              $C$DW$T$78      .dwtag  DW_TAG_array_type
    1279                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$8)
    1280                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1281                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x20)
    1282              $C$DW$204       .dwtag  DW_TAG_subrange_type
    1283                      .dwattr $C$DW$204, DW_AT_upper_bound(0x1f)
    1284                      .dwendtag $C$DW$T$78
    1285              
    1286              
    1287              $C$DW$T$84      .dwtag  DW_TAG_array_type
    1288                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$8)
    1289                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1290                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x14)
    1291              $C$DW$205       .dwtag  DW_TAG_subrange_type
    1292                      .dwattr $C$DW$205, DW_AT_upper_bound(0x13)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   26

    1293                      .dwendtag $C$DW$T$84
    1294              
    1295              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1296                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1297                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1298                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1299              
    1300              $C$DW$T$27      .dwtag  DW_TAG_array_type
    1301                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    1302                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1303                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1304              $C$DW$206       .dwtag  DW_TAG_subrange_type
    1305                      .dwattr $C$DW$206, DW_AT_upper_bound(0x00)
    1306                      .dwendtag $C$DW$T$27
    1307              
    1308              
    1309              $C$DW$T$33      .dwtag  DW_TAG_array_type
    1310                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    1311                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1312                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1313              $C$DW$207       .dwtag  DW_TAG_subrange_type
    1314                      .dwattr $C$DW$207, DW_AT_upper_bound(0x01)
    1315                      .dwendtag $C$DW$T$33
    1316              
    1317              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1318                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    1319                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1320              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    1321                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    1322                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1323              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    1324                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    1325                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    1326              
    1327              $C$DW$T$37      .dwtag  DW_TAG_array_type
    1328                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
    1329                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1330                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    1331              $C$DW$208       .dwtag  DW_TAG_subrange_type
    1332                      .dwattr $C$DW$208, DW_AT_upper_bound(0x13)
    1333                      .dwendtag $C$DW$T$37
    1334              
    1335              
    1336              $C$DW$T$85      .dwtag  DW_TAG_array_type
    1337                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
    1338                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1339                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    1340              $C$DW$209       .dwtag  DW_TAG_subrange_type
    1341                      .dwattr $C$DW$209, DW_AT_upper_bound(0x01)
    1342                      .dwendtag $C$DW$T$85
    1343              
    1344              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1345                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1346                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1347                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   27

    1348              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1349                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1350                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1351                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1352              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1353                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1354                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1355                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1356              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1357                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
    1358                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    1359              
    1360              $C$DW$T$61      .dwtag  DW_TAG_array_type
    1361                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$12)
    1362                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1363                      .dwattr $C$DW$T$61, DW_AT_byte_size(0xd0)
    1364              $C$DW$210       .dwtag  DW_TAG_subrange_type
    1365                      .dwattr $C$DW$210, DW_AT_upper_bound(0x67)
    1366                      .dwendtag $C$DW$T$61
    1367              
    1368              
    1369              $C$DW$T$64      .dwtag  DW_TAG_array_type
    1370                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
    1371                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1372                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x20)
    1373              $C$DW$211       .dwtag  DW_TAG_subrange_type
    1374                      .dwattr $C$DW$211, DW_AT_upper_bound(0x0f)
    1375                      .dwendtag $C$DW$T$64
    1376              
    1377              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1378                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1379                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1380                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1381              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1382                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1383                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1384                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1385                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1386                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1387              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1388                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1389                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1390                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1391                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1392                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1393              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1394                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1395                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1396                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1397              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1398                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1399                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1400                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1401              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1402                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   28

    1403                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1404                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1405              $C$DW$T$73      .dwtag  DW_TAG_base_type
    1406                      .dwattr $C$DW$T$73, DW_AT_encoding(DW_ATE_signed_char)
    1407                      .dwattr $C$DW$T$73, DW_AT_name("signed char")
    1408                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    1409              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    1410                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1411                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    1412              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    1413                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$74)
    1414                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    1415              
    1416              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1417                      .dwattr $C$DW$T$49, DW_AT_name("ele")
    1418                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x03)
    1419              $C$DW$212       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$9)
    1421                      .dwattr $C$DW$212, DW_AT_name("sym")
    1422                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_sym")
    1423                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1425              $C$DW$213       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$9)
    1427                      .dwattr $C$DW$213, DW_AT_name("idx_flag")
    1428                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_idx_flag")
    1429                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1430                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1431              $C$DW$214       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$9)
    1433                      .dwattr $C$DW$214, DW_AT_name("next")
    1434                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_next")
    1435                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1436                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1437                      .dwendtag $C$DW$T$49
    1438              
    1439              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    1440                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$49)
    1441                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1442              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    1443                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    1444                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    1445              
    1446              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    1447                      .dwattr $C$DW$T$90, DW_AT_name("gmhmm_type")
    1448                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x7fe)
    1449              $C$DW$215       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    1451                      .dwattr $C$DW$215, DW_AT_name("avedepth")
    1452                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_avedepth")
    1453                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1455              $C$DW$216       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    1457                      .dwattr $C$DW$216, DW_AT_name("bestdepth")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   29

    1458                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_bestdepth")
    1459                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1460                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1461              $C$DW$217       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    1463                      .dwattr $C$DW$217, DW_AT_name("index_mean")
    1464                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_index_mean")
    1465                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1466                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1467              $C$DW$218       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    1469                      .dwattr $C$DW$218, DW_AT_name("signal_cnt")
    1470                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_signal_cnt")
    1471                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1472                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1473              $C$DW$219       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$8)
    1475                      .dwattr $C$DW$219, DW_AT_name("buf_idx")
    1476                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_buf_idx")
    1477                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1478                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1479              $C$DW$220       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    1481                      .dwattr $C$DW$220, DW_AT_name("speech_detected")
    1482                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_speech_detected")
    1483                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1484                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1485              $C$DW$221       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    1487                      .dwattr $C$DW$221, DW_AT_name("mfcc_cnt")
    1488                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_mfcc_cnt")
    1489                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1490                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$222       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    1493                      .dwattr $C$DW$222, DW_AT_name("nbr_cpy")
    1494                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_nbr_cpy")
    1495                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1496                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$223       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$8)
    1499                      .dwattr $C$DW$223, DW_AT_name("last_sig")
    1500                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_last_sig")
    1501                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1502                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$224       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$50)
    1505                      .dwattr $C$DW$224, DW_AT_name("sample_signal")
    1506                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_sample_signal")
    1507                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1508                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$225       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$8)
    1511                      .dwattr $C$DW$225, DW_AT_name("amplitude_max")
    1512                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_amplitude_max")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   30

    1513                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    1514                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1515              $C$DW$226       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$8)
    1517                      .dwattr $C$DW$226, DW_AT_name("amplitude_min")
    1518                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_amplitude_min")
    1519                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    1520                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$227       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$8)
    1523                      .dwattr $C$DW$227, DW_AT_name("pred_first_frame")
    1524                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_pred_first_frame")
    1525                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    1526                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1527              $C$DW$228       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$8)
    1529                      .dwattr $C$DW$228, DW_AT_name("frm_cnt")
    1530                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_frm_cnt")
    1531                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    1532                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1533              $C$DW$229       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$8)
    1535                      .dwattr $C$DW$229, DW_AT_name("beam_count")
    1536                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_beam_count")
    1537                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    1538                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$230       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$8)
    1541                      .dwattr $C$DW$230, DW_AT_name("active_beam_cells")
    1542                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_active_beam_cells")
    1543                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    1544                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$231       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$8)
    1547                      .dwattr $C$DW$231, DW_AT_name("active_time_cells")
    1548                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_active_time_cells")
    1549                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    1550                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1551              $C$DW$232       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$9)
    1553                      .dwattr $C$DW$232, DW_AT_name("ending_sym_count")
    1554                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_ending_sym_count")
    1555                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1556                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1557              $C$DW$233       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$8)
    1559                      .dwattr $C$DW$233, DW_AT_name("comp_type")
    1560                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_comp_type")
    1561                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    1562                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1563              $C$DW$234       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$9)
    1565                      .dwattr $C$DW$234, DW_AT_name("low_vol_limit")
    1566                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_low_vol_limit")
    1567                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   31

    1568                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1569              $C$DW$235       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$9)
    1571                      .dwattr $C$DW$235, DW_AT_name("high_vol_limit")
    1572                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_high_vol_limit")
    1573                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
    1574                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1575              $C$DW$236       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$8)
    1577                      .dwattr $C$DW$236, DW_AT_name("vol")
    1578                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_vol")
    1579                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1580                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1581              $C$DW$237       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    1583                      .dwattr $C$DW$237, DW_AT_name("n_mfcc")
    1584                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_n_mfcc")
    1585                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    1586                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$238       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$8)
    1589                      .dwattr $C$DW$238, DW_AT_name("nbr_dim")
    1590                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_nbr_dim")
    1591                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    1592                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1593              $C$DW$239       .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    1595                      .dwattr $C$DW$239, DW_AT_name("n_filter")
    1596                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_n_filter")
    1597                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    1598                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1599              $C$DW$240       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$52)
    1601                      .dwattr $C$DW$240, DW_AT_name("mfcc_buf")
    1602                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_mfcc_buf")
    1603                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    1604                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1605              $C$DW$241       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$51)
    1607                      .dwattr $C$DW$241, DW_AT_name("mfcc_mean")
    1608                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_mfcc_mean")
    1609                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f8]
    1610                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1611              $C$DW$242       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$55)
    1613                      .dwattr $C$DW$242, DW_AT_name("cosxfm")
    1614                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_cosxfm")
    1615                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    1616                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1617              $C$DW$243       .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$58)
    1619                      .dwattr $C$DW$243, DW_AT_name("mel_filter")
    1620                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_mel_filter")
    1621                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
    1622                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:08 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\1594410                         PAGE   32

    1623              $C$DW$244       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$8)
    1625                      .dwattr $C$DW$244, DW_AT_name("th_noise_flr")
    1626                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_th_noise_flr")
    1627                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x22a]
    1628                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$245       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$8)
    1631                      .dwattr $C$DW$245, DW_AT_name("th_speech_delta")
    1632                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_th_speech_delta")
    1633                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x22b]
    1634                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1635              $C$DW$246       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$8)
    1637                      .dwattr $C$DW$246, DW_AT_name("th_min_speech_db")
    1638                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_th_min_speech_db")
