TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE    1

    3971              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:34:09 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         000225 0103 
         000227 34   
    1694 000228 4A05          B $C$L44  ; |456| 
    1695                                                      ; branch occurs ; |456| 
    1696 00022a       $C$L43:    
    1697                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    1698 00022a E66D          MOV #0, *AR3(#820) ; |458| 
         00022c 0003 
         00022e 34   
    1699 00022f       $C$L44:    
    1700                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    1701 00022f A406          MOV *SP(#3), T0 ; |461| 
    1702 000231 ED0C          MOV dbl(*SP(#6)), XAR0
         000233 8F   
    1703              $C$DW$127       .dwtag  DW_TAG_TI_branch
    1704                      .dwattr $C$DW$127, DW_AT_low_pc(0x00)
    1705                      .dwattr $C$DW$127, DW_AT_name("_uttdet_state_machine")
    1706                      .dwattr $C$DW$127, DW_AT_TI_call
    1707 000234 6C00          CALL #_uttdet_state_machine ; |461| 
         000236 0000+
    1708                                                      ; call occurs [#_uttdet_state_machine] ; |461| 
    1709                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
    1710 000238 F79A          ADD #276, mmap(SP)
         00023a 0114 
         00023c 98   
    1711                      .dwcfi  cfa_offset, 2
    1712 00023d 50E4          POPBOTH XFP
    1713                      .dwcfi  restore_reg, 32
    1714                      .dwcfi  cfa_offset, 1
    1715              $C$DW$128       .dwtag  DW_TAG_TI_branch
    1716                      .dwattr $C$DW$128, DW_AT_low_pc(0x00)
    1717                      .dwattr $C$DW$128, DW_AT_TI_return
    1718 00023f 4804          RET
    1719                                                      ; return occurs
    1720              
    1721              $C$DW$129       .dwtag  DW_TAG_TI_loop
    1722                      .dwattr $C$DW$129, DW_AT_name("C:\\Users\\a0221074\\AppData\\Local\\Temp\\2226410:$C$L38:1:1505334849
    1723                      .dwattr $C$DW$129, DW_AT_TI_begin_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/
    1724                      .dwattr $C$DW$129, DW_AT_TI_begin_line(0x1a6)
    1725                      .dwattr $C$DW$129, DW_AT_TI_end_line(0x1aa)
    1726              $C$DW$130       .dwtag  DW_TAG_TI_loop_range
    1727                      .dwattr $C$DW$130, DW_AT_low_pc($C$DW$L$_compute_uttdet$4$B)
    1728                      .dwattr $C$DW$130, DW_AT_high_pc($C$DW$L$_compute_uttdet$4$E)
    1729              $C$DW$131       .dwtag  DW_TAG_TI_loop_range
    1730                      .dwattr $C$DW$131, DW_AT_low_pc($C$DW$L$_compute_uttdet$5$B)
    1731                      .dwattr $C$DW$131, DW_AT_high_pc($C$DW$L$_compute_uttdet$5$E)
    1732              $C$DW$132       .dwtag  DW_TAG_TI_loop_range
    1733                      .dwattr $C$DW$132, DW_AT_low_pc($C$DW$L$_compute_uttdet$6$B)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   40

    1734                      .dwattr $C$DW$132, DW_AT_high_pc($C$DW$L$_compute_uttdet$6$E)
    1735                      .dwendtag $C$DW$129
    1736              
    1737              
    1738              $C$DW$133       .dwtag  DW_TAG_TI_loop
    1739                      .dwattr $C$DW$133, DW_AT_name("C:\\Users\\a0221074\\AppData\\Local\\Temp\\2226410:$C$L36:1:1505334849
    1740                      .dwattr $C$DW$133, DW_AT_TI_begin_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/
    1741                      .dwattr $C$DW$133, DW_AT_TI_begin_line(0x19b)
    1742                      .dwattr $C$DW$133, DW_AT_TI_end_line(0x19b)
    1743              $C$DW$134       .dwtag  DW_TAG_TI_loop_range
    1744                      .dwattr $C$DW$134, DW_AT_low_pc($C$DW$L$_compute_uttdet$2$B)
    1745                      .dwattr $C$DW$134, DW_AT_high_pc($C$DW$L$_compute_uttdet$2$E)
    1746                      .dwendtag $C$DW$133
    1747              
    1748                      .dwattr $C$DW$98, DW_AT_TI_end_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL
    1749                      .dwattr $C$DW$98, DW_AT_TI_end_line(0x1d7)
    1750                      .dwattr $C$DW$98, DW_AT_TI_end_column(0x01)
    1751                      .dwendentry
    1752                      .dwendtag $C$DW$98
    1753              
    1754              ;******************************************************************************
    1755              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    1756              ;******************************************************************************
    1757                      .global _fft
    1758                      .global _init_spect_sub
    1759                      .global _noise_subs
    1760                      .global _log_polyfit
    1761              
    1762              ;*******************************************************************************
    1763              ;* TYPE INFORMATION                                                            *
    1764              ;*******************************************************************************
    1765              
    1766              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1767                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
    1768              $C$DW$135       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$8)
    1770                      .dwattr $C$DW$135, DW_AT_name("num")
    1771                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_num")
    1772                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1774              $C$DW$136       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$8)
    1776                      .dwattr $C$DW$136, DW_AT_name("x1")
    1777                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_x1")
    1778                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1779                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1780              $C$DW$137       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$8)
    1782                      .dwattr $C$DW$137, DW_AT_name("x2")
    1783                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_x2")
    1784                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1785                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1786                      .dwendtag $C$DW$T$19
    1787              
    1788              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   41

    1789                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1791              $C$DW$138       .dwtag  DW_TAG_TI_far_type
    1792                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$57)
    1793              $C$DW$T$58      .dwtag  DW_TAG_const_type
    1794                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$138)
    1795              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1796                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1797                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    1798              
    1799              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1800                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    1801              $C$DW$139       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1803                      .dwattr $C$DW$139, DW_AT_name("max_mem_usage")
    1804                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_max_mem_usage")
    1805                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1806                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$140       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1809                      .dwattr $C$DW$140, DW_AT_name("n_terminals")
    1810                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_n_terminals")
    1811                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1812                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$141       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1815                      .dwattr $C$DW$141, DW_AT_name("n_monophones")
    1816                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_n_monophones")
    1817                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1818                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$142       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    1821                      .dwattr $C$DW$142, DW_AT_name("hlrTreeBase")
    1822                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_hlrTreeBase")
    1823                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1824                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$143       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$22)
    1827                      .dwattr $C$DW$143, DW_AT_name("hlrTerminal")
    1828                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_hlrTerminal")
    1829                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1830                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$144       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$21)
    1833                      .dwattr $C$DW$144, DW_AT_name("pHMM2phone")
    1834                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_pHMM2phone")
    1835                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1836                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$145       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    1839                      .dwattr $C$DW$145, DW_AT_name("hlrTransformIndex")
    1840                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_hlrTransformIndex")
    1841                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1842                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$146       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   42

    1844                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1845                      .dwattr $C$DW$146, DW_AT_name("hlr_TRANSFORM_SIZE")
    1846                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
    1847                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1848                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$147       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    1851                      .dwattr $C$DW$147, DW_AT_name("hlrTransforms")
    1852                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_hlrTransforms")
    1853                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1854                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$148       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$21)
    1857                      .dwattr $C$DW$148, DW_AT_name("pSegStat_dif1")
    1858                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_pSegStat_dif1")
    1859                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1860                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$149       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    1863                      .dwattr $C$DW$149, DW_AT_name("pSegStat_dif2")
    1864                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_pSegStat_dif2")
    1865                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1866                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$150       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$21)
    1869                      .dwattr $C$DW$150, DW_AT_name("pEnhanced")
    1870                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_pEnhanced")
    1871                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1872                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1873              $C$DW$151       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$21)
    1875                      .dwattr $C$DW$151, DW_AT_name("bk_node_cnt")
    1876                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bk_node_cnt")
    1877                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1878                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1879                      .dwendtag $C$DW$T$23
    1880              
    1881              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
    1882                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$23)
    1883                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1884              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    1885                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1886                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    1887              
    1888              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1889                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    1890              $C$DW$152       .dwtag  DW_TAG_member
    1891                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$9)
    1892                      .dwattr $C$DW$152, DW_AT_name("sym_code")
    1893                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_sym_code")
    1894                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1895                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1896              $C$DW$153       .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$9)
    1898                      .dwattr $C$DW$153, DW_AT_name("start_cell")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   43

    1899                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_start_cell")
    1900                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1901                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1902              $C$DW$154       .dwtag  DW_TAG_member
    1903                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$9)
    1904                      .dwattr $C$DW$154, DW_AT_name("depth")
    1905                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_depth")
    1906                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1907                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1908                      .dwendtag $C$DW$T$24
    1909              
    1910              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
    1911                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$24)
    1912                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1913              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    1914                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    1915                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
    1916              
    1917              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1918                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    1919              $C$DW$155       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$8)
    1921                      .dwattr $C$DW$155, DW_AT_name("scr")
    1922                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_scr")
    1923                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1924                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1925              $C$DW$156       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$9)
    1927                      .dwattr $C$DW$156, DW_AT_name("sym")
    1928                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_sym")
    1929                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1930                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1931              $C$DW$157       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$9)
    1933                      .dwattr $C$DW$157, DW_AT_name("frm")
    1934                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_frm")
    1935                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1936                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1937                      .dwendtag $C$DW$T$25
    1938              
    1939              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
    1940                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$25)
    1941                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1942              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    1943                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1944                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
    1945              
    1946              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1947                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1948              $C$DW$158       .dwtag  DW_TAG_member
    1949                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$9)
    1950                      .dwattr $C$DW$158, DW_AT_name("frm")
    1951                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_frm")
    1952                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   44

    1954              $C$DW$159       .dwtag  DW_TAG_member
    1955                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$9)
    1956                      .dwattr $C$DW$159, DW_AT_name("beam_idx")
    1957                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_beam_idx")
    1958                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1959                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1960                      .dwendtag $C$DW$T$26
    1961              
    1962              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
    1963                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$26)
    1964                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1965              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    1966                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1967                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    1968              
    1969              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1970                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    1971              $C$DW$160       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$9)
    1973                      .dwattr $C$DW$160, DW_AT_name("n_hmm")
    1974                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_n_hmm")
    1975                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1976                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1977              $C$DW$161       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$9)
    1979                      .dwattr $C$DW$161, DW_AT_name("n_sym")
    1980                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_n_sym")
    1981                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1982                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$162       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$9)
    1985                      .dwattr $C$DW$162, DW_AT_name("n_word")
    1986                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_n_word")
    1987                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1988                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1989              $C$DW$163       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$9)
    1991                      .dwattr $C$DW$163, DW_AT_name("n_set")
    1992                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_n_set")
    1993                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1994                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$164       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$9)
    1997                      .dwattr $C$DW$164, DW_AT_name("n_hmm_set")
    1998                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_n_hmm_set")
    1999                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2000                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2001              $C$DW$165       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$9)
    2003                      .dwattr $C$DW$165, DW_AT_name("start")
    2004                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_start")
    2005                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2006                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$166       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   45

    2009                      .dwattr $C$DW$166, DW_AT_name("stop")
    2010                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_stop")
    2011                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2012                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$167       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    2015                      .dwattr $C$DW$167, DW_AT_name("symlist")
    2016                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_symlist")
    2017                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2018                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2019                      .dwendtag $C$DW$T$28
    2020              
    2021              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
    2022                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$28)
    2023                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2024              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    2025                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2026                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    2027              
    2028              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2029                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2030              $C$DW$168       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$9)
    2032                      .dwattr $C$DW$168, DW_AT_name("high_pos")
    2033                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_high_pos")
    2034                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2036              $C$DW$169       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$9)
    2038                      .dwattr $C$DW$169, DW_AT_name("cur_pos")
    2039                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_cur_pos")
    2040                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2041                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2042                      .dwendtag $C$DW$T$29
    2043              
    2044              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
    2045                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2046                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2047              
    2048              $C$DW$T$31      .dwtag  DW_TAG_array_type
    2049                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2050                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2051                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2052              $C$DW$170       .dwtag  DW_TAG_subrange_type
    2053                      .dwattr $C$DW$170, DW_AT_upper_bound(0x01)
    2054                      .dwendtag $C$DW$T$31
    2055              
    2056              
    2057              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2058                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    2059              $C$DW$171       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$30)
    2061                      .dwattr $C$DW$171, DW_AT_name("state")
    2062                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_state")
    2063                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   46

    2064                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2065              $C$DW$172       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    2067                      .dwattr $C$DW$172, DW_AT_name("sym")
    2068                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_sym")
    2069                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2070                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2071              $C$DW$173       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$30)
    2073                      .dwattr $C$DW$173, DW_AT_name("beam")
    2074                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_beam")
    2075                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2076                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2077              $C$DW$174       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$30)
    2079                      .dwattr $C$DW$174, DW_AT_name("time")
    2080                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_time")
    2081                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2082                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2083                      .dwendtag $C$DW$T$32
    2084              
    2085              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
    2086                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$32)
    2087                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2088              
    2089              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2090                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
    2091              $C$DW$175       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$33)
    2093                      .dwattr $C$DW$175, DW_AT_name("cur_sym")
    2094                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_cur_sym")
    2095                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2097              $C$DW$176       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$9)
    2099                      .dwattr $C$DW$176, DW_AT_name("cur_state")
    2100                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_cur_state")
    2101                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2102                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2103                      .dwendtag $C$DW$T$34
    2104              
    2105              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
    2106                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$34)
    2107                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2108              
    2109              $C$DW$T$82      .dwtag  DW_TAG_array_type
    2110                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2111                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2112                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x06)
    2113              $C$DW$177       .dwtag  DW_TAG_subrange_type
    2114                      .dwattr $C$DW$177, DW_AT_upper_bound(0x01)
    2115                      .dwendtag $C$DW$T$82
    2116              
    2117              
    2118              $C$DW$T$36      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   47

    2119                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    2120              $C$DW$178       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$9)
    2122                      .dwattr $C$DW$178, DW_AT_name("max_nbr_syms")
    2123                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_max_nbr_syms")
    2124                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2125                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2126              $C$DW$179       .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$8)
    2128                      .dwattr $C$DW$179, DW_AT_name("nbr_syms")
    2129                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_nbr_syms")
    2130                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2131                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2132              $C$DW$180       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    2134                      .dwattr $C$DW$180, DW_AT_name("sym2pos")
    2135                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_sym2pos")
    2136                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2137                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2138              $C$DW$181       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$35)
    2140                      .dwattr $C$DW$181, DW_AT_name("syms")
    2141                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_syms")
    2142                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2143                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2144                      .dwendtag $C$DW$T$36
    2145              
    2146              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
    2147                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$36)
    2148                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2149              
    2150              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2151                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    2152              $C$DW$182       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$8)
    2154                      .dwattr $C$DW$182, DW_AT_name("scr")
    2155                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_scr")
    2156                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2157                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2158              $C$DW$183       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$8)
    2160                      .dwattr $C$DW$183, DW_AT_name("n_ans")
    2161                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_n_ans")
    2162                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2163                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$184       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$37)
    2166                      .dwattr $C$DW$184, DW_AT_name("answers")
    2167                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_answers")
    2168                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2169                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2170                      .dwendtag $C$DW$T$38
    2171              
    2172              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
    2173                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   48

    2174                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2175              
    2176              $C$DW$T$41      .dwtag  DW_TAG_array_type
    2177                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2178                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2179                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
    2180              $C$DW$185       .dwtag  DW_TAG_subrange_type
    2181                      .dwattr $C$DW$185, DW_AT_upper_bound(0x1d)
    2182                      .dwendtag $C$DW$T$41
    2183              
    2184              
    2185              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2186                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
    2187              $C$DW$186       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$8)
    2189                      .dwattr $C$DW$186, DW_AT_name("n_bests")
    2190                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_n_bests")
    2191                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2192                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2193              $C$DW$187       .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$39)
    2195                      .dwattr $C$DW$187, DW_AT_name("best_idx")
    2196                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_best_idx")
    2197                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2198                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2199              $C$DW$188       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$41)
    2201                      .dwattr $C$DW$188, DW_AT_name("elem")
    2202                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_elem")
    2203                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2204                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2205                      .dwendtag $C$DW$T$42
    2206              
    2207              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
    2208                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$42)
    2209                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2210              
    2211              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2212                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
    2213              $C$DW$189       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    2215                      .dwattr $C$DW$189, DW_AT_name("alpha_p")
    2216                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_alpha_p")
    2217                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2218                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2219              $C$DW$190       .dwtag  DW_TAG_member
    2220                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2221                      .dwattr $C$DW$190, DW_AT_name("sAlpha")
    2222                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_sAlpha")
    2223                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2224                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2225              $C$DW$191       .dwtag  DW_TAG_member
    2226                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$8)
    2227                      .dwattr $C$DW$191, DW_AT_name("sBeta")
    2228                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_sBeta")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   49

    2229                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2230                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2231              $C$DW$192       .dwtag  DW_TAG_member
    2232                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$8)
    2233                      .dwattr $C$DW$192, DW_AT_name("lambdaLTEhigherE")
    2234                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
    2235                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2236                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2237              $C$DW$193       .dwtag  DW_TAG_member
    2238                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$8)
    2239                      .dwattr $C$DW$193, DW_AT_name("frm_count")
    2240                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_frm_count")
    2241                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2242                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2243              $C$DW$194       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    2245                      .dwattr $C$DW$194, DW_AT_name("prob_sp")
    2246                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_prob_sp")
    2247                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2248                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2249              $C$DW$195       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    2251                      .dwattr $C$DW$195, DW_AT_name("s_noise_floor")
    2252                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_s_noise_floor")
    2253                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2254                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2255              $C$DW$196       .dwtag  DW_TAG_member
    2256                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    2257                      .dwattr $C$DW$196, DW_AT_name("snr")
    2258                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_snr")
    2259                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2260                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2261              $C$DW$197       .dwtag  DW_TAG_member
    2262                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    2263                      .dwattr $C$DW$197, DW_AT_name("ps_long_term_noise")
    2264                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_ps_long_term_noise")
    2265                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2266                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2267              $C$DW$198       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$8)
    2269                      .dwattr $C$DW$198, DW_AT_name("frmEn")
    2270                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_frmEn")
    2271                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2272                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2273              $C$DW$199       .dwtag  DW_TAG_member
    2274                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$8)
    2275                      .dwattr $C$DW$199, DW_AT_name("meanEn")
    2276                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_meanEn")
    2277                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2278                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2279              $C$DW$200       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$8)
    2281                      .dwattr $C$DW$200, DW_AT_name("prevMeanEn")
    2282                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_prevMeanEn")
    2283                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   50

    2284                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2285              $C$DW$201       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$8)
    2287                      .dwattr $C$DW$201, DW_AT_name("noiselvl")
    2288                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_noiselvl")
    2289                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2290                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2291              $C$DW$202       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$8)
    2293                      .dwattr $C$DW$202, DW_AT_name("lambdaLTE")
    2294                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_lambdaLTE")
    2295                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2296                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2297              $C$DW$203       .dwtag  DW_TAG_member
    2298                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$8)
    2299                      .dwattr $C$DW$203, DW_AT_name("nbSpeechFrame")
    2300                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_nbSpeechFrame")
    2301                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2302                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2303              $C$DW$204       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$8)
    2305                      .dwattr $C$DW$204, DW_AT_name("hangOver")
    2306                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_hangOver")
    2307                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2308                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2309                      .dwendtag $C$DW$T$43
    2310              
    2311              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
    2312                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$43)
    2313                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2314              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    2315                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    2316                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    2317              
    2318              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2319                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
    2320              $C$DW$205       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$8)
    2322                      .dwattr $C$DW$205, DW_AT_name("mean")
    2323                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_mean")
    2324                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2325                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2326              $C$DW$206       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$8)
    2328                      .dwattr $C$DW$206, DW_AT_name("inv")
    2329                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_inv")
    2330                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2331                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2332              $C$DW$207       .dwtag  DW_TAG_member
    2333                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$8)
    2334                      .dwattr $C$DW$207, DW_AT_name("gconst")
    2335                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_gconst")
    2336                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2337                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2338                      .dwendtag $C$DW$T$44
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   51

    2339              
    2340              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
    2341                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    2342                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2343              
    2344              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2345                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
    2346              $C$DW$208       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$45)
    2348                      .dwattr $C$DW$208, DW_AT_name("base_mem")
    2349                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_base_mem")
    2350                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2351                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$209       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    2354                      .dwattr $C$DW$209, DW_AT_name("mem_count")
    2355                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_mem_count")
    2356                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
    2357                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$210       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    2360                      .dwattr $C$DW$210, DW_AT_name("answers")
    2361                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_answers")
    2362                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
    2363                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2364              $C$DW$211       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    2366                      .dwattr $C$DW$211, DW_AT_name("uStp")
    2367                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_uStp")
    2368                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
    2369                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2370              $C$DW$212       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    2372                      .dwattr $C$DW$212, DW_AT_name("nWords")
    2373                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_nWords")
    2374                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
    2375                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$213       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$8)
    2378                      .dwattr $C$DW$213, DW_AT_name("nS")
    2379                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_nS")
    2380                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
    2381                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2382              $C$DW$214       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$21)
    2384                      .dwattr $C$DW$214, DW_AT_name("cm_scr")
    2385                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_cm_scr")
    2386                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
    2387                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2388              $C$DW$215       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$8)
    2390                      .dwattr $C$DW$215, DW_AT_name("bNeedUpdate")
    2391                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_bNeedUpdate")
    2392                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
    2393                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   52

    2394              $C$DW$216       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$21)
    2396                      .dwattr $C$DW$216, DW_AT_name("cm_anti_scr")
    2397                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_cm_anti_scr")
    2398                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
    2399                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2400              $C$DW$217       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$12)
    2402                      .dwattr $C$DW$217, DW_AT_name("cm_fg_scr")
    2403                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_cm_fg_scr")
    2404                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
    2405                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2406              $C$DW$218       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$12)
    2408                      .dwattr $C$DW$218, DW_AT_name("cm_bk_scr")
    2409                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_cm_bk_scr")
    2410                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
    2411                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2412              $C$DW$219       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$8)
    2414                      .dwattr $C$DW$219, DW_AT_name("th_nbest")
    2415                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_th_nbest")
    2416                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
    2417                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2418              $C$DW$220       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$8)
    2420                      .dwattr $C$DW$220, DW_AT_name("nSpeech")
    2421                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_nSpeech")
    2422                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
    2423                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2424              $C$DW$221       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$8)
    2426                      .dwattr $C$DW$221, DW_AT_name("nNoise")
    2427                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_nNoise")
    2428                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
    2429                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2430              $C$DW$222       .dwtag  DW_TAG_member
    2431                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$12)
    2432                      .dwattr $C$DW$222, DW_AT_name("speech_power")
    2433                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_speech_power")
    2434                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
    2435                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2436              $C$DW$223       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$12)
    2438                      .dwattr $C$DW$223, DW_AT_name("noise_power")
    2439                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_noise_power")
    2440                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
    2441                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2442              $C$DW$224       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$12)
    2444                      .dwattr $C$DW$224, DW_AT_name("noise_power_sqr")
    2445                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_noise_power_sqr")
    2446                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
    2447                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2448              $C$DW$225       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   53

    2449                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$8)
    2450                      .dwattr $C$DW$225, DW_AT_name("NSNR")
    2451                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_NSNR")
    2452                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
    2453                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$226       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$46)
    2456                      .dwattr $C$DW$226, DW_AT_name("H0")
    2457                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_H0")
    2458                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    2459                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2460              $C$DW$227       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$46)
    2462                      .dwattr $C$DW$227, DW_AT_name("H1")
    2463                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_H1")
    2464                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    2465                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2466              $C$DW$228       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$21)
    2468                      .dwattr $C$DW$228, DW_AT_name("lgBeta")
    2469                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_lgBeta")
    2470                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    2471                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2472              $C$DW$229       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$47)
    2474                      .dwattr $C$DW$229, DW_AT_name("acc_dif2_beta")
    2475                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_acc_dif2_beta")
    2476                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    2477                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2478              $C$DW$230       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$8)
    2480                      .dwattr $C$DW$230, DW_AT_name("bCalced")
    2481                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_bCalced")
    2482                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    2483                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2484              $C$DW$231       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$21)
    2486                      .dwattr $C$DW$231, DW_AT_name("sCH")
    2487                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_sCH")
    2488                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    2489                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2490              $C$DW$232       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$47)
    2492                      .dwattr $C$DW$232, DW_AT_name("lAccum")
    2493                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_lAccum")
    2494                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    2495                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2496              $C$DW$233       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$8)
    2498                      .dwattr $C$DW$233, DW_AT_name("adp_th")
    2499                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_adp_th")
    2500                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    2501                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2502                      .dwendtag $C$DW$T$48
    2503              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   54

    2504              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    2505                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$48)
    2506                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2507              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    2508                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    2509                      .dwattr $C$DW$T$90, DW_AT_address_class(0x17)
    2510              
    2511              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2512                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x03)
    2513              $C$DW$234       .dwtag  DW_TAG_member
    2514                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$8)
    2515                      .dwattr $C$DW$234, DW_AT_name("norm0")
    2516                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_norm0")
    2517                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2518                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2519              $C$DW$235       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$8)
    2521                      .dwattr $C$DW$235, DW_AT_name("norm1")
    2522                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_norm1")
    2523                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2524                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2525              $C$DW$236       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$8)
    2527                      .dwattr $C$DW$236, DW_AT_name("norm2")
    2528                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_norm2")
    2529                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2530                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2531                      .dwendtag $C$DW$T$49
    2532              
    2533              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("NormType")
    2534                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$49)
    2535                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2536              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    2537                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    2538                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    2539              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2540                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2541                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2542                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2543              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2544                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2545                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2546                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2547              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2548                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2549                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2550                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2551              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2552                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2553                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2554                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2555              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2556                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2557                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2558                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   55

    2559              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    2560                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$8)
    2561                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    2562              
    2563              $C$DW$T$39      .dwtag  DW_TAG_array_type
    2564                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
    2565                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2566                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    2567              $C$DW$237       .dwtag  DW_TAG_subrange_type
    2568                      .dwattr $C$DW$237, DW_AT_upper_bound(0x1d)
    2569                      .dwendtag $C$DW$T$39
    2570              
    2571              
    2572              $C$DW$T$45      .dwtag  DW_TAG_array_type
    2573                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$8)
    2574                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2575                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x514)
    2576              $C$DW$238       .dwtag  DW_TAG_subrange_type
    2577                      .dwattr $C$DW$238, DW_AT_upper_bound(0x513)
    2578                      .dwendtag $C$DW$T$45
    2579              
    2580              
    2581              $C$DW$T$51      .dwtag  DW_TAG_array_type
    2582                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    2583                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2584                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    2585              $C$DW$239       .dwtag  DW_TAG_subrange_type
    2586                      .dwattr $C$DW$239, DW_AT_upper_bound(0xff)
    2587                      .dwendtag $C$DW$T$51
    2588              
    2589              
    2590              $C$DW$T$52      .dwtag  DW_TAG_array_type
    2591                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    2592                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2593                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x10)
    2594              $C$DW$240       .dwtag  DW_TAG_subrange_type
    2595                      .dwattr $C$DW$240, DW_AT_upper_bound(0x0f)
    2596                      .dwendtag $C$DW$T$52
    2597              
    2598              
    2599              $C$DW$T$53      .dwtag  DW_TAG_array_type
    2600                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
    2601                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2602                      .dwattr $C$DW$T$53, DW_AT_byte_size(0xe0)
    2603              $C$DW$241       .dwtag  DW_TAG_subrange_type
    2604                      .dwattr $C$DW$241, DW_AT_upper_bound(0x0d)
    2605              $C$DW$242       .dwtag  DW_TAG_subrange_type
    2606                      .dwattr $C$DW$242, DW_AT_upper_bound(0x0f)
    2607                      .dwendtag $C$DW$T$53
    2608              
    2609              $C$DW$243       .dwtag  DW_TAG_TI_far_type
    2610                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$8)
    2611              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2612                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$243)
    2613              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   56

    2614                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2615                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    2616              
    2617              $C$DW$T$56      .dwtag  DW_TAG_array_type
    2618                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2619                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2620                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x20)
    2621              $C$DW$244       .dwtag  DW_TAG_subrange_type
    2622                      .dwattr $C$DW$244, DW_AT_upper_bound(0x0f)
    2623                      .dwendtag $C$DW$T$56
    2624              
    2625              
    2626              $C$DW$T$60      .dwtag  DW_TAG_array_type
    2627                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    2628                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2629                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x80)
    2630              $C$DW$245       .dwtag  DW_TAG_subrange_type
    2631                      .dwattr $C$DW$245, DW_AT_upper_bound(0x7f)
    2632                      .dwendtag $C$DW$T$60
    2633              
    2634              
    2635              $C$DW$T$61      .dwtag  DW_TAG_array_type
    2636                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$8)
    2637                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2638                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x1a)
    2639              $C$DW$246       .dwtag  DW_TAG_subrange_type
    2640                      .dwattr $C$DW$246, DW_AT_upper_bound(0x19)
    2641                      .dwendtag $C$DW$T$61
    2642              
    2643              
    2644              $C$DW$T$79      .dwtag  DW_TAG_array_type
    2645                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$8)
    2646                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2647                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x20)
    2648              $C$DW$247       .dwtag  DW_TAG_subrange_type
    2649                      .dwattr $C$DW$247, DW_AT_upper_bound(0x1f)
    2650                      .dwendtag $C$DW$T$79
    2651              
    2652              
    2653              $C$DW$T$85      .dwtag  DW_TAG_array_type
    2654                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$8)
    2655                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2656                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x14)
    2657              $C$DW$248       .dwtag  DW_TAG_subrange_type
    2658                      .dwattr $C$DW$248, DW_AT_upper_bound(0x13)
    2659                      .dwendtag $C$DW$T$85
    2660              
    2661              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2662                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2663                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2664                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2665              
    2666              $C$DW$T$27      .dwtag  DW_TAG_array_type
    2667                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    2668                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   57

    2669                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2670              $C$DW$249       .dwtag  DW_TAG_subrange_type
    2671                      .dwattr $C$DW$249, DW_AT_upper_bound(0x00)
    2672                      .dwendtag $C$DW$T$27
    2673              
    2674              
    2675              $C$DW$T$33      .dwtag  DW_TAG_array_type
    2676                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    2677                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2678                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2679              $C$DW$250       .dwtag  DW_TAG_subrange_type
    2680                      .dwattr $C$DW$250, DW_AT_upper_bound(0x01)
    2681                      .dwendtag $C$DW$T$33
    2682              
    2683              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2684                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    2685                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    2686              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    2687                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    2688                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2689              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    2690                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    2691                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    2692              
    2693              $C$DW$T$37      .dwtag  DW_TAG_array_type
    2694                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
    2695                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2696                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    2697              $C$DW$251       .dwtag  DW_TAG_subrange_type
    2698                      .dwattr $C$DW$251, DW_AT_upper_bound(0x13)
    2699                      .dwendtag $C$DW$T$37
    2700              
    2701              
    2702              $C$DW$T$86      .dwtag  DW_TAG_array_type
    2703                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$20)
    2704                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2705                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x02)
    2706              $C$DW$252       .dwtag  DW_TAG_subrange_type
    2707                      .dwattr $C$DW$252, DW_AT_upper_bound(0x01)
    2708                      .dwendtag $C$DW$T$86
    2709              
    2710              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2711                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2712                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2713                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2714              $C$DW$253       .dwtag  DW_TAG_TI_far_type
    2715                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$10)
    2716              $C$DW$T$115     .dwtag  DW_TAG_const_type
    2717                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$253)
    2718              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2719                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2720                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2721                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2722              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2723                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   58

    2724                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2725                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2726              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    2727                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
    2728                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    2729              
    2730              $C$DW$T$62      .dwtag  DW_TAG_array_type
    2731                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$12)
    2732                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2733                      .dwattr $C$DW$T$62, DW_AT_byte_size(0xd0)
    2734              $C$DW$254       .dwtag  DW_TAG_subrange_type
    2735                      .dwattr $C$DW$254, DW_AT_upper_bound(0x67)
    2736                      .dwendtag $C$DW$T$62
    2737              
    2738              
    2739              $C$DW$T$65      .dwtag  DW_TAG_array_type
    2740                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$12)
    2741                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2742                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x20)
    2743              $C$DW$255       .dwtag  DW_TAG_subrange_type
    2744                      .dwattr $C$DW$255, DW_AT_upper_bound(0x0f)
    2745                      .dwendtag $C$DW$T$65
    2746              
    2747              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2748                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2749                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2750                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2751              $C$DW$T$14      .dwtag  DW_TAG_base_type
    2752                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2753                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    2754                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    2755                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    2756                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    2757              $C$DW$T$15      .dwtag  DW_TAG_base_type
    2758                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2759                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2760                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    2761                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    2762                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    2763              $C$DW$T$16      .dwtag  DW_TAG_base_type
    2764                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2765                      .dwattr $C$DW$T$16, DW_AT_name("float")
    2766                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    2767              $C$DW$T$17      .dwtag  DW_TAG_base_type
    2768                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2769                      .dwattr $C$DW$T$17, DW_AT_name("double")
    2770                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    2771              $C$DW$T$18      .dwtag  DW_TAG_base_type
    2772                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2773                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    2774                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    2775              $C$DW$T$74      .dwtag  DW_TAG_base_type
    2776                      .dwattr $C$DW$T$74, DW_AT_encoding(DW_ATE_signed_char)
    2777                      .dwattr $C$DW$T$74, DW_AT_name("signed char")
    2778                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   59

    2779              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    2780                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2781                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    2782              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    2783                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$75)
    2784                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    2785              
    2786              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2787                      .dwattr $C$DW$T$50, DW_AT_name("ele")
    2788                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x03)
    2789              $C$DW$256       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$9)
    2791                      .dwattr $C$DW$256, DW_AT_name("sym")
    2792                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_sym")
    2793                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2795              $C$DW$257       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$9)
    2797                      .dwattr $C$DW$257, DW_AT_name("idx_flag")
    2798                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_idx_flag")
    2799                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2800                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2801              $C$DW$258       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$9)
    2803                      .dwattr $C$DW$258, DW_AT_name("next")
    2804                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_next")
    2805                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2806                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2807                      .dwendtag $C$DW$T$50
    2808              
    2809              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    2810                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$50)
    2811                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2812              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    2813                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2814                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    2815              
    2816              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    2817                      .dwattr $C$DW$T$91, DW_AT_name("gmhmm_type")
    2818                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x7fe)
    2819              $C$DW$259       .dwtag  DW_TAG_member
    2820                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2821                      .dwattr $C$DW$259, DW_AT_name("avedepth")
    2822                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_avedepth")
    2823                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2824                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2825              $C$DW$260       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2827                      .dwattr $C$DW$260, DW_AT_name("bestdepth")
    2828                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_bestdepth")
    2829                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2830                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2831              $C$DW$261       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2833                      .dwattr $C$DW$261, DW_AT_name("index_mean")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   60

    2834                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_index_mean")
    2835                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2836                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2837              $C$DW$262       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2839                      .dwattr $C$DW$262, DW_AT_name("signal_cnt")
    2840                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_signal_cnt")
    2841                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2842                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2843              $C$DW$263       .dwtag  DW_TAG_member
    2844                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$8)
    2845                      .dwattr $C$DW$263, DW_AT_name("buf_idx")
    2846                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_buf_idx")
    2847                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2848                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2849              $C$DW$264       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2851                      .dwattr $C$DW$264, DW_AT_name("speech_detected")
    2852                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_speech_detected")
    2853                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2854                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2855              $C$DW$265       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2857                      .dwattr $C$DW$265, DW_AT_name("mfcc_cnt")
    2858                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_mfcc_cnt")
    2859                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2860                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2861              $C$DW$266       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2863                      .dwattr $C$DW$266, DW_AT_name("nbr_cpy")
    2864                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_nbr_cpy")
    2865                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2866                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2867              $C$DW$267       .dwtag  DW_TAG_member
    2868                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$8)
    2869                      .dwattr $C$DW$267, DW_AT_name("last_sig")
    2870                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_last_sig")
    2871                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2872                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2873              $C$DW$268       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$51)
    2875                      .dwattr $C$DW$268, DW_AT_name("sample_signal")
    2876                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_sample_signal")
    2877                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2878                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2879              $C$DW$269       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$8)
    2881                      .dwattr $C$DW$269, DW_AT_name("amplitude_max")
    2882                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_amplitude_max")
    2883                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    2884                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2885              $C$DW$270       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$8)
    2887                      .dwattr $C$DW$270, DW_AT_name("amplitude_min")
    2888                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_amplitude_min")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   61

    2889                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    2890                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2891              $C$DW$271       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$8)
    2893                      .dwattr $C$DW$271, DW_AT_name("pred_first_frame")
    2894                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_pred_first_frame")
    2895                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    2896                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2897              $C$DW$272       .dwtag  DW_TAG_member
    2898                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$8)
    2899                      .dwattr $C$DW$272, DW_AT_name("frm_cnt")
    2900                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_frm_cnt")
    2901                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    2902                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2903              $C$DW$273       .dwtag  DW_TAG_member
    2904                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$8)
    2905                      .dwattr $C$DW$273, DW_AT_name("beam_count")
    2906                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_beam_count")
    2907                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    2908                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2909              $C$DW$274       .dwtag  DW_TAG_member
    2910                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$8)
    2911                      .dwattr $C$DW$274, DW_AT_name("active_beam_cells")
    2912                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_active_beam_cells")
    2913                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    2914                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2915              $C$DW$275       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$8)
    2917                      .dwattr $C$DW$275, DW_AT_name("active_time_cells")
    2918                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_active_time_cells")
    2919                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    2920                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2921              $C$DW$276       .dwtag  DW_TAG_member
    2922                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$9)
    2923                      .dwattr $C$DW$276, DW_AT_name("ending_sym_count")
    2924                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_ending_sym_count")
    2925                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2926                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2927              $C$DW$277       .dwtag  DW_TAG_member
    2928                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$8)
    2929                      .dwattr $C$DW$277, DW_AT_name("comp_type")
    2930                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_comp_type")
    2931                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    2932                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2933              $C$DW$278       .dwtag  DW_TAG_member
    2934                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$9)
    2935                      .dwattr $C$DW$278, DW_AT_name("low_vol_limit")
    2936                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_low_vol_limit")
    2937                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    2938                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2939              $C$DW$279       .dwtag  DW_TAG_member
    2940                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$9)
    2941                      .dwattr $C$DW$279, DW_AT_name("high_vol_limit")
    2942                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_high_vol_limit")
    2943                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:10 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2226410                         PAGE   62

    2944                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2945              $C$DW$280       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$8)
    2947                      .dwattr $C$DW$280, DW_AT_name("vol")
    2948                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_vol")
    2949                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2950                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2951              $C$DW$281       .dwtag  DW_TAG_member
    2952                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2953                      .dwattr $C$DW$281, DW_AT_name("n_mfcc")
    2954                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_n_mfcc")
    2955                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    2956                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2957              $C$DW$282       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$8)
    2959                      .dwattr $C$DW$282, DW_AT_name("nbr_dim")
    2960                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_nbr_dim")
    2961                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    2962                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2963              $C$DW$283       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2965                      .dwattr $C$DW$283, DW_AT_name("n_filter")
    2966                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_n_filter")
    2967                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    2968                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2969              $C$DW$284       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$53)
    2971                      .dwattr $C$DW$284, DW_AT_name("mfcc_buf")
    2972                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_mfcc_buf")
    2973                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2974                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2975              $C$DW$285       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$52)
    2977                      .dwattr $C$DW$285, DW_AT_name("mfcc_mean")
    2978                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_mfcc_mean")
