TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE    1

    2484              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Wed Sep 13 16:34:11 2017                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --object_format=coff --sil
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     246                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_gv")
     247                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$92)
     248                      .dwattr $C$DW$21, DW_AT_location[DW_OP_bregx 0x24 0]
     249              $C$DW$22        .dwtag  DW_TAG_variable, DW_AT_name("volume_flag")
     250                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_volume_flag")
     251                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$8)
     252                      .dwattr $C$DW$22, DW_AT_location[DW_OP_bregx 0x24 2]
     253              $C$DW$23        .dwtag  DW_TAG_variable, DW_AT_name("volume")
     254                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_volume")
     255                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$9)
     256                      .dwattr $C$DW$23, DW_AT_location[DW_OP_bregx 0x24 3]
     257 000002 EB00          MOV XAR0, dbl(*SP(#0))
         000004 85   
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE    6

     258                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     259 000005 ED00          MOV dbl(*SP(#0)), XAR3
         000007 BF   
     260 000008 A06D          MOV *AR3(#266), AC0 ; |78| 
         00000a 010A 
     261 00000c D86D          SUB AC0, *AR3(#265), AC0 ; |78| 
         00000e 0001 
         000010 09   
     262 000011 4440          SFTS AC0, #-1 ; |78| 
     263 000013 C006          MOV AC0, *SP(#3) ; |78| 
     264                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     265 000015 ED00          MOV dbl(*SP(#0)), XAR3
         000017 BF   
     266 000018 220A          MOV AC0, AR2 ; |80| 
     267 00001a A96D          MOV *AR3(#274), AR1 ; |80| 
         00001c 0112 
     268 00001e 12A8          CMPU AR2 >= AR1, TC1 ; |80| 
         000020 94   
     269 000021 62E4          BCC $C$L1,TC1 ; |80| 
     270                                                      ; branchcc occurs ; |80| 
     271                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     272 000023 E604          MOV #0, *SP(#2) ; |82| 
         000025 00   
     273                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     274 000026 4A11          B $C$L3   ; |83| 
     275                                                      ; branch occurs ; |83| 
     276 000028       $C$L1:    
     277                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     278 000028 A96D          MOV *AR3(#275), AR1 ; |85| 
         00002a 0113 
     279 00002c 1298          CMPU AR2 <= AR1, TC1 ; |85| 
         00002e A4   
     280 00002f 62E4          BCC $C$L2,TC1 ; |85| 
     281                                                      ; branchcc occurs ; |85| 
     282                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     283 000031 E604          MOV #1, *SP(#2) ; |87| 
         000033 01   
     284                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     285 000034 4A03          B $C$L3   ; |88| 
     286                                                      ; branch occurs ; |88| 
     287 000036       $C$L2:    
     288                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     289 000036 E604          MOV #2, *SP(#2) ; |91| 
         000038 02   
     290 000039       $C$L3:    
     291                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     292 000039 A404          MOV *SP(#2), T0 ; |94| 
     293                      .dwpsn  file "C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL_bitbucket/c55_csl/c55x
     294 00003b 4E05          AADD #5, SP
     295                      .dwcfi  cfa_offset, 1
     296              $C$DW$24        .dwtag  DW_TAG_TI_branch
     297                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     298                      .dwattr $C$DW$24, DW_AT_TI_return
     299 00003d 4804          RET
     300                                                      ; return occurs
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE    7

     301                      .dwattr $C$DW$19, DW_AT_TI_end_file("C:/Users/a0221074/Desktop/C5000/IBM_Watson_TIdesign_workarea/CSL
     302                      .dwattr $C$DW$19, DW_AT_TI_end_line(0x5f)
     303                      .dwattr $C$DW$19, DW_AT_TI_end_column(0x01)
     304                      .dwendentry
     305                      .dwendtag $C$DW$19
     306              
     307              
     308              ;*******************************************************************************
     309              ;* TYPE INFORMATION                                                            *
     310              ;*******************************************************************************
     311              
     312              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     313                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x03)
     314              $C$DW$25        .dwtag  DW_TAG_member
     315                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$8)
     316                      .dwattr $C$DW$25, DW_AT_name("num")
     317                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_num")
     318                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     319                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     320              $C$DW$26        .dwtag  DW_TAG_member
     321                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$8)
     322                      .dwattr $C$DW$26, DW_AT_name("x1")
     323                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_x1")
     324                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     325                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     326              $C$DW$27        .dwtag  DW_TAG_member
     327                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$8)
     328                      .dwattr $C$DW$27, DW_AT_name("x2")
     329                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_x2")
     330                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     331                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     332                      .dwendtag $C$DW$T$19
     333              
     334              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("mel_filter_type")
     335                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$19)
     336                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
     337              $C$DW$28        .dwtag  DW_TAG_TI_far_type
     338                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$56)
     339              $C$DW$T$57      .dwtag  DW_TAG_const_type
     340                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$28)
     341              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
     342                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
     343                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
     344              
     345              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     346                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     347              $C$DW$29        .dwtag  DW_TAG_member
     348                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$20)
     349                      .dwattr $C$DW$29, DW_AT_name("max_mem_usage")
     350                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_max_mem_usage")
     351                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     352                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     353              $C$DW$30        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
     355                      .dwattr $C$DW$30, DW_AT_name("n_terminals")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE    8

     356                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_n_terminals")
     357                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     358                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     359              $C$DW$31        .dwtag  DW_TAG_member
     360                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     361                      .dwattr $C$DW$31, DW_AT_name("n_monophones")
     362                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_n_monophones")
     363                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     364                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     365              $C$DW$32        .dwtag  DW_TAG_member
     366                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$21)
     367                      .dwattr $C$DW$32, DW_AT_name("hlrTreeBase")
     368                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_hlrTreeBase")
     369                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     370                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     371              $C$DW$33        .dwtag  DW_TAG_member
     372                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     373                      .dwattr $C$DW$33, DW_AT_name("hlrTerminal")
     374                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_hlrTerminal")
     375                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     376                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     377              $C$DW$34        .dwtag  DW_TAG_member
     378                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$21)
     379                      .dwattr $C$DW$34, DW_AT_name("pHMM2phone")
     380                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_pHMM2phone")
     381                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     382                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     383              $C$DW$35        .dwtag  DW_TAG_member
     384                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
     385                      .dwattr $C$DW$35, DW_AT_name("hlrTransformIndex")
     386                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_hlrTransformIndex")
     387                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     388                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     389              $C$DW$36        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$20)
     391                      .dwattr $C$DW$36, DW_AT_name("hlr_TRANSFORM_SIZE")
     392                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_hlr_TRANSFORM_SIZE")
     393                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     394                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     395              $C$DW$37        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$21)
     397                      .dwattr $C$DW$37, DW_AT_name("hlrTransforms")
     398                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_hlrTransforms")
     399                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     400                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     401              $C$DW$38        .dwtag  DW_TAG_member
     402                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$21)
     403                      .dwattr $C$DW$38, DW_AT_name("pSegStat_dif1")
     404                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_pSegStat_dif1")
     405                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     406                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     407              $C$DW$39        .dwtag  DW_TAG_member
     408                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$21)
     409                      .dwattr $C$DW$39, DW_AT_name("pSegStat_dif2")
     410                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_pSegStat_dif2")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE    9

     411                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     412                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     413              $C$DW$40        .dwtag  DW_TAG_member
     414                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$21)
     415                      .dwattr $C$DW$40, DW_AT_name("pEnhanced")
     416                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_pEnhanced")
     417                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     418                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     419              $C$DW$41        .dwtag  DW_TAG_member
     420                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$21)
     421                      .dwattr $C$DW$41, DW_AT_name("bk_node_cnt")
     422                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_bk_node_cnt")
     423                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     424                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     425                      .dwendtag $C$DW$T$23
     426              
     427              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("FeaHLRAccType")
     428                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$23)
     429                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     430              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
     431                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
     432                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
     433              
     434              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     435                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
     436              $C$DW$42        .dwtag  DW_TAG_member
     437                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$9)
     438                      .dwattr $C$DW$42, DW_AT_name("sym_code")
     439                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_sym_code")
     440                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     441                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     442              $C$DW$43        .dwtag  DW_TAG_member
     443                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$9)
     444                      .dwattr $C$DW$43, DW_AT_name("start_cell")
     445                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_start_cell")
     446                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     447                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     448              $C$DW$44        .dwtag  DW_TAG_member
     449                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$9)
     450                      .dwattr $C$DW$44, DW_AT_name("depth")
     451                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_depth")
     452                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     453                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     454                      .dwendtag $C$DW$T$24
     455              
     456              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("SymCell")
     457                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$24)
     458                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     459              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
     460                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
     461                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
     462              
     463              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     464                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
     465              $C$DW$45        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   10

     466                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$8)
     467                      .dwattr $C$DW$45, DW_AT_name("scr")
     468                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_scr")
     469                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     470                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     471              $C$DW$46        .dwtag  DW_TAG_member
     472                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$9)
     473                      .dwattr $C$DW$46, DW_AT_name("sym")
     474                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_sym")
     475                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     476                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     477              $C$DW$47        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$9)
     479                      .dwattr $C$DW$47, DW_AT_name("frm")
     480                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_frm")
     481                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     482                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     483                      .dwendtag $C$DW$T$25
     484              
     485              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("StateCell")
     486                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$25)
     487                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     488              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
     489                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
     490                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
     491              
     492              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     493                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     494              $C$DW$48        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$9)
     496                      .dwattr $C$DW$48, DW_AT_name("frm")
     497                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_frm")
     498                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     499                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     500              $C$DW$49        .dwtag  DW_TAG_member
     501                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$9)
     502                      .dwattr $C$DW$49, DW_AT_name("beam_idx")
     503                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_beam_idx")
     504                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     505                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     506                      .dwendtag $C$DW$T$26
     507              
     508              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("TimeType")
     509                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$26)
     510                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     511              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
     512                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
     513                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
     514              
     515              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     516                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
     517              $C$DW$50        .dwtag  DW_TAG_member
     518                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$9)
     519                      .dwattr $C$DW$50, DW_AT_name("n_hmm")
     520                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_n_hmm")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   11

     521                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     522                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     523              $C$DW$51        .dwtag  DW_TAG_member
     524                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$9)
     525                      .dwattr $C$DW$51, DW_AT_name("n_sym")
     526                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_n_sym")
     527                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     528                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     529              $C$DW$52        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$9)
     531                      .dwattr $C$DW$52, DW_AT_name("n_word")
     532                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_n_word")
     533                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     534                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     535              $C$DW$53        .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$9)
     537                      .dwattr $C$DW$53, DW_AT_name("n_set")
     538                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_n_set")
     539                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     540                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     541              $C$DW$54        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$9)
     543                      .dwattr $C$DW$54, DW_AT_name("n_hmm_set")
     544                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_n_hmm_set")
     545                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     546                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     547              $C$DW$55        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$9)
     549                      .dwattr $C$DW$55, DW_AT_name("start")
     550                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_start")
     551                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     552                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     553              $C$DW$56        .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$9)
     555                      .dwattr $C$DW$56, DW_AT_name("stop")
     556                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_stop")
     557                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     558                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     559              $C$DW$57        .dwtag  DW_TAG_member
     560                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$27)
     561                      .dwattr $C$DW$57, DW_AT_name("symlist")
     562                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_symlist")
     563                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     564                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     565                      .dwendtag $C$DW$T$28
     566              
     567              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("TransType")
     568                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
     569                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
     570              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
     571                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
     572                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
     573              
     574              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     575                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   12

     576              $C$DW$58        .dwtag  DW_TAG_member
     577                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$9)
     578                      .dwattr $C$DW$58, DW_AT_name("high_pos")
     579                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_high_pos")
     580                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     582              $C$DW$59        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$9)
     584                      .dwattr $C$DW$59, DW_AT_name("cur_pos")
     585                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_cur_pos")
     586                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     587                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     588                      .dwendtag $C$DW$T$29
     589              
     590              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PosType")
     591                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     592                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     593              
     594              $C$DW$T$31      .dwtag  DW_TAG_array_type
     595                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     596                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     597                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
     598              $C$DW$60        .dwtag  DW_TAG_subrange_type
     599                      .dwattr $C$DW$60, DW_AT_upper_bound(0x01)
     600                      .dwendtag $C$DW$T$31
     601              
     602              
     603              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     604                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
     605              $C$DW$61        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$30)
     607                      .dwattr $C$DW$61, DW_AT_name("state")
     608                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_state")
     609                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     610                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     611              $C$DW$62        .dwtag  DW_TAG_member
     612                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$31)
     613                      .dwattr $C$DW$62, DW_AT_name("sym")
     614                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_sym")
     615                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     616                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     617              $C$DW$63        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$30)
     619                      .dwattr $C$DW$63, DW_AT_name("beam")
     620                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_beam")
     621                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     622                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     623              $C$DW$64        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$30)
     625                      .dwattr $C$DW$64, DW_AT_name("time")
     626                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_time")
     627                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     628                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     629                      .dwendtag $C$DW$T$32
     630              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   13

     631              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("EvalStat")
     632                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$32)
     633                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     634              
     635              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     636                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x03)
     637              $C$DW$65        .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$33)
     639                      .dwattr $C$DW$65, DW_AT_name("cur_sym")
     640                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_cur_sym")
     641                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     642                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     643              $C$DW$66        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$9)
     645                      .dwattr $C$DW$66, DW_AT_name("cur_state")
     646                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_cur_state")
     647                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     648                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     649                      .dwendtag $C$DW$T$34
     650              
     651              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("EvalIdx")
     652                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
     653                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     654              
     655              $C$DW$T$81      .dwtag  DW_TAG_array_type
     656                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
     657                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
     658                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x06)
     659              $C$DW$67        .dwtag  DW_TAG_subrange_type
     660                      .dwattr $C$DW$67, DW_AT_upper_bound(0x01)
     661                      .dwendtag $C$DW$T$81
     662              
     663              
     664              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     665                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
     666              $C$DW$68        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$9)
     668                      .dwattr $C$DW$68, DW_AT_name("max_nbr_syms")
     669                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_max_nbr_syms")
     670                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     671                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     672              $C$DW$69        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$8)
     674                      .dwattr $C$DW$69, DW_AT_name("nbr_syms")
     675                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_nbr_syms")
     676                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     677                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     678              $C$DW$70        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
     680                      .dwattr $C$DW$70, DW_AT_name("sym2pos")
     681                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_sym2pos")
     682                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     683                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     684              $C$DW$71        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$35)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   14

     686                      .dwattr $C$DW$71, DW_AT_name("syms")
     687                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_syms")
     688                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     689                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     690                      .dwendtag $C$DW$T$36
     691              
     692              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Sym2PosType")
     693                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
     694                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
     695              
     696              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     697                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
     698              $C$DW$72        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$8)
     700                      .dwattr $C$DW$72, DW_AT_name("scr")
     701                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_scr")
     702                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     704              $C$DW$73        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$8)
     706                      .dwattr $C$DW$73, DW_AT_name("n_ans")
     707                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_n_ans")
     708                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     709                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     710              $C$DW$74        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$37)
     712                      .dwattr $C$DW$74, DW_AT_name("answers")
     713                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_answers")
     714                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     715                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     716                      .dwendtag $C$DW$T$38
     717              
     718              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("NB_element")
     719                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
     720                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     721              
     722              $C$DW$T$41      .dwtag  DW_TAG_array_type
     723                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
     724                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     725                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x294)
     726              $C$DW$75        .dwtag  DW_TAG_subrange_type
     727                      .dwattr $C$DW$75, DW_AT_upper_bound(0x1d)
     728                      .dwendtag $C$DW$T$41
     729              
     730              
     731              $C$DW$T$42      .dwtag  DW_TAG_structure_type
     732                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b3)
     733              $C$DW$76        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$8)
     735                      .dwattr $C$DW$76, DW_AT_name("n_bests")
     736                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_n_bests")
     737                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     738                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     739              $C$DW$77        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$39)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   15

     741                      .dwattr $C$DW$77, DW_AT_name("best_idx")
     742                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_best_idx")
     743                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     744                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     745              $C$DW$78        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$41)
     747                      .dwattr $C$DW$78, DW_AT_name("elem")
     748                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_elem")
     749                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     750                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     751                      .dwendtag $C$DW$T$42
     752              
     753              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("NB_words")
     754                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
     755                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
     756              
     757              $C$DW$T$43      .dwtag  DW_TAG_structure_type
     758                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
     759              $C$DW$79        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
     761                      .dwattr $C$DW$79, DW_AT_name("alpha_p")
     762                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_alpha_p")
     763                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     765              $C$DW$80        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
     767                      .dwattr $C$DW$80, DW_AT_name("sAlpha")
     768                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_sAlpha")
     769                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     770                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     771              $C$DW$81        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$8)
     773                      .dwattr $C$DW$81, DW_AT_name("sBeta")
     774                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_sBeta")
     775                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     776                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     777              $C$DW$82        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$8)
     779                      .dwattr $C$DW$82, DW_AT_name("lambdaLTEhigherE")
     780                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_lambdaLTEhigherE")
     781                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     782                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     783              $C$DW$83        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$8)
     785                      .dwattr $C$DW$83, DW_AT_name("frm_count")
     786                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_frm_count")
     787                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     788                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     789              $C$DW$84        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
     791                      .dwattr $C$DW$84, DW_AT_name("prob_sp")
     792                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_prob_sp")
     793                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     794                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     795              $C$DW$85        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   16

     796                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
     797                      .dwattr $C$DW$85, DW_AT_name("s_noise_floor")
     798                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_s_noise_floor")
     799                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     800                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     801              $C$DW$86        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
     803                      .dwattr $C$DW$86, DW_AT_name("snr")
     804                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_snr")
     805                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     806                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     807              $C$DW$87        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
     809                      .dwattr $C$DW$87, DW_AT_name("ps_long_term_noise")
     810                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_ps_long_term_noise")
     811                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     812                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     813              $C$DW$88        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$8)
     815                      .dwattr $C$DW$88, DW_AT_name("frmEn")
     816                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_frmEn")
     817                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     818                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     819              $C$DW$89        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$8)
     821                      .dwattr $C$DW$89, DW_AT_name("meanEn")
     822                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_meanEn")
     823                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     824                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     825              $C$DW$90        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$8)
     827                      .dwattr $C$DW$90, DW_AT_name("prevMeanEn")
     828                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_prevMeanEn")
     829                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     830                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     831              $C$DW$91        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$8)
     833                      .dwattr $C$DW$91, DW_AT_name("noiselvl")
     834                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_noiselvl")
     835                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     836                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     837              $C$DW$92        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$8)
     839                      .dwattr $C$DW$92, DW_AT_name("lambdaLTE")
     840                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_lambdaLTE")
     841                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     842                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     843              $C$DW$93        .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$8)
     845                      .dwattr $C$DW$93, DW_AT_name("nbSpeechFrame")
     846                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_nbSpeechFrame")
     847                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     848                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     849              $C$DW$94        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   17

     851                      .dwattr $C$DW$94, DW_AT_name("hangOver")
     852                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_hangOver")
     853                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     854                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     855                      .dwendtag $C$DW$T$43
     856              
     857              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("NssType")
     858                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$43)
     859                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
     860              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
     861                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
     862                      .dwattr $C$DW$T$87, DW_AT_address_class(0x17)
     863              
     864              $C$DW$T$44      .dwtag  DW_TAG_structure_type
     865                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x03)
     866              $C$DW$95        .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$8)
     868                      .dwattr $C$DW$95, DW_AT_name("mean")
     869                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_mean")
     870                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     872              $C$DW$96        .dwtag  DW_TAG_member
     873                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$8)
     874                      .dwattr $C$DW$96, DW_AT_name("inv")
     875                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_inv")
     876                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     877                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     878              $C$DW$97        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$8)
     880                      .dwattr $C$DW$97, DW_AT_name("gconst")
     881                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_gconst")
     882                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     883                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     884                      .dwendtag $C$DW$T$44
     885              
     886              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CM_hypo")
     887                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
     888                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     889              
     890              $C$DW$T$48      .dwtag  DW_TAG_structure_type
     891                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x544)
     892              $C$DW$98        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$45)
     894                      .dwattr $C$DW$98, DW_AT_name("base_mem")
     895                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_base_mem")
     896                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     898              $C$DW$99        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
     900                      .dwattr $C$DW$99, DW_AT_name("mem_count")
     901                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_mem_count")
     902                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x514]
     903                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     904              $C$DW$100       .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   18

     906                      .dwattr $C$DW$100, DW_AT_name("answers")
     907                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_answers")
     908                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x516]
     909                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     910              $C$DW$101       .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
     912                      .dwattr $C$DW$101, DW_AT_name("uStp")
     913                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_uStp")
     914                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x518]
     915                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     916              $C$DW$102       .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
     918                      .dwattr $C$DW$102, DW_AT_name("nWords")
     919                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_nWords")
     920                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x51a]
     921                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$103       .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$8)
     924                      .dwattr $C$DW$103, DW_AT_name("nS")
     925                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_nS")
     926                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x51b]
     927                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$104       .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
     930                      .dwattr $C$DW$104, DW_AT_name("cm_scr")
     931                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_cm_scr")
     932                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x51c]
     933                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     934              $C$DW$105       .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$8)
     936                      .dwattr $C$DW$105, DW_AT_name("bNeedUpdate")
     937                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bNeedUpdate")
     938                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x51e]
     939                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     940              $C$DW$106       .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
     942                      .dwattr $C$DW$106, DW_AT_name("cm_anti_scr")
     943                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_cm_anti_scr")
     944                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x520]
     945                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     946              $C$DW$107       .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$12)
     948                      .dwattr $C$DW$107, DW_AT_name("cm_fg_scr")
     949                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_cm_fg_scr")
     950                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x522]
     951                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     952              $C$DW$108       .dwtag  DW_TAG_member
     953                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$12)
     954                      .dwattr $C$DW$108, DW_AT_name("cm_bk_scr")
     955                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_cm_bk_scr")
     956                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x524]
     957                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     958              $C$DW$109       .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$8)
     960                      .dwattr $C$DW$109, DW_AT_name("th_nbest")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   19

     961                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_th_nbest")
     962                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x526]
     963                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     964              $C$DW$110       .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$8)
     966                      .dwattr $C$DW$110, DW_AT_name("nSpeech")
     967                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_nSpeech")
     968                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x527]
     969                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     970              $C$DW$111       .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$8)
     972                      .dwattr $C$DW$111, DW_AT_name("nNoise")
     973                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_nNoise")
     974                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x528]
     975                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     976              $C$DW$112       .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$12)
     978                      .dwattr $C$DW$112, DW_AT_name("speech_power")
     979                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_speech_power")
     980                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x52a]
     981                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$113       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$12)
     984                      .dwattr $C$DW$113, DW_AT_name("noise_power")
     985                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_noise_power")
     986                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x52c]
     987                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     988              $C$DW$114       .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$12)
     990                      .dwattr $C$DW$114, DW_AT_name("noise_power_sqr")
     991                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_noise_power_sqr")
     992                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x52e]
     993                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     994              $C$DW$115       .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$8)
     996                      .dwattr $C$DW$115, DW_AT_name("NSNR")
     997                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_NSNR")
     998                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x530]
     999                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1000              $C$DW$116       .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$46)
    1002                      .dwattr $C$DW$116, DW_AT_name("H0")
    1003                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_H0")
    1004                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x531]
    1005                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1006              $C$DW$117       .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$46)
    1008                      .dwattr $C$DW$117, DW_AT_name("H1")
    1009                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_H1")
    1010                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x534]
    1011                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1012              $C$DW$118       .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    1014                      .dwattr $C$DW$118, DW_AT_name("lgBeta")
    1015                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_lgBeta")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   20

    1016                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x538]
    1017                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$119       .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$47)
    1020                      .dwattr $C$DW$119, DW_AT_name("acc_dif2_beta")
    1021                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_acc_dif2_beta")
    1022                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x53a]
    1023                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$120       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$8)
    1026                      .dwattr $C$DW$120, DW_AT_name("bCalced")
    1027                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bCalced")
    1028                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x53c]
    1029                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1030              $C$DW$121       .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1032                      .dwattr $C$DW$121, DW_AT_name("sCH")
    1033                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_sCH")
    1034                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x53e]
    1035                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$122       .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$47)
    1038                      .dwattr $C$DW$122, DW_AT_name("lAccum")
    1039                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_lAccum")
    1040                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    1041                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1042              $C$DW$123       .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$8)
    1044                      .dwattr $C$DW$123, DW_AT_name("adp_th")
    1045                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_adp_th")
    1046                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x542]
    1047                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1048                      .dwendtag $C$DW$T$48
    1049              
    1050              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ConfType")
    1051                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$48)
    1052                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1053              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    1054                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1055                      .dwattr $C$DW$T$89, DW_AT_address_class(0x17)
    1056              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1057                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1058                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1059                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1060              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1061                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1062                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1063                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1064              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1065                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1066                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1067                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1068              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1069                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1070                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   21

    1071                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1072              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1073                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1074                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1075                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1076              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    1077                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$8)
    1078                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    1079              
    1080              $C$DW$T$39      .dwtag  DW_TAG_array_type
    1081                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$8)
    1082                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1083                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    1084              $C$DW$124       .dwtag  DW_TAG_subrange_type
    1085                      .dwattr $C$DW$124, DW_AT_upper_bound(0x1d)
    1086                      .dwendtag $C$DW$T$39
    1087              
    1088              
    1089              $C$DW$T$45      .dwtag  DW_TAG_array_type
    1090                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$8)
    1091                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1092                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x514)
    1093              $C$DW$125       .dwtag  DW_TAG_subrange_type
    1094                      .dwattr $C$DW$125, DW_AT_upper_bound(0x513)
    1095                      .dwendtag $C$DW$T$45
    1096              
    1097              
    1098              $C$DW$T$50      .dwtag  DW_TAG_array_type
    1099                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$8)
    1100                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1101                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x100)
    1102              $C$DW$126       .dwtag  DW_TAG_subrange_type
    1103                      .dwattr $C$DW$126, DW_AT_upper_bound(0xff)
    1104                      .dwendtag $C$DW$T$50
    1105              
    1106              
    1107              $C$DW$T$51      .dwtag  DW_TAG_array_type
    1108                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$8)
    1109                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1110                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    1111              $C$DW$127       .dwtag  DW_TAG_subrange_type
    1112                      .dwattr $C$DW$127, DW_AT_upper_bound(0x0f)
    1113                      .dwendtag $C$DW$T$51
    1114              
    1115              
    1116              $C$DW$T$52      .dwtag  DW_TAG_array_type
    1117                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    1118                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1119                      .dwattr $C$DW$T$52, DW_AT_byte_size(0xe0)
    1120              $C$DW$128       .dwtag  DW_TAG_subrange_type
    1121                      .dwattr $C$DW$128, DW_AT_upper_bound(0x0d)
    1122              $C$DW$129       .dwtag  DW_TAG_subrange_type
    1123                      .dwattr $C$DW$129, DW_AT_upper_bound(0x0f)
    1124                      .dwendtag $C$DW$T$52
    1125              
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   22

    1126              $C$DW$130       .dwtag  DW_TAG_TI_far_type
    1127                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$8)
    1128              $C$DW$T$53      .dwtag  DW_TAG_const_type
    1129                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$130)
    1130              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    1131                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1132                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    1133              
    1134              $C$DW$T$55      .dwtag  DW_TAG_array_type
    1135                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1136                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1137                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x20)
    1138              $C$DW$131       .dwtag  DW_TAG_subrange_type
    1139                      .dwattr $C$DW$131, DW_AT_upper_bound(0x0f)
    1140                      .dwendtag $C$DW$T$55
    1141              
    1142              
    1143              $C$DW$T$59      .dwtag  DW_TAG_array_type
    1144                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$8)
    1145                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1146                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x80)
    1147              $C$DW$132       .dwtag  DW_TAG_subrange_type
    1148                      .dwattr $C$DW$132, DW_AT_upper_bound(0x7f)
    1149                      .dwendtag $C$DW$T$59
    1150              
    1151              
    1152              $C$DW$T$60      .dwtag  DW_TAG_array_type
    1153                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    1154                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1155                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x1a)
    1156              $C$DW$133       .dwtag  DW_TAG_subrange_type
    1157                      .dwattr $C$DW$133, DW_AT_upper_bound(0x19)
    1158                      .dwendtag $C$DW$T$60
    1159              
    1160              
    1161              $C$DW$T$78      .dwtag  DW_TAG_array_type
    1162                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$8)
    1163                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1164                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x20)
    1165              $C$DW$134       .dwtag  DW_TAG_subrange_type
    1166                      .dwattr $C$DW$134, DW_AT_upper_bound(0x1f)
    1167                      .dwendtag $C$DW$T$78
    1168              
    1169              
    1170              $C$DW$T$84      .dwtag  DW_TAG_array_type
    1171                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$8)
    1172                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1173                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x14)
    1174              $C$DW$135       .dwtag  DW_TAG_subrange_type
    1175                      .dwattr $C$DW$135, DW_AT_upper_bound(0x13)
    1176                      .dwendtag $C$DW$T$84
    1177              
    1178              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1179                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1180                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   23

    1181                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1182              
    1183              $C$DW$T$27      .dwtag  DW_TAG_array_type
    1184                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    1185                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1186                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1187              $C$DW$136       .dwtag  DW_TAG_subrange_type
    1188                      .dwattr $C$DW$136, DW_AT_upper_bound(0x00)
    1189                      .dwendtag $C$DW$T$27
    1190              
    1191              
    1192              $C$DW$T$33      .dwtag  DW_TAG_array_type
    1193                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    1194                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1195                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1196              $C$DW$137       .dwtag  DW_TAG_subrange_type
    1197                      .dwattr $C$DW$137, DW_AT_upper_bound(0x01)
    1198                      .dwendtag $C$DW$T$33
    1199              
    1200              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1201                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
    1202                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1203              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("ushort")
    1204                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    1205                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1206              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    1207                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
    1208                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    1209              
    1210              $C$DW$T$37      .dwtag  DW_TAG_array_type
    1211                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
    1212                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1213                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    1214              $C$DW$138       .dwtag  DW_TAG_subrange_type
    1215                      .dwattr $C$DW$138, DW_AT_upper_bound(0x13)
    1216                      .dwendtag $C$DW$T$37
    1217              
    1218              
    1219              $C$DW$T$85      .dwtag  DW_TAG_array_type
    1220                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
    1221                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1222                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    1223              $C$DW$139       .dwtag  DW_TAG_subrange_type
    1224                      .dwattr $C$DW$139, DW_AT_upper_bound(0x01)
    1225                      .dwendtag $C$DW$T$85
    1226              
    1227              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1228                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1229                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1230                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1231              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1232                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1233                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1234                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1235              $C$DW$T$12      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   24

    1236                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1237                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1238                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1239              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1240                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
    1241                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    1242              
    1243              $C$DW$T$61      .dwtag  DW_TAG_array_type
    1244                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$12)
    1245                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1246                      .dwattr $C$DW$T$61, DW_AT_byte_size(0xd0)
    1247              $C$DW$140       .dwtag  DW_TAG_subrange_type
    1248                      .dwattr $C$DW$140, DW_AT_upper_bound(0x67)
    1249                      .dwendtag $C$DW$T$61
    1250              
    1251              
    1252              $C$DW$T$64      .dwtag  DW_TAG_array_type
    1253                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
    1254                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1255                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x20)
    1256              $C$DW$141       .dwtag  DW_TAG_subrange_type
    1257                      .dwattr $C$DW$141, DW_AT_upper_bound(0x0f)
    1258                      .dwendtag $C$DW$T$64
    1259              
    1260              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1261                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1262                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1263                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1264              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1265                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1266                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1267                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1268                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1269                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1270              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1271                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1272                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1273                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1274                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1275                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1276              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1277                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1278                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1279                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1280              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1281                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1282                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1283                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1284              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1285                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1286                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1287                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1288              $C$DW$T$73      .dwtag  DW_TAG_base_type
    1289                      .dwattr $C$DW$T$73, DW_AT_encoding(DW_ATE_signed_char)
    1290                      .dwattr $C$DW$T$73, DW_AT_name("signed char")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   25

    1291                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    1292              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    1293                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1294                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    1295              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    1296                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$74)
    1297                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    1298              
    1299              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1300                      .dwattr $C$DW$T$49, DW_AT_name("ele")
    1301                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x03)
    1302              $C$DW$142       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$9)
    1304                      .dwattr $C$DW$142, DW_AT_name("sym")
    1305                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_sym")
    1306                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1308              $C$DW$143       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$9)
    1310                      .dwattr $C$DW$143, DW_AT_name("idx_flag")
    1311                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_idx_flag")
    1312                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1313                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1314              $C$DW$144       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$9)
    1316                      .dwattr $C$DW$144, DW_AT_name("next")
    1317                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_next")
    1318                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1319                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1320                      .dwendtag $C$DW$T$49
    1321              
    1322              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("BeamType")
    1323                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$49)
    1324                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1325              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    1326                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    1327                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    1328              
    1329              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    1330                      .dwattr $C$DW$T$90, DW_AT_name("gmhmm_type")
    1331                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x7fe)
    1332              $C$DW$145       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1334                      .dwattr $C$DW$145, DW_AT_name("avedepth")
    1335                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_avedepth")
    1336                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1338              $C$DW$146       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1340                      .dwattr $C$DW$146, DW_AT_name("bestdepth")
    1341                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_bestdepth")
    1342                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1343                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1344              $C$DW$147       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   26

    1346                      .dwattr $C$DW$147, DW_AT_name("index_mean")
    1347                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_index_mean")
    1348                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1349                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$148       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    1352                      .dwattr $C$DW$148, DW_AT_name("signal_cnt")
    1353                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_signal_cnt")
    1354                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1355                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1356              $C$DW$149       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$8)
    1358                      .dwattr $C$DW$149, DW_AT_name("buf_idx")
    1359                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_buf_idx")
    1360                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1361                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$150       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    1364                      .dwattr $C$DW$150, DW_AT_name("speech_detected")
    1365                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_speech_detected")
    1366                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1367                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1368              $C$DW$151       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    1370                      .dwattr $C$DW$151, DW_AT_name("mfcc_cnt")
    1371                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_mfcc_cnt")
    1372                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1373                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1374              $C$DW$152       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    1376                      .dwattr $C$DW$152, DW_AT_name("nbr_cpy")
    1377                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_nbr_cpy")
    1378                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1379                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1380              $C$DW$153       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$8)
    1382                      .dwattr $C$DW$153, DW_AT_name("last_sig")
    1383                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_last_sig")
    1384                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1385                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1386              $C$DW$154       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$50)
    1388                      .dwattr $C$DW$154, DW_AT_name("sample_signal")
    1389                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_sample_signal")
    1390                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1391                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$155       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$8)
    1394                      .dwattr $C$DW$155, DW_AT_name("amplitude_max")
    1395                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_amplitude_max")
    1396                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
    1397                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1398              $C$DW$156       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$8)
    1400                      .dwattr $C$DW$156, DW_AT_name("amplitude_min")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   27

    1401                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_amplitude_min")
    1402                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    1403                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1404              $C$DW$157       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$8)
    1406                      .dwattr $C$DW$157, DW_AT_name("pred_first_frame")
    1407                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_pred_first_frame")
    1408                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x10b]
    1409                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1410              $C$DW$158       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$8)
    1412                      .dwattr $C$DW$158, DW_AT_name("frm_cnt")
    1413                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_frm_cnt")
    1414                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    1415                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1416              $C$DW$159       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$8)
    1418                      .dwattr $C$DW$159, DW_AT_name("beam_count")
    1419                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_beam_count")
    1420                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10d]
    1421                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1422              $C$DW$160       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$8)
    1424                      .dwattr $C$DW$160, DW_AT_name("active_beam_cells")
    1425                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_active_beam_cells")
    1426                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    1427                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1428              $C$DW$161       .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$8)
    1430                      .dwattr $C$DW$161, DW_AT_name("active_time_cells")
    1431                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_active_time_cells")
    1432                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    1433                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1434              $C$DW$162       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$9)
    1436                      .dwattr $C$DW$162, DW_AT_name("ending_sym_count")
    1437                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ending_sym_count")
    1438                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1439                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1440              $C$DW$163       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$8)
    1442                      .dwattr $C$DW$163, DW_AT_name("comp_type")
    1443                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_comp_type")
    1444                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x111]
    1445                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1446              $C$DW$164       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$9)
    1448                      .dwattr $C$DW$164, DW_AT_name("low_vol_limit")
    1449                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_low_vol_limit")
    1450                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    1451                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1452              $C$DW$165       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$9)
    1454                      .dwattr $C$DW$165, DW_AT_name("high_vol_limit")
    1455                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_high_vol_limit")
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   28

    1456                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x113]
    1457                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1458              $C$DW$166       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$8)
    1460                      .dwattr $C$DW$166, DW_AT_name("vol")
    1461                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_vol")
    1462                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1463                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1464              $C$DW$167       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1466                      .dwattr $C$DW$167, DW_AT_name("n_mfcc")
    1467                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_n_mfcc")
    1468                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x115]
    1469                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1470              $C$DW$168       .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$8)
    1472                      .dwattr $C$DW$168, DW_AT_name("nbr_dim")
    1473                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_nbr_dim")
    1474                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    1475                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1476              $C$DW$169       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1478                      .dwattr $C$DW$169, DW_AT_name("n_filter")
    1479                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_n_filter")
    1480                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x117]
    1481                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1482              $C$DW$170       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$52)
    1484                      .dwattr $C$DW$170, DW_AT_name("mfcc_buf")
    1485                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_mfcc_buf")
    1486                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    1487                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1488              $C$DW$171       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$51)
    1490                      .dwattr $C$DW$171, DW_AT_name("mfcc_mean")
    1491                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_mfcc_mean")
    1492                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f8]
    1493                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1494              $C$DW$172       .dwtag  DW_TAG_member
    1495                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$55)
    1496                      .dwattr $C$DW$172, DW_AT_name("cosxfm")
    1497                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_cosxfm")
    1498                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    1499                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1500              $C$DW$173       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$58)
    1502                      .dwattr $C$DW$173, DW_AT_name("mel_filter")
    1503                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_mel_filter")
    1504                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
    1505                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1506              $C$DW$174       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$8)
    1508                      .dwattr $C$DW$174, DW_AT_name("th_noise_flr")
    1509                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_th_noise_flr")
    1510                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x22a]
TMS320C55x Assembler PC v4.4.1 Wed Sep 13 16:34:12 2017

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0221074\AppData\Local\Temp\2233210                         PAGE   29

    1511                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1512              $C$DW$175       .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$8)
    1514                      .dwattr $C$DW$175, DW_AT_name("th_speech_delta")
    1515                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_th_speech_delta")
    1516                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x22b]
    1517                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1518              $C$DW$176       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$8)
    1520                      .dwattr $C$DW$176, DW_AT_name("th_min_speech_db")
    1521                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_th_min_speech_db")
    1522                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x22c]
    1523                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$177       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$8)
